<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>mkvextract</title><meta name="generator" content="DocBook XSL Stylesheets V1.75.2"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div lang="ja" class="refentry" title="mkvextract"><a name="mkvextract"></a><div class="titlepage"></div><div class="refnamediv"><h2>&#21517;&#21069;</h2><p>mkvextract &#8212; <span class="productname">Matroska</span>&#8482; &#12501;&#12449;&#12452;&#12523;&#12363;&#12425;&#12289;&#20182;&#12398;&#24418;&#24335;&#12398;&#12501;&#12449;&#12452;&#12523;&#12434;&#25277;&#20986;&#12377;&#12427;</p></div><div class="refsynopsisdiv" title="&#26360;&#24335;"><a name="mkvextract.synopsis"></a><h2>&#26360;&#24335;</h2><div class="cmdsynopsis"><p><code class="command">mkvextract</code>  {mode} {source-filename} [options] [extraction-spec]</p></div></div><div class="refsect1" title="&#35500;&#26126;"><a name="mkvextract.description"></a><h2>&#35500;&#26126;</h2><p>
   <span class="productname">Matroska</span>&#8482;
&#12501;&#12449;&#12452;&#12523;&#12398;&#29305;&#23450;&#12398;&#37096;&#20998;&#12434;&#12289;&#20182;&#12398;&#26377;&#29992;&#12394;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12391;&#25277;&#20986;&#12375;&#12414;&#12377;&#12290;&#26368;&#21021;&#12398;<code class="option">mode</code>&#24341;&#25968;&#12399;&#12289;<span class="citerefentry"><span class="refentrytitle">mkvextract</span>(1)</span>
&#12395;&#20309;&#12434;&#25277;&#20986;&#12377;&#12409;&#12365;&#12363;&#12434;&#25351;&#31034;&#12375;&#12414;&#12377;&#12290;&#29694;&#22312;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12427;&#12398;&#12399;&#12289;<a class="link" href="#mkvextract.description.tracks" title="&#12488;&#12521;&#12483;&#12463;&#25277;&#20986;&#12514;&#12540;&#12489;">&#12488;&#12521;&#12483;&#12463;</a>&#12289;<a class="link" href="#mkvextract.description.tags" title="&#12479;&#12464;&#25277;&#20986;&#12514;&#12540;&#12489;">&#12479;&#12464;</a>&#12289;<a class="link" href="#mkvextract.description.attachments" title="&#28155;&#20184;&#12501;&#12449;&#12452;&#12523;&#25277;&#20986;&#12514;&#12540;&#12489;">&#28155;&#20184;&#12501;&#12449;&#12452;&#12523;</a>&#12289;<a class="link" href="#mkvextract.description.chapters" title="&#12481;&#12515;&#12503;&#12479;&#25277;&#20986;&#12514;&#12540;&#12489;">&#12481;&#12515;&#12503;&#12479;</a>&#12289;<a class="link" href="#mkvextract.description.cuesheets" title="CUE&#12471;&#12540;&#12488;&#25277;&#20986;&#12514;&#12540;&#12489;">CUE&#12471;&#12540;&#12488;</a> &#21450;&#12403; <a class="link" href="#mkvextract.description.timecodes_v2" title="&#12479;&#12452;&#12512;&#12467;&#12540;&#12489;&#25277;&#20986;&#12514;&#12540;&#12489;">&#12479;&#12452;&#12512;&#12467;&#12540;&#12489;</a>&#12398;&#25277;&#20986;&#12391;&#12377;&#12290;&#20108;&#20491;&#30446;&#12398;&#24341;&#25968;&#12399;&#12477;&#12540;&#12473;&#12501;&#12449;&#12452;&#12523;&#12398;&#21517;&#21069;&#12391;&#12377;&#12290;&#12371;&#12428;&#12399;<span class="productname">Matroska</span>&#8482;&#12501;&#12449;&#12452;&#12523;&#12391;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;&#32154;&#12367;&#20840;&#12390;&#12398;&#24341;&#25968;&#12399;&#12289;&#12458;&#12503;&#12471;&#12519;&#12531;&#12392;&#25277;&#20986;&#35373;&#23450;&#12391;&#12377;&#12290;&#12371;&#12428;&#12425;&#12399;&#25351;&#23450;&#12373;&#12428;&#12383;mode&#12395;&#20381;&#23384;&#12375;&#12414;&#12377;&#12290;
  </p><div class="refsect2" title="&#20849;&#36890;&#12458;&#12503;&#12471;&#12519;&#12531;"><a name="mkvextract.description.common"></a><h3>&#20849;&#36890;&#12458;&#12503;&#12471;&#12519;&#12531;</h3><p>
    &#20197;&#19979;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#20840;&#12390;&#12398;mode&#12391;&#20351;&#29992;&#12391;&#12365;&#12427;&#12398;&#12391;&#12289;&#12371;&#12398;&#12475;&#12463;&#12471;&#12519;&#12531;&#12391;&#19968;&#25324;&#12375;&#12390;&#35500;&#26126;&#12375;&#12414;&#12377;&#12290;
   </p><div class="variablelist"><dl><dt><a name="mkvextract.description.parse_fully"></a><span class="term"><code class="option">-f</code>, <code class="option">--parse-fully</code></span></dt><dd><p>
       &#35299;&#26512;&#12514;&#12540;&#12489;&#12434;'full'&#12395;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12514;&#12540;&#12489;&#12391;&#12399;&#12289;&#12477;&#12540;&#12473;&#12501;&#12449;&#12452;&#12523;&#12398;&#24517;&#35201;&#12394;&#35201;&#32032;&#12434;&#35211;&#12388;&#12369;&#12427;&#12398;&#12395;&#12501;&#12449;&#12452;&#12523;&#20840;&#20307;&#12434;&#35299;&#26512;&#12379;&#12378;&#12395;&#12513;&#12479;&#12471;&#12540;&#12463;&#35201;&#32032;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;99%&#12398;&#12465;&#12540;&#12473;&#12391;&#12399;&#12371;&#12428;&#12391;&#21313;&#20998;&#12391;&#12377;&#12364;&#12289;&#12513;&#12479;&#12471;&#12540;&#12463;&#35201;&#32032;&#12364;&#21547;&#12414;&#12428;&#12390;&#12356;&#12394;&#12363;&#12387;&#12383;&#12426;&#22730;&#12428;&#12390;&#12356;&#12383;&#12426;&#12377;&#12427;&#12501;&#12449;&#12452;&#12523;&#12395;&#12399;&#12371;&#12398;&#12514;&#12540;&#12489;&#12434;&#20351;&#29992;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;&#39640;&#36895;&#12473;&#12461;&#12515;&#12531;&#12364;&#25968;&#31186;&#12375;&#12363;&#12363;&#12363;&#12425;&#12394;&#12356;&#12398;&#12395;&#23550;&#12375;&#12390;&#12289;&#12501;&#12449;&#12452;&#12523;&#12434;&#12501;&#12523;&#12473;&#12461;&#12515;&#12531;&#12377;&#12427;&#12398;&#12395;&#12399;&#25968;&#20998;&#12363;&#12363;&#12427;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
      </p></dd><dt><a name="mkvextract.description.common.command_line_charset"></a><span class="term"><code class="option">--command-line-charset</code> <em class="parameter"><code>character-set</code></em></span></dt><dd><p>
       &#12467;&#12510;&#12531;&#12489;&#12521;&#12452;&#12531;&#25991;&#23383;&#21015;&#12398;&#25991;&#23383;&#12467;&#12540;&#12489;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12399;&#12289;&#12471;&#12473;&#12486;&#12512;&#12398;&#29694;&#22312;&#12398;&#12525;&#12465;&#12540;&#12523;&#12398;&#25991;&#23383;&#12467;&#12540;&#12489;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
      </p></dd><dt><a name="mkvextract.description.common.output_charset"></a><span class="term"><code class="option">--output-charset</code> <em class="parameter"><code>character-set</code></em></span></dt><dd><p>
       &#20986;&#21147;&#12377;&#12427;&#25991;&#23383;&#12467;&#12540;&#12489;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12399;&#12289;&#12471;&#12473;&#12486;&#12512;&#12398;&#29694;&#22312;&#12398;&#12525;&#12465;&#12540;&#12523;&#12398;&#25991;&#23383;&#12467;&#12540;&#12489;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
      </p></dd><dt><a name="mkvextract.description.common.redirect_output"></a><span class="term"><code class="option">-r</code>, <code class="option">--redirect-output</code>
<em class="parameter"><code>file-name</code></em></span></dt><dd><p>
       &#20840;&#12390;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#12289;&#12467;&#12531;&#12477;&#12540;&#12523;&#12391;&#12399;&#12394;&#12367;<em class="parameter"><code>file-name</code></em>&#12395;&#26360;&#12365;&#20986;&#12375;&#12414;&#12377;&#12290;&#20986;&#21147;&#12434;&#12522;&#12480;&#12452;&#12524;&#12463;&#12488;&#12377;&#12427;&#12371;&#12392;&#12391;&#21516;&#12376;&#12371;&#12392;&#12364;&#23481;&#26131;&#12395;&#21487;&#33021;&#12391;&#12377;&#12364;&#12289;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#24517;&#35201;&#12395;&#12394;&#12427;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;&#12479;&#12540;&#12511;&#12490;&#12523;&#12364;&#20986;&#21147;&#12434;&#12289;&#12501;&#12449;&#12452;&#12523;&#12395;&#26360;&#12365;&#20986;&#12377;&#21069;&#12395;&#20966;&#29702;&#12375;&#12390;&#12375;&#12414;&#12358;&#22580;&#21512;&#12394;&#12393;&#12391;&#12377;&#12290;<a class="link" href="#mkvextract.description.common.output_charset"><code class="option">--output-charset</code></a>&#12395;&#12424;&#12387;&#12390;&#25351;&#23450;&#12373;&#12428;&#12383;&#25991;&#23383;&#12467;&#12540;&#12489;&#12399;&#23562;&#37325;&#12373;&#12428;&#12414;&#12377;&#12290;
      </p></dd><dt><a name="mkvextract.description.common.ui_language"></a><span class="term"><code class="option">--ui-language</code> <em class="parameter"><code>code</code></em></span></dt><dd><p>
       &#25351;&#23450;&#12375;&#12383;<em class="parameter"><code>code</code></em>&#12434;&#24375;&#21046;&#30340;&#12395;&#35328;&#35486;&#12467;&#12540;&#12489;(&#20363;:
&#26085;&#26412;&#35486;&#12394;&#12425;&#12400;'<code class="literal">ja_JP</code>')&#12392;&#12375;&#12390;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;&#12375;&#12363;&#12375;&#12289;&#29872;&#22659;&#22793;&#25968;<code class="varname">LANG</code>&#12420;<code class="varname">LC_MESSAGES</code>&#12289;<code class="varname">LC_ALL</code>&#12434;&#20351;&#29992;&#12375;&#12383;&#12411;&#12358;&#12364;&#22909;&#12414;&#12375;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;<em class="parameter"><code>code</code></em>&#12395;<code class="literal">list</code>&#12392;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;&#25351;&#23450;&#12391;&#12365;&#12427;&#35328;&#35486;&#12467;&#12540;&#12489;&#12398;&#19968;&#35239;&#12434;&#20986;&#21147;&#12375;&#12414;&#12377;&#12290;
      </p></dd><dt><span class="term"><code class="option">-v</code>, <code class="option">--verbose</code></span></dt><dd><p>
       &#20986;&#21147;&#12364;&#20887;&#38263;&#12395;&#12394;&#12426;&#12289;<span class="productname">Matroska</span>&#8482;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12395;&#12392;&#12387;&#12390;&#37325;&#35201;&#12394;&#12371;&#12392;&#20840;&#12390;&#12434;&#12289;&#35501;&#12415;&#36796;&#12414;&#12428;&#12427;&#12388;&#12393;&#12395;&#34920;&#31034;&#12375;&#12390;&#12356;&#12365;&#12414;&#12377;&#12290;
      </p></dd><dt><span class="term"><code class="option">-h</code>, <code class="option">--help</code></span></dt><dd><p>
       &#12467;&#12510;&#12531;&#12489;&#26360;&#24335;&#24773;&#22577;&#12434;&#20986;&#21147;&#12375;&#12390;&#32066;&#20102;&#12375;&#12414;&#12377;&#12290;
      </p></dd><dt><span class="term"><code class="option">-V</code>, <code class="option">--version</code></span></dt><dd><p>
       &#12496;&#12540;&#12472;&#12519;&#12531;&#24773;&#22577;&#12434;&#20986;&#21147;&#12375;&#12390;&#32066;&#20102;&#12375;&#12414;&#12377;&#12290;
      </p></dd><dt><span class="term"><code class="option">@</code>options-file</span></dt><dd><p>
       <em class="parameter"><code>options-file</code></em>&#12391;&#25351;&#23450;&#12373;&#12428;&#12383;&#12501;&#12449;&#12452;&#12523;&#12363;&#12425;&#36861;&#21152;&#12398;&#12467;&#12510;&#12531;&#12489;&#12521;&#12452;&#12531;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#35501;&#12415;&#36796;&#12415;&#12414;&#12377;&#12290;&#34892;&#12391;&#26368;&#21021;&#12398;&#31354;&#30333;&#25991;&#23383;&#12391;&#12394;&#12356;&#25991;&#23383;&#12364;&#12495;&#12483;&#12471;&#12517;&#12510;&#12540;&#12463;('<code class="literal">#</code>')&#12391;&#12354;&#12427;&#34892;&#12399;&#12467;&#12513;&#12531;&#12488;&#12392;&#12375;&#12390;&#25201;&#12431;&#12428;&#12289;&#28961;&#35222;&#12373;&#12428;&#12414;&#12377;&#12290;&#34892;&#38957;&#12289;&#21450;&#12403;&#34892;&#26411;&#12398;&#31354;&#30333;&#25991;&#23383;&#12399;&#21462;&#12426;&#38500;&#12363;&#12428;&#12414;&#12377;&#12290;&#21508;&#34892;&#12395;&#12399;&#19968;&#12388;&#12378;&#12388;&#12375;&#12363;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#25351;&#23450;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#12513;&#12479;&#12461;&#12515;&#12521;&#12463;&#12479;&#12398;&#12456;&#12473;&#12465;&#12540;&#12503;&#12399;&#24517;&#35201;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
      </p><p>
       '<span class="command"><strong>mkvextract tracks source.mkv --raw
1:destination.raw</strong></span>'&#12392;&#12356;&#12358;&#12467;&#12510;&#12531;&#12489;&#12521;&#12452;&#12531;&#12392;&#21516;&#12376;&#12371;&#12392;&#12399;&#12289;&#27425;&#12398;&#12424;&#12358;&#12394;&#12458;&#12503;&#12471;&#12519;&#12531;&#12501;&#12449;&#12452;&#12523;&#12395;&#12424;&#12387;&#12390;&#25351;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;
      </p><pre class="programlisting">
# source.mkv &#12363;&#12425;&#12488;&#12521;&#12483;&#12463;&#12434;&#25277;&#20986;
tracks
source.mkv
# &#12488;&#12521;&#12483;&#12463;&#12434;raw&#12487;&#12540;&#12479;&#12392;&#12375;&#12390;&#20986;&#21147;
--raw 
1:destination.raw
      </pre></dd></dl></div></div><div class="refsect2" title="&#12488;&#12521;&#12483;&#12463;&#25277;&#20986;&#12514;&#12540;&#12489;"><a name="mkvextract.description.tracks"></a><h3>&#12488;&#12521;&#12483;&#12463;&#25277;&#20986;&#12514;&#12540;&#12489;</h3><p>
    &#26360;&#24335;: <span class="command"><strong>mkvextract</strong></span> <code class="option">tracks</code>
<em class="parameter"><code>source-filename</code></em>
[<span class="optional"><em class="parameter"><code>options</code></em></span>]
<em class="parameter"><code>TID1:dest-filename1</code></em>
[<span class="optional"><em class="parameter"><code>TID2:dest-filename2</code></em> ...</span>]
   </p><p>
    &#20197;&#19979;&#12398;&#12467;&#12510;&#12531;&#12489;&#12521;&#12452;&#12531;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12488;&#12521;&#12483;&#12463;&#25277;&#20986;&#12514;&#12540;&#12489;&#12391;&#12399;&#21508;&#12488;&#12521;&#12483;&#12463;&#27598;&#12395;&#25351;&#23450;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#12371;&#12428;&#12425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#20316;&#29992;&#12377;&#12427;&#12488;&#12521;&#12483;&#12463;&#25351;&#23450;&#23376;(&#19979;&#35352;&#21442;&#29031;)&#12398;&#21069;&#12395;&#25351;&#23450;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
   </p><div class="variablelist"><dl><dt><span class="term"><code class="option">-c</code> <em class="parameter"><code>character-set</code></em></span></dt><dd><p>
       &#30452;&#24460;&#12398;&#23383;&#24149;&#12488;&#12521;&#12483;&#12463;&#12398;&#20986;&#21147;&#25991;&#23383;&#12467;&#12540;&#12489;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#30452;&#24460;&#12398;&#12488;&#12521;&#12483;&#12463;ID&#12364;&#25351;&#12377;&#12398;&#12364;&#12289;&#23383;&#24149;&#12488;&#12521;&#12483;&#12463;&#12398;&#12392;&#12365;&#12398;&#12415;&#26377;&#21177;&#12391;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12399;UTF-8&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
      </p></dd><dt><span class="term"><code class="option">--blockadd</code> <em class="parameter"><code>level</code></em></span></dt><dd><p>
       &#12371;&#12398;&#12524;&#12505;&#12523;&#12414;&#12391;&#12398;BlockAddition&#12434;&#20445;&#25345;&#12375;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#20840;&#12390;&#20445;&#25345;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;WAVPACK4&#12394;&#12393;&#12398;&#29305;&#23450;&#12398;&#12467;&#12540;&#12487;&#12483;&#12463;&#12395;&#12398;&#12415;&#26377;&#21177;&#12391;&#12377;&#12290;
      </p></dd><dt><span class="term"><code class="option">--cuesheet</code></span></dt><dd><p>
       <span class="citerefentry"><span class="refentrytitle">mkvextract</span>(1)</span>&#12395;&#12289;&#30452;&#24460;&#12398;&#12488;&#12521;&#12483;&#12463;&#12398;&#12481;&#12515;&#12503;&#12479;&#24773;&#22577;&#12392;&#12479;&#12464;&#12487;&#12540;&#12479;&#12363;&#12425;<abbr class="abbrev">CUE</abbr>&#12471;&#12540;&#12488;&#12434;&#29983;&#25104;&#12375;&#12414;&#12377;&#12290;&#20986;&#21147;&#12501;&#12449;&#12452;&#12523;&#12398;&#21517;&#21069;&#12399;&#12488;&#12521;&#12483;&#12463;&#12398;&#20986;&#21147;&#21517;&#12395;'<code class="literal">.cue</code>'&#12434;&#12388;&#12369;&#12383;&#12418;&#12398;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
      </p></dd><dt><span class="term"><code class="option">--raw</code></span></dt><dd><p>
       &#12467;&#12531;&#12486;&#12490;&#24773;&#22577;&#12434;&#21547;&#12414;&#12394;&#12356;&#12289;raw&#12487;&#12540;&#12479;&#12434;&#12501;&#12449;&#12452;&#12523;&#12395;&#25277;&#20986;&#12375;&#12414;&#12377;&#12290;<a class="link" href="#mkvextract.description.tracks.fullraw"><code class="option">--fullraw</code></a>&#12501;&#12521;&#12464;&#12392;&#12399;&#36949;&#12356;&#12289;&#12371;&#12398;&#12501;&#12521;&#12464;&#12399;<code class="classname">CodecPrivate</code>&#35201;&#32032;&#12398;&#20869;&#23481;&#12399;&#12501;&#12449;&#12452;&#12523;&#12395;&#26360;&#12365;&#20986;&#12375;&#12414;&#12379;&#12435;&#12290;&#12371;&#12398;&#12514;&#12540;&#12489;&#12399;&#12289;<span class="citerefentry"><span class="refentrytitle">mkvextract</span>(1)</span>&#12364;&#12469;&#12509;&#12540;&#12488;&#12375;&#12394;&#12356;&#12418;&#12398;&#12418;&#21547;&#12417;&#12390;&#20840;&#12390;&#12398;<code class="classname">CodecID</code>&#12391;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12364;&#12289;&#20986;&#21147;&#12373;&#12428;&#12383;&#12501;&#12449;&#12452;&#12523;&#12399;&#20351;&#29992;&#12391;&#12365;&#12394;&#12356;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
      </p></dd><dt><a name="mkvextract.description.tracks.fullraw"></a><span class="term"><code class="option">--fullraw</code></span></dt><dd><p>
       &#12467;&#12531;&#12486;&#12490;&#24773;&#22577;&#12434;&#21547;&#12414;&#12394;&#12356;&#12289;raw&#12487;&#12540;&#12479;&#12434;&#12501;&#12449;&#12452;&#12523;&#12395;&#25277;&#20986;&#12375;&#12414;&#12377;&#12290;&#12488;&#12521;&#12483;&#12463;&#12364;<code class="classname">CodecPrivate</code>&#35201;&#32032;&#12398;&#12504;&#12483;&#12480;&#24773;&#22577;&#12434;&#21547;&#12416;&#22580;&#21512;&#12289;&#12381;&#12398;&#20869;&#23481;&#12399;&#12501;&#12449;&#12452;&#12523;&#12398;&#20808;&#38957;&#12395;&#26360;&#12365;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12514;&#12540;&#12489;&#12399;&#12289;<span class="citerefentry"><span class="refentrytitle">mkvextract</span>(1)</span>&#12364;&#12469;&#12509;&#12540;&#12488;&#12375;&#12394;&#12356;<code class="classname">CodecID</code>&#12395;&#12418;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12364;&#12289;&#20986;&#21147;&#12373;&#12428;&#12383;&#12501;&#12449;&#12452;&#12523;&#12399;&#20351;&#29992;&#12391;&#12365;&#12394;&#12356;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
      </p></dd><dt><span class="term"><em class="parameter"><code>TID:outname</code></em></span></dt><dd><p>
       ID&#12364;<em class="parameter"><code>TID</code></em>&#12391;&#12354;&#12427;&#12488;&#12521;&#12483;&#12463;&#12364;&#12477;&#12540;&#12473;&#12501;&#12449;&#12452;&#12523;&#12395;&#23384;&#22312;&#12377;&#12428;&#12400;&#12289;<em class="parameter"><code>outname</code></em>&#12395;&#25277;&#20986;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#35079;&#25968;&#22238;&#25351;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;&#12488;&#12521;&#12483;&#12463;ID&#12399;&#12289;<span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12395;<code class="option">--identify</code>&#12434;&#25351;&#23450;&#12375;&#12390;&#23455;&#34892;&#12375;&#12383;&#38555;&#12398;&#20986;&#21147;&#12395;&#34920;&#31034;&#12373;&#12428;&#12427;&#12418;&#12398;&#12392;&#21516;&#12376;&#12391;&#12377;&#12290;
      </p><p>
       &#21508;&#20986;&#21147;&#12501;&#12449;&#12452;&#12523;&#21517;&#12399;&#19968;&#22238;&#12375;&#12363;&#20351;&#29992;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;RealAudio&#21450;&#12403;RealVideo&#12488;&#12521;&#12483;&#12463;&#12399;&#20363;&#22806;&#12391;&#12377;&#12290;&#12418;&#12375;&#12289;&#30064;&#12394;&#12427;&#12488;&#12521;&#12483;&#12463;&#12395;&#21516;&#12376;&#12501;&#12449;&#12452;&#12523;&#21517;&#12364;&#25351;&#23450;&#12373;&#12428;&#12383;&#22580;&#21512;&#12289;&#12381;&#12428;&#12425;&#12399;&#21516;&#19968;&#12398;&#12501;&#12449;&#12452;&#12523;&#12395;&#20445;&#23384;&#12373;&#12428;&#12414;&#12377;&#12290;&#20363;:
      </p><pre class="screen">
$ mkvextract tracks input.mkv 1:output-two-tracks.rm 2:output-two-tracks.rm
      </pre></dd></dl></div></div><div class="refsect2" title="&#12479;&#12464;&#25277;&#20986;&#12514;&#12540;&#12489;"><a name="mkvextract.description.tags"></a><h3>&#12479;&#12464;&#25277;&#20986;&#12514;&#12540;&#12489;</h3><p>
    &#26360;&#24335;: <span class="command"><strong>mkvextract</strong></span> <code class="option">tags</code>
<em class="parameter"><code>source-filename</code></em>
[<span class="optional"><em class="parameter"><code>options</code></em></span>]
   </p><p>
    &#25277;&#20986;&#12373;&#12428;&#12383;&#12479;&#12464;&#12399;&#12289;&#20986;&#21147;&#12364;&#12522;&#12480;&#12452;&#12524;&#12463;&#12488;&#12373;&#12428;&#12390;&#12356;&#12394;&#12428;&#12400;&#12467;&#12531;&#12477;&#12540;&#12523;&#12395;&#20986;&#21147;&#12373;&#12428;&#12414;&#12377;&#12290;(&#35443;&#32048;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;<a class="link" href="#mkvextract.output_redirection" title="&#20986;&#21147;&#12522;&#12480;&#12452;&#12524;&#12463;&#12488;">&#20986;&#21147;&#12522;&#12480;&#12452;&#12524;&#12463;&#12488;</a>&#12395;&#12388;&#12356;&#12390;&#12398;&#12475;&#12463;&#12471;&#12519;&#12531;&#12434;&#21442;&#29031;&#12367;&#12384;&#12373;&#12356;&#12290;)
   </p></div><div class="refsect2" title="&#28155;&#20184;&#12501;&#12449;&#12452;&#12523;&#25277;&#20986;&#12514;&#12540;&#12489;"><a name="mkvextract.description.attachments"></a><h3>&#28155;&#20184;&#12501;&#12449;&#12452;&#12523;&#25277;&#20986;&#12514;&#12540;&#12489;</h3><p>
    &#26360;&#24335;: <span class="command"><strong>mkvextract</strong></span> <code class="option">attachments</code>
<em class="parameter"><code>source-filename</code></em>
[<span class="optional"><em class="parameter"><code>options</code></em></span>]
<em class="parameter"><code>AID1:outname1</code></em>
[<span class="optional"><em class="parameter"><code>AID2:outname2</code></em> ...</span>]
   </p><div class="variablelist"><dl><dt><span class="term">AID:outname</span></dt><dd><p>
       ID&#12364;<em class="parameter"><code>AID</code></em>&#12391;&#12354;&#12427;&#28155;&#20184;&#12501;&#12449;&#12452;&#12523;&#12364;&#12418;&#12375;&#12477;&#12540;&#12473;&#12501;&#12449;&#12452;&#12523;&#12395;&#23384;&#22312;&#12377;&#12428;&#12400;&#25277;&#20986;&#12375;&#12414;&#12377;&#12290;<em class="parameter"><code>outname</code></em>&#12364;&#25351;&#23450;&#12373;&#12428;&#12394;&#12356;&#22580;&#21512;&#12289;<span class="productname">Matroska</span>&#8482;&#12395;&#26684;&#32013;&#12373;&#12428;&#12383;&#28155;&#20184;&#12501;&#12449;&#12452;&#12523;&#12398;&#21517;&#21069;&#12364;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#35079;&#25968;&#22238;&#25351;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;&#28155;&#20184;&#12501;&#12449;&#12452;&#12523;ID&#12399;&#12289;<span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12395;<code class="option">--identify</code>&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#25351;&#23450;&#12375;&#12383;&#12392;&#12365;&#12395;&#20986;&#21147;&#12373;&#12428;&#12427;&#12418;&#12398;&#12392;&#21516;&#12376;&#12391;&#12377;&#12290;
     </p></dd></dl></div></div><div class="refsect2" title="&#12481;&#12515;&#12503;&#12479;&#25277;&#20986;&#12514;&#12540;&#12489;"><a name="mkvextract.description.chapters"></a><h3>&#12481;&#12515;&#12503;&#12479;&#25277;&#20986;&#12514;&#12540;&#12489;</h3><p>
    &#26360;&#24335;: <span class="command"><strong>mkvextract</strong></span> <code class="option">chapters</code>
<em class="parameter"><code>source-filename</code></em>
[<span class="optional"><em class="parameter"><code>options</code></em></span>]
   </p><div class="variablelist"><dl><dt><span class="term"><code class="option">-s</code>, <code class="option">--simple</code></span></dt><dd><p>
       &#12481;&#12515;&#12503;&#12479;&#24773;&#22577;&#12434;<abbr class="abbrev">OGM</abbr> tools&#12391;&#20351;&#29992;&#12373;&#12428;&#12427;&#12289;&#12471;&#12531;&#12503;&#12523;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;(CHAPTER01=...,
CHAPTER01NAME=...)&#12391;&#20986;&#21147;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12514;&#12540;&#12489;&#12391;&#12399;&#12289;&#19968;&#37096;&#12398;&#24773;&#22577;&#12399;&#30772;&#26820;&#12373;&#12428;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;&#12481;&#12515;&#12503;&#12479;&#12399;<abbr class="abbrev">XML</abbr>&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12391;&#20986;&#21147;&#12373;&#12428;&#12414;&#12377;&#12290;
      </p></dd></dl></div><p>
    &#25277;&#20986;&#12373;&#12428;&#12383;&#12481;&#12515;&#12503;&#12479;&#12399;&#12289;&#20986;&#21147;&#12364;&#12522;&#12480;&#12452;&#12524;&#12463;&#12488;&#12373;&#12428;&#12390;&#12356;&#12394;&#12428;&#12400;&#12467;&#12531;&#12477;&#12540;&#12523;&#12395;&#20986;&#21147;&#12373;&#12428;&#12414;&#12377;&#12290;(&#35443;&#32048;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;<a class="link" href="#mkvextract.output_redirection" title="&#20986;&#21147;&#12522;&#12480;&#12452;&#12524;&#12463;&#12488;">&#20986;&#21147;&#12522;&#12480;&#12452;&#12524;&#12463;&#12488;</a>&#12395;&#12388;&#12356;&#12390;&#12398;&#12475;&#12463;&#12471;&#12519;&#12531;&#12434;&#21442;&#29031;&#12367;&#12384;&#12373;&#12356;&#12290;)
   </p></div><div class="refsect2" title="CUE&#12471;&#12540;&#12488;&#25277;&#20986;&#12514;&#12540;&#12489;"><a name="mkvextract.description.cuesheets"></a><h3>CUE&#12471;&#12540;&#12488;&#25277;&#20986;&#12514;&#12540;&#12489;</h3><p>
    &#26360;&#24335;: <span class="command"><strong>mkvextract</strong></span> <code class="option">cuesheet</code>
<em class="parameter"><code>source-filename</code></em>
[<span class="optional"><em class="parameter"><code>options</code></em></span>]
   </p><p>
    &#25277;&#20986;&#12373;&#12428;&#12383;CUE&#12471;&#12540;&#12488;&#12399;&#12289;&#20986;&#21147;&#12364;&#12522;&#12480;&#12452;&#12524;&#12463;&#12488;&#12373;&#12428;&#12390;&#12356;&#12394;&#12428;&#12400;&#12467;&#12531;&#12477;&#12540;&#12523;&#12395;&#20986;&#21147;&#12373;&#12428;&#12414;&#12377;&#12290;(&#35443;&#32048;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;<a class="link" href="#mkvextract.output_redirection" title="&#20986;&#21147;&#12522;&#12480;&#12452;&#12524;&#12463;&#12488;">&#20986;&#21147;&#12522;&#12480;&#12452;&#12524;&#12463;&#12488;</a>&#12395;&#12388;&#12356;&#12390;&#12398;&#12475;&#12463;&#12471;&#12519;&#12531;&#12434;&#21442;&#29031;&#12367;&#12384;&#12373;&#12356;&#12290;)
   </p></div><div class="refsect2" title="&#12479;&#12452;&#12512;&#12467;&#12540;&#12489;&#25277;&#20986;&#12514;&#12540;&#12489;"><a name="mkvextract.description.timecodes_v2"></a><h3>&#12479;&#12452;&#12512;&#12467;&#12540;&#12489;&#25277;&#20986;&#12514;&#12540;&#12489;</h3><p>
    &#26360;&#24335;: <span class="command"><strong>mkvextract</strong></span> <code class="option">timecodes_v2</code>
<em class="parameter"><code>source-filename</code></em>
[<span class="optional"><em class="parameter"><code>options</code></em></span>]
   </p><p>
    &#25277;&#20986;&#12373;&#12428;&#12383;&#12479;&#12452;&#12512;&#12467;&#12540;&#12489;&#12399;&#12289;&#20986;&#21147;&#12364;&#12522;&#12480;&#12452;&#12524;&#12463;&#12488;&#12373;&#12428;&#12390;&#12356;&#12394;&#12428;&#12400;&#12467;&#12531;&#12477;&#12540;&#12523;&#12395;&#20986;&#21147;&#12373;&#12428;&#12414;&#12377;&#12290;(&#35443;&#32048;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;<a class="link" href="#mkvextract.output_redirection" title="&#20986;&#21147;&#12522;&#12480;&#12452;&#12524;&#12463;&#12488;">&#20986;&#21147;&#12522;&#12480;&#12452;&#12524;&#12463;&#12488;</a>&#12395;&#12388;&#12356;&#12390;&#12398;&#12475;&#12463;&#12471;&#12519;&#12531;&#12434;&#21442;&#29031;&#12367;&#12384;&#12373;&#12356;&#12290;)
   </p></div></div><div class="refsect1" title="&#20986;&#21147;&#12522;&#12480;&#12452;&#12524;&#12463;&#12488;"><a name="mkvextract.output_redirection"></a><h2>&#20986;&#21147;&#12522;&#12480;&#12452;&#12524;&#12463;&#12488;</h2><p>
   &#12356;&#12367;&#12388;&#12363;&#12398;&#12514;&#12540;&#12489;&#12391;&#12399;&#12289;<span class="citerefentry"><span class="refentrytitle">mkvextract</span>(1)</span>&#12399;&#25277;&#20986;&#12373;&#12428;&#12383;&#12487;&#12540;&#12479;&#12434;&#12467;&#12531;&#12477;&#12540;&#12523;&#12395;&#20986;&#21147;&#12375;&#12414;&#12377;&#12290;&#19968;&#33324;&#30340;&#12395;&#12289;&#12371;&#12398;&#12487;&#12540;&#12479;&#12434;&#12501;&#12449;&#12452;&#12523;&#12395;&#26360;&#12365;&#20986;&#12377;&#12395;&#12399;&#20108;&#12388;&#12398;&#26041;&#27861;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#19968;&#12388;&#12399;&#12471;&#12455;&#12523;&#12395;&#12424;&#12387;&#12390;&#25552;&#20379;&#12373;&#12428;&#12289;&#12418;&#12358;&#19968;&#12388;&#12399;<span class="citerefentry"><span class="refentrytitle">mkvextract</span>(1)</span>&#33258;&#20307;&#12395;&#12424;&#12387;&#12390;&#25552;&#20379;&#12373;&#12428;&#12414;&#12377;&#12290;
  </p><p>
   &#12471;&#12455;&#12523;&#12499;&#12523;&#12488;&#12452;&#12531;&#12398;&#12522;&#12480;&#12452;&#12524;&#12463;&#12488;&#27231;&#27083;&#12399;&#12289;&#12467;&#12510;&#12531;&#12489;&#12521;&#12452;&#12531;&#12395;'<code class="literal">&gt;
output-filename.ext</code>'&#12434;&#36861;&#21152;&#12377;&#12427;&#12371;&#12392;&#12391;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;&#20363;:
  </p><pre class="screen">
$ mkvextract tags source.mkv &gt; tags.xml
  </pre><p>
   <span class="citerefentry"><span class="refentrytitle">mkvextract</span>(1)</span>&#33258;&#20307;&#12398;&#12522;&#12480;&#12452;&#12524;&#12463;&#12488;&#12399;&#12289;<a class="link" href="#mkvextract.description.common.redirect_output"><code class="option">--redirect-output</code></a>&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#25351;&#23450;&#12377;&#12427;&#12371;&#12392;&#12391;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;&#20363;:
   </p><pre class="screen">
$ mkvextract tags source.mkv --redirect-output tags.xml
  </pre><div class="note" title="&#27880;&#35352;" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">&#27880;&#35352;</h3><p>
    Windows&#12391;&#12399;&#12289;<a class="link" href="#mkvextract.description.common.redirect_output"><code class="option">--redirect-output</code></a>&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#20351;&#29992;&#12377;&#12427;&#12409;&#12365;&#12391;&#12375;&#12423;&#12358;&#12290;<span class="command"><strong>cmd.exe</strong></span>&#12399;&#12289;&#29305;&#27530;&#25991;&#23383;&#12434;&#20986;&#21147;&#12501;&#12449;&#12452;&#12523;&#12395;&#26360;&#12365;&#20986;&#12377;&#21069;&#12395;&#20966;&#29702;&#12375;&#12390;&#12375;&#12414;&#12356;&#12289;&#20986;&#21147;&#12364;&#22730;&#12428;&#12427;&#34398;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
   </p></div></div><div class="refsect1" title="&#20986;&#21147;&#12501;&#12449;&#12452;&#12523;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;"><a name="mkvextract.output_file_formats"></a><h2>&#20986;&#21147;&#12501;&#12449;&#12452;&#12523;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;</h2><p>
   &#20986;&#21147;&#12501;&#12449;&#12452;&#12523;&#12398;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12398;&#27770;&#23450;&#12399;&#12289;&#12488;&#12521;&#12483;&#12463;&#12398;&#31278;&#39006;&#12395;&#12424;&#12387;&#12390;&#27770;&#12414;&#12426;&#12289;&#20986;&#21147;&#12501;&#12449;&#12452;&#12523;&#21517;&#12398;&#25313;&#24373;&#23376;&#12399;&#20351;&#29992;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#29694;&#22312;&#12289;&#20197;&#19979;&#12398;&#31278;&#39006;&#12398;&#12488;&#12521;&#12483;&#12463;&#12364;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
  </p><div class="variablelist"><dl><dt><span class="term">V_MPEG4/ISO/AVC</span></dt><dd><p>
      <abbr class="abbrev">H.264</abbr>/<abbr class="abbrev">AVC</abbr>&#12499;&#12487;&#12458;&#12488;&#12521;&#12483;&#12463;&#12399;&#12289;<abbr class="abbrev">H.264</abbr>&#12456;&#12524;&#12513;&#12531;&#12479;&#12522;&#12539;&#12473;&#12488;&#12522;&#12540;&#12512;&#12395;&#26360;&#12365;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12428;&#12399;&#20363;&#12360;&#12400;<span class="productname">GPAC</span>&#8482;&#12497;&#12483;&#12465;&#12540;&#12472;&#12395;&#21547;&#12414;&#12428;&#12427;&#12289;<span class="productname">MP4Box</span>&#8482;&#12394;&#12393;&#12395;&#12424;&#12426;&#20966;&#29702;&#12391;&#12365;&#12414;&#12377;&#12290;
     </p></dd><dt><span class="term">V_MS/VFW/FOURCC</span></dt><dd><p>
      &#12371;&#12398;<code class="classname">CodecID</code>&#12434;&#12418;&#12388;&#12289;&#22266;&#23450;<abbr class="abbrev">FPS</abbr>&#12499;&#12487;&#12458;&#12488;&#12521;&#12483;&#12463;&#12399;<abbr class="abbrev">AVI</abbr>&#12501;&#12449;&#12452;&#12523;&#12395;&#26360;&#12365;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;
     </p></dd><dt><span class="term">V_REAL/*</span></dt><dd><p>
      <span class="productname">RealVideo</span>&#8482;&#12488;&#12521;&#12483;&#12463;&#12399;&#12289;<span class="productname">RealMedia</span>&#8482;&#12501;&#12449;&#12452;&#12523;&#12395;&#26360;&#12365;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;
     </p></dd><dt><span class="term">A_MPEG/L3, A_AC3</span></dt><dd><p>
      &#12371;&#12428;&#12425;&#12399;&#12289;&#29983;&#12398;<abbr class="abbrev">MP3</abbr>&#12501;&#12449;&#12452;&#12523;&#21450;&#12403;<abbr class="abbrev">AC3</abbr>&#12501;&#12449;&#12452;&#12523;&#12395;&#25277;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;
     </p></dd><dt><span class="term">A_PCM/INT/LIT</span></dt><dd><p>
      <abbr class="abbrev">PCM</abbr>Raw&#12487;&#12540;&#12479;&#12399;&#12289;<abbr class="abbrev">WAV</abbr>&#12501;&#12449;&#12452;&#12523;&#12395;&#26360;&#12365;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;
     </p></dd><dt><span class="term">A_AAC/MPEG2/*, A_AAC/MPEG4/*, A_AAC</span></dt><dd><p>
      &#20840;&#12390;&#12398;<abbr class="abbrev">AAC</abbr>&#12501;&#12449;&#12452;&#12523;&#12399;&#12289;<abbr class="abbrev">ADTS</abbr>&#12504;&#12483;&#12480;&#12434;&#21508;&#12497;&#12465;&#12483;&#12488;&#12398;&#21069;&#12395;&#36861;&#21152;&#12373;&#12428;&#12383;&#12358;&#12360;&#12391;<abbr class="abbrev">AAC</abbr>&#12501;&#12449;&#12452;&#12523;&#12395;&#26360;&#12365;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;<abbr class="abbrev">ADTS</abbr>&#12504;&#12483;&#12480;&#12399;&#12289;&#24259;&#27490;&#20104;&#23450;&#12391;&#12354;&#12427;&#12456;&#12531;&#12501;&#12449;&#12471;&#12473;&#12501;&#12451;&#12540;&#12523;&#12489;&#12434;&#21547;&#12415;&#12414;&#12379;&#12435;&#12290;
     </p></dd><dt><span class="term">A_VORBIS</span></dt><dd><p>
      Vorbis audio&#12399;<span class="productname">OggVorbis</span>&#8482;&#12501;&#12449;&#12452;&#12523;&#12395;&#26360;&#12365;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;
     </p></dd><dt><span class="term">A_REAL/*</span></dt><dd><p>
      <span class="productname">RealAudio</span>&#8482;&#12488;&#12521;&#12483;&#12463;&#12399;<span class="productname">RealMedia</span>&#8482;&#12501;&#12449;&#12452;&#12523;&#12395;&#26360;&#12365;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;
     </p></dd><dt><span class="term">A_TTA1</span></dt><dd><p>
      <span class="productname">TrueAudio</span>&#8482;&#12488;&#12521;&#12483;&#12463;&#12399;<abbr class="abbrev">TTA</abbr>&#12501;&#12449;&#12452;&#12523;&#12395;&#26360;&#12365;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;<span class="productname">Matroska</span>&#8482;&#12398;&#12479;&#12452;&#12512;&#12467;&#12540;&#12489;&#31934;&#24230;&#12398;&#19978;&#38480;&#12398;&#12383;&#12417;&#12289;&#25277;&#20986;&#12373;&#12428;&#12383;&#12501;&#12449;&#12452;&#12523;&#12398;&#12504;&#12483;&#12480;&#12399;&#12289;<code class="varname">data_length</code>&#12501;&#12451;&#12540;&#12523;&#12489;(&#12501;&#12449;&#12452;&#12523;&#12395;&#21547;&#12414;&#12428;&#12427;&#32207;&#12469;&#12531;&#12503;&#12523;&#25968;)&#12392;<abbr class="abbrev">CRC</abbr>&#12395;&#12388;&#12356;&#12390;&#12399;&#19981;&#27491;&#30906;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
     </p></dd><dt><span class="term">S_TEXT/UTF8</span></dt><dd><p>
      &#12471;&#12531;&#12503;&#12523;&#12539;&#12486;&#12461;&#12473;&#12488;&#23383;&#24149;&#12399;<abbr class="abbrev">SRT</abbr>&#12501;&#12449;&#12452;&#12523;&#12395;&#26360;&#12365;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;
     </p></dd><dt><span class="term">S_TEXT/SSA, S_TEXT/ASS</span></dt><dd><p>
      <abbr class="abbrev">SSA</abbr>&#21450;&#12403;<abbr class="abbrev">ASS</abbr>&#12486;&#12461;&#12473;&#12488;&#23383;&#24149;&#12399;&#12289;&#12381;&#12428;&#12382;&#12428;<abbr class="abbrev">SSA</abbr>&#12289;<abbr class="abbrev">ASS</abbr>&#12501;&#12449;&#12452;&#12523;&#12395;&#26360;&#12365;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;
     </p></dd><dt><span class="term">S_KATE</span></dt><dd><p>
      <span class="productname">Kate</span>&#8482;&#12473;&#12488;&#12522;&#12540;&#12512;&#12399;<span class="productname">Ogg</span>&#8482;&#12467;&#12531;&#12486;&#12490;&#12395;&#26684;&#32013;&#12373;&#12428;&#12414;&#12377;&#12290;
     </p></dd><dt><span class="term">&#12479;&#12464;</span></dt><dd><p>
      &#12479;&#12464;&#12399;&#12289;<abbr class="abbrev">XML</abbr>&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12395;&#22793;&#25563;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12399;<span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12391;&#12479;&#12464;&#12434;&#35501;&#12415;&#36796;&#12416;&#38555;&#12398;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12392;&#21516;&#12376;&#12391;&#12377;&#12290;
     </p></dd><dt><span class="term">&#28155;&#20184;&#12501;&#12449;&#12452;&#12523;</span></dt><dd><p>
      &#28155;&#20184;&#12501;&#12449;&#12452;&#12523;&#12399;&#12381;&#12398;&#12414;&#12414;&#12398;&#24418;&#24335;&#12391;&#20986;&#21147;&#12501;&#12449;&#12452;&#12523;&#12395;&#26360;&#12365;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#22793;&#25563;&#31561;&#12398;&#20966;&#29702;&#12399;&#20840;&#12367;&#34892;&#12431;&#12428;&#12414;&#12379;&#12435;&#12290;
     </p></dd><dt><span class="term">&#12481;&#12515;&#12503;&#12479;</span></dt><dd><p>
      &#12481;&#12515;&#12503;&#12479;&#12399;<abbr class="abbrev">XML</abbr>&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12395;&#22793;&#25563;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12399;<span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12364;&#12481;&#12515;&#12503;&#12479;&#12434;&#35501;&#12415;&#36796;&#12416;&#38555;&#12398;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12392;&#21516;&#12376;&#12391;&#12377;&#12290;&#20182;&#12395;&#12418;&#12289;&#31777;&#30053;&#21270;&#12373;&#12428;&#12383;<abbr class="abbrev">OGM</abbr>&#12473;&#12479;&#12452;&#12523;&#12398;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12391;&#20986;&#21147;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;
     </p></dd><dt><span class="term">&#12479;&#12452;&#12512;&#12467;&#12540;&#12489;</span></dt><dd><p>
      &#12479;&#12452;&#12512;&#12467;&#12540;&#12489;&#12399;&#12414;&#12378;&#25972;&#21015;&#12373;&#12428;&#12383;&#24460;&#12395;&#12289;<span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12391;&#35501;&#12415;&#36796;&#12416;&#12371;&#12392;&#12398;&#12391;&#12365;&#12427; timecode v2
&#24418;&#24335;&#12395;&#28310;&#25312;&#12377;&#12427;&#12501;&#12449;&#12452;&#12523;&#12395;&#26360;&#12365;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#20182;&#12398;&#24418;&#24335;(v1, v3, v4)&#12408;&#12398;&#25277;&#20986;&#12399;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;
     </p></dd></dl></div></div><div class="refsect1" title="&#36820;&#12426;&#20516;"><a name="id352179"></a><h2>&#36820;&#12426;&#20516;</h2><p>
   <span class="citerefentry"><span class="refentrytitle">mkvextract</span>(1)</span>&#12399;&#19979;&#12398;3&#12388;&#12398;&#36820;&#12426;&#20516;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;
  </p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p>
     <code class="constant">0</code> -- &#12371;&#12398;&#36820;&#12426;&#20516;&#12399;&#25277;&#20986;&#12364;&#25104;&#21151;&#12375;&#12383;&#12371;&#12392;&#12434;&#24847;&#21619;&#12375;&#12414;&#12377;&#12290;
    </p></li><li class="listitem"><p>
     <code class="constant">1</code> -- &#12371;&#12398;&#36820;&#12426;&#20516;&#12399;&#12289;&#19968;&#12388;&#20197;&#19978;&#12398;&#35686;&#21578;&#12364;&#20986;&#21147;&#12373;&#12428;&#12414;&#12375;&#12383;&#12364;&#12289;&#25277;&#20986;&#12364;&#32154;&#34892;&#12373;&#12428;&#12383;&#12371;&#12392;&#12434;&#24847;&#21619;&#12375;&#12414;&#12377;&#12290;&#35686;&#21578;&#12399;
'<code class="literal">&#35686;&#21578;:</code>'
&#12392;&#12356;&#12358;&#25991;&#23383;&#21015;&#12434;&#20808;&#38957;&#12395;&#12388;&#12369;&#12390;&#20986;&#21147;&#12373;&#12428;&#12414;&#12377;&#12290;&#20986;&#21147;&#12501;&#12449;&#12452;&#12523;&#12364;&#28961;&#20107;&#12391;&#12354;&#12427;&#12363;&#12393;&#12358;&#12363;&#12399;&#12289;&#22580;&#21512;&#12395;&#12424;&#12426;&#12414;&#12377;&#12290;&#20986;&#21147;&#12501;&#12449;&#12452;&#12523;&#12434;&#30906;&#35469;&#12377;&#12427;&#12371;&#12392;&#12434;&#24375;&#12367;&#25512;&#22888;&#12375;&#12414;&#12377;&#12290;
    </p></li><li class="listitem"><p>
     <code class="constant">2</code> --
&#12371;&#12398;&#36820;&#12426;&#20516;&#12399;&#12289;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12289;&#12456;&#12521;&#12540;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#20986;&#21147;&#12375;&#12383;&#24460;&#12395;<span class="citerefentry"><span class="refentrytitle">mkvextract</span>(1)</span>&#12364;&#20966;&#29702;&#12434;&#20013;&#26029;&#12375;&#12383;&#12371;&#12392;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;&#12456;&#12521;&#12540;&#12513;&#12483;&#12475;&#12540;&#12472;&#12399;&#19981;&#27491;&#12394;&#12467;&#12510;&#12531;&#12489;&#12521;&#12452;&#12531;&#12420;&#12501;&#12449;&#12452;&#12523;I/O&#12456;&#12521;&#12540;&#12289;&#22730;&#12428;&#12383;&#12501;&#12449;&#12452;&#12523;&#12394;&#12393;&#27096;&#12293;&#12391;&#12377;&#12290;
    </p></li></ul></div></div><div class="refsect1" title="&#38306;&#36899;&#38917;&#30446;"><a name="mkvextract.seealso"></a><h2>&#38306;&#36899;&#38917;&#30446;</h2><p>
   <span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>, <span class="citerefentry"><span class="refentrytitle">mkvinfo</span>(1)</span>, <span class="citerefentry"><span class="refentrytitle">mkvpropedit</span>(1)</span>, <span class="citerefentry"><span class="refentrytitle">mmg</span>(1)</span>
  </p></div><div class="refsect1" title="&#12454;&#12455;&#12502;"><a name="mkvextract.www"></a><h2>&#12454;&#12455;&#12502;</h2><p>
   &#26368;&#26032;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12399;&#12289;&#24120;&#26178;<a class="ulink" href="http://www.bunkus.org/videotools/mkvtoolnix/" target="_top">MKVToolNix&#12398;&#12507;&#12540;&#12512;&#12506;&#12540;&#12472;</a>&#12363;&#12425;&#21462;&#24471;&#12391;&#12365;&#12414;&#12377;&#12290;
  </p></div></div></body></html>
