<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>mkvinfo</title><meta name="generator" content="DocBook XSL Stylesheets V1.75.2"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div lang="ja" class="refentry" title="mkvinfo"><a name="mkvinfo"></a><div class="titlepage"></div><div class="refnamediv"><h2>&#21517;&#21069;</h2><p>mkvinfo &#8212; <span class="productname">Matroska</span>&#8482;&#12501;&#12449;&#12452;&#12523;&#12398;&#35201;&#32032;&#12395;&#12388;&#12356;&#12390;&#12398;&#24773;&#22577;&#12434;&#34920;&#31034;&#12375;&#12414;&#12377;&#12290;</p></div><div class="refsynopsisdiv" title="&#26360;&#24335;"><a name="mkvinfo.synopsis"></a><h2>&#26360;&#24335;</h2><div class="cmdsynopsis"><p><code class="command">mkvinfo</code>  [options] {source-filename}</p></div></div><div class="refsect1" title="&#35500;&#26126;"><a name="mkvinfo.description"></a><h2>&#35500;&#26126;</h2><p>
   &#12371;&#12398;&#12503;&#12525;&#12464;&#12521;&#12512;&#12399;&#12289;<span class="productname">Matroska</span>&#8482;
&#12501;&#12449;&#12452;&#12523;&#12395;&#26684;&#32013;&#12373;&#12428;&#12390;&#12356;&#12427;&#20840;&#12390;&#12398;&#35201;&#32032;&#12398;&#19968;&#35239;&#12434;&#34920;&#31034;&#12375;&#12414;&#12377;&#12290;&#20986;&#21147;&#12399;&#12289;&#20351;&#29992;&#12373;&#12428;&#12390;&#12356;&#12427;&#12467;&#12540;&#12487;&#12483;&#12463;&#12434;&#21547;&#12416;&#12289;&#12488;&#12521;&#12483;&#12463;&#12398;&#12522;&#12473;&#12488;&#12398;&#12415;&#12395;&#21046;&#38480;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;
  </p><div class="variablelist"><dl><dt><span class="term"><code class="option">-g</code>, <code class="option">--gui</code></span></dt><dd><p>
      <abbr class="abbrev">GUI</abbr>&#12434;&#36215;&#21205;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;mkvinfo&#12364;<abbr class="abbrev">GUI</abbr>&#12434;&#12469;&#12509;&#12540;&#12488;&#12377;&#12427;&#12424;&#12358;&#12395;&#12467;&#12531;&#12497;&#12452;&#12523;&#12373;&#12428;&#12390;&#12356;&#12394;&#12369;&#12428;&#12400;&#28961;&#21177;&#12391;&#12377;&#12290;
     </p></dd><dt><span class="term"><code class="option">-c</code>, <code class="option">--checksums</code></span></dt><dd><p>
      &#12501;&#12524;&#12540;&#12512;&#12372;&#12392;&#12395;<code class="function">Adler32</code>&#12481;&#12455;&#12483;&#12463;&#12469;&#12512;&#12434;&#35336;&#31639;&#12375;&#12289;&#34920;&#31034;&#12375;&#12414;&#12377;&#12290;&#12487;&#12496;&#12483;&#12464;&#12398;&#12383;&#12417;&#12395;&#12398;&#12415;&#26377;&#29992;&#12391;&#12377;&#12290;
     </p></dd><dt><span class="term"><code class="option">-s</code>, <code class="option">--summary</code></span></dt><dd><p>
      &#20840;&#12390;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12395;&#12388;&#12356;&#12390;&#34920;&#31034;&#12377;&#12427;&#12398;&#12391;&#12399;&#12394;&#12367;&#12289;<span class="citerefentry"><span class="refentrytitle">mkvinfo</span>(1)</span>&#12398;&#35211;&#12388;&#12369;&#12383;&#12418;&#12398;&#12398;&#31777;&#28500;&#12394;&#12469;&#12510;&#12522;&#12434;&#34920;&#31034;&#12375;&#12414;&#12377;&#12290;
     </p></dd><dt><span class="term"><code class="option">-x</code>, <code class="option">--hexdump</code></span></dt><dd><p>
      &#21508;&#12501;&#12524;&#12540;&#12512;&#12398;&#26368;&#21021;&#12398;16&#12496;&#12452;&#12488;&#12434;16&#36914;&#25968;&#12398;&#12480;&#12531;&#12503;&#12392;&#12375;&#12390;&#34920;&#31034;&#12375;&#12414;&#12377;&#12290;
     </p></dd><dt><span class="term"><code class="option">-X</code>, <code class="option">--full-hexdump</code></span></dt><dd><p>
      &#21508;&#12501;&#12524;&#12540;&#12512;&#12398;&#20840;&#12390;&#12398;&#12496;&#12452;&#12488;&#12434;16&#36914;&#25968;&#12398;&#12480;&#12531;&#12503;&#12392;&#12375;&#12390;&#34920;&#31034;&#12375;&#12414;&#12377;&#12290;
     </p></dd><dt><span class="term"><code class="option">-z</code>, <code class="option">--size</code></span></dt><dd><p>
      &#12504;&#12483;&#12480;&#12418;&#21547;&#12417;&#12383;&#21508;&#35201;&#32032;&#12398;&#12469;&#12452;&#12474;&#12434;&#34920;&#31034;&#12375;&#12414;&#12377;&#12290;
     </p></dd><dt><a name="mkvinfo.description.command_line_charset"></a><span class="term"><code class="option">--command-line-charset</code> <em class="parameter"><code>character-set</code></em></span></dt><dd><p>
      &#12467;&#12510;&#12531;&#12489;&#12521;&#12452;&#12531;&#25991;&#23383;&#21015;&#12398;&#25991;&#23383;&#12467;&#12540;&#12489;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12399;&#12289;&#12471;&#12473;&#12486;&#12512;&#12398;&#29694;&#22312;&#12398;&#12525;&#12465;&#12540;&#12523;&#12398;&#25991;&#23383;&#12467;&#12540;&#12489;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
     </p></dd><dt><a name="mkvinfo.description.output_charset"></a><span class="term"><code class="option">--output-charset</code> <em class="parameter"><code>character-set</code></em></span></dt><dd><p>
      &#20986;&#21147;&#12377;&#12427;&#25991;&#23383;&#12467;&#12540;&#12489;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12399;&#12289;&#12471;&#12473;&#12486;&#12512;&#12398;&#29694;&#22312;&#12398;&#12525;&#12465;&#12540;&#12523;&#12398;&#25991;&#23383;&#12467;&#12540;&#12489;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
     </p></dd><dt><a name="mkvinfo.description.redirect_output"></a><span class="term"><code class="option">-r</code>, <code class="option">--redirect-output</code>
<em class="parameter"><code>file-name</code></em></span></dt><dd><p>
      &#20840;&#12390;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#12467;&#12531;&#12477;&#12540;&#12523;&#12391;&#12399;&#12394;&#12367;<em class="parameter"><code>file-name</code></em>&#12391;&#25351;&#23450;&#12375;&#12383;&#12501;&#12449;&#12452;&#12523;&#12395;&#26360;&#12365;&#20986;&#12375;&#12414;&#12377;&#12290;&#20986;&#21147;&#12522;&#12480;&#12452;&#12524;&#12463;&#12488;&#12395;&#12424;&#12387;&#12390;&#12418;&#21516;&#12376;&#12371;&#12392;&#12364;&#31777;&#21336;&#12395;&#12391;&#12365;&#12414;&#12377;&#12364;&#12289;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#24517;&#35201;&#12394;&#22580;&#21512;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;&#12479;&#12540;&#12511;&#12490;&#12523;&#12364;&#12501;&#12449;&#12452;&#12523;&#12395;&#26360;&#12365;&#36796;&#12416;&#21069;&#12395;&#20986;&#21147;&#12434;&#20966;&#29702;&#12375;&#12390;&#12375;&#12414;&#12358;&#22580;&#21512;&#12394;&#12393;&#12391;&#12377;&#12290;<a class="link" href="#mkvinfo.description.output_charset"><code class="option">--output-charset</code></a>&#12395;&#12424;&#12387;&#12390;&#25351;&#23450;&#12373;&#12428;&#12383;&#25991;&#23383;&#12467;&#12540;&#12489;&#12399;&#23562;&#37325;&#12373;&#12428;&#12414;&#12377;&#12290;
     </p></dd><dt><a name="mkvinfo.description.ui_language"></a><span class="term"><code class="option">--ui-language</code> <em class="parameter"><code>code</code></em></span></dt><dd><p>
      &#25351;&#23450;&#12375;&#12383;<em class="parameter"><code>code</code></em>&#12434;&#24375;&#21046;&#30340;&#12395;&#35328;&#35486;&#12467;&#12540;&#12489;(&#20363;:
&#26085;&#26412;&#35486;&#12394;&#12425;&#12400;'<code class="literal">ja_JP</code>')&#12392;&#12375;&#12390;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;&#12375;&#12363;&#12375;&#12289;&#29872;&#22659;&#22793;&#25968;<code class="varname">LANG</code>&#12420;<code class="varname">LC_MESSAGES</code>&#12289;<code class="varname">LC_ALL</code>&#12434;&#20351;&#29992;&#12375;&#12383;&#12411;&#12358;&#12364;&#22909;&#12414;&#12375;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;<em class="parameter"><code>code</code></em>&#12395;<code class="literal">list</code>&#12392;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;&#25351;&#23450;&#12391;&#12365;&#12427;&#35328;&#35486;&#12467;&#12540;&#12489;&#12398;&#19968;&#35239;&#12434;&#20986;&#21147;&#12375;&#12414;&#12377;&#12290;
     </p></dd><dt><a name="mkvinfo.description.verbose"></a><span class="term"><code class="option">-v</code>, <code class="option">--verbose</code></span></dt><dd><p>
      &#20887;&#38263;&#12514;&#12540;&#12489;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;<a class="link" href="#mkvinfo.verbosity_levels" title="&#20887;&#38263;&#12524;&#12505;&#12523;">&#20887;&#38263;&#12524;&#12505;&#12523;</a>&#12475;&#12463;&#12471;&#12519;&#12531;&#12395;&#12289;&#12393;&#12398;&#20887;&#38263;&#12524;&#12505;&#12523;&#12391;&#12393;&#12398;&#24773;&#22577;&#12364;&#20986;&#21147;&#12373;&#12428;&#12427;&#12363;&#12398;&#35500;&#26126;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
     </p></dd><dt><span class="term"><code class="option">-h</code>, <code class="option">--help</code></span></dt><dd><p>
      &#12467;&#12510;&#12531;&#12489;&#26360;&#24335;&#24773;&#22577;&#12434;&#20986;&#21147;&#12375;&#12390;&#32066;&#20102;&#12375;&#12414;&#12377;&#12290;
     </p></dd><dt><span class="term"><code class="option">-V</code>, <code class="option">--version</code></span></dt><dd><p>
      &#12496;&#12540;&#12472;&#12519;&#12531;&#24773;&#22577;&#12434;&#20986;&#21147;&#12375;&#12390;&#32066;&#20102;&#12375;&#12414;&#12377;&#12290;
     </p></dd><dt><span class="term"><code class="option">@</code>options-file</span></dt><dd><p>
      <em class="parameter"><code>options-file</code></em>&#12391;&#25351;&#23450;&#12373;&#12428;&#12383;&#12501;&#12449;&#12452;&#12523;&#12363;&#12425;&#36861;&#21152;&#12398;&#12467;&#12510;&#12531;&#12489;&#12521;&#12452;&#12531;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#35501;&#12415;&#36796;&#12415;&#12414;&#12377;&#12290;&#34892;&#12391;&#26368;&#21021;&#12398;&#31354;&#30333;&#25991;&#23383;&#12391;&#12394;&#12356;&#25991;&#23383;&#12364;&#12495;&#12483;&#12471;&#12517;&#12510;&#12540;&#12463;('<code class="literal">#</code>')&#12391;&#12354;&#12427;&#34892;&#12399;&#12467;&#12513;&#12531;&#12488;&#12392;&#12375;&#12390;&#25201;&#12431;&#12428;&#12289;&#28961;&#35222;&#12373;&#12428;&#12414;&#12377;&#12290;&#34892;&#38957;&#12289;&#21450;&#12403;&#34892;&#26411;&#12398;&#31354;&#30333;&#25991;&#23383;&#12399;&#21462;&#12426;&#38500;&#12363;&#12428;&#12414;&#12377;&#12290;&#21508;&#34892;&#12395;&#12399;&#19968;&#12388;&#12378;&#12388;&#12375;&#12363;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#25351;&#23450;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#12513;&#12479;&#12461;&#12515;&#12521;&#12463;&#12479;&#12398;&#12456;&#12473;&#12465;&#12540;&#12503;&#12399;&#24517;&#35201;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
     </p><p>
      '<span class="command"><strong>mkvinfo -v -v input.mkv --redirect-output
info.txt</strong></span>&#12392;&#12356;&#12358;&#12467;&#12510;&#12531;&#12489;&#12521;&#12452;&#12531;&#12392;&#21516;&#12376;&#12371;&#12392;&#12399;&#12289;&#27425;&#12398;&#12424;&#12358;&#12394;&#12458;&#12503;&#12471;&#12519;&#12531;&#12501;&#12449;&#12452;&#12523;&#12391;&#25351;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;
     </p><pre class="programlisting">
# &#20887;&#38263;&#12514;&#12540;&#12489;
-v
-v
# input.mkv&#12434;&#35299;&#26512;&#12377;&#12427;
input.mkv
# info.txt&#12395;&#20986;&#21147;&#12434;&#26360;&#12365;&#36796;&#12416;
--redirect-output
info.txt
     </pre></dd></dl></div></div><div class="refsect1" title="&#20887;&#38263;&#12524;&#12505;&#12523;"><a name="mkvinfo.verbosity_levels"></a><h2>&#20887;&#38263;&#12524;&#12505;&#12523;</h2><p>
   <a class="link" href="#mkvinfo.description.verbose"><code class="option">-v</code></a>&#12458;&#12503;&#12471;&#12519;&#12531;&#12395;&#12424;&#12426;&#12289;<span class="citerefentry"><span class="refentrytitle">mkvinfo</span>(1)</span>&#12398;&#20887;&#38263;&#12524;&#12505;&#12523;&#12434;&#19978;&#12370;&#12289;&#20837;&#21147;&#12501;&#12449;&#12452;&#12523;&#12395;&#12388;&#12356;&#12390;&#12398;&#12424;&#12426;&#35443;&#12375;&#12356;&#24773;&#22577;&#12434;&#20986;&#21147;&#12373;&#12379;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
  </p><p>
   &#12524;&#12505;&#12523;0&#12391;&#12399;&#12289;&#12488;&#12521;&#12483;&#12463;&#12504;&#12483;&#12480;&#12392;&#12488;&#12521;&#12483;&#12463;&#12398;&#31278;&#39006;&#12398;&#12415;&#12434;&#20986;&#21147;&#12375;&#12414;&#12377;&#12290;<span class="citerefentry"><span class="refentrytitle">mkvinfo</span>(1)</span>&#12399;&#12289;&#12504;&#12483;&#12480;&#12434;&#23436;&#20840;&#12395;&#35299;&#26512;&#12375;&#32066;&#12427;&#12392;&#12377;&#12368;&#12395;(&#12424;&#12426;&#25216;&#34899;&#30340;&#12395;&#12399;&#12289;&#26368;&#21021;&#12398;&#12463;&#12521;&#12473;&#12479;&#12434;&#26908;&#20986;&#12375;&#12383;&#30452;&#24460;&#12395;)&#32066;&#20102;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12524;&#12505;&#12523;&#12391;&#12399;&#12289;&#12471;&#12540;&#12463;&#12504;&#12483;&#12489;&#12456;&#12531;&#12488;&#12522;&#21450;&#12403;CUE&#12364;&#12488;&#12521;&#12483;&#12463;&#24773;&#22577;&#12398;&#21069;&#12395;&#26684;&#32013;&#12373;&#12428;&#12390;&#12356;&#12383;&#12392;&#12375;&#12390;&#12418;&#34920;&#31034;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;
  </p><p>
   &#12524;&#12505;&#12523;1&#12391;&#12399;&#12289;&#12501;&#12449;&#12452;&#12523;&#20840;&#20307;&#12395;&#12354;&#12427;&#12471;&#12540;&#12463;&#12504;&#12483;&#12489;&#12456;&#12531;&#12488;&#12522;&#12392;CUE&#20197;&#22806;&#12398;<span class="productname">Matroska</span>&#8482;&#12456;&#12524;&#12513;&#12531;&#12488;&#12434;&#34920;&#31034;&#12375;&#12414;&#12377;&#12290;&#12418;&#12375;&#12289;&#12469;&#12510;&#12522;&#12514;&#12540;&#12489;&#12364;&#26377;&#21177;&#12398;&#22580;&#21512;&#12289;&#12501;&#12524;&#12540;&#12512;&#20301;&#32622;&#12418;&#20986;&#21147;&#12375;&#12414;&#12377;&#12290;
  </p><p>
   &#12524;&#12505;&#12523;2&#12391;&#12399;&#12289;&#12471;&#12540;&#12463;&#12504;&#12483;&#12489;&#12456;&#12531;&#12488;&#12522;&#12289;CUE&#12289;&#21450;&#12403;&#21508;<span class="productname">Matroska</span>&#8482;&#12456;&#12524;&#12513;&#12531;&#12488;&#12398;&#12501;&#12449;&#12452;&#12523;&#20869;&#20301;&#32622;&#12418;&#34920;&#31034;&#12375;&#12414;&#12377;&#12290;
  </p><p>
   &#12524;&#12505;&#12523;3&#20197;&#19978;&#12391;&#12399;&#12289;<span class="productname">Matroska</span>&#8482;&#12456;&#12524;&#12513;&#12531;&#12488;&#12395;&#30452;&#25509;&#38306;&#20418;&#12394;&#12356;&#24773;&#22577;&#12418;&#34920;&#31034;&#12375;&#12414;&#12377;&#12290;&#20182;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;&#35211;&#20184;&#12363;&#12387;&#12383;&#12418;&#12398;&#12384;&#12369;&#12434;&#34920;&#31034;&#12375;&#12414;&#12377;&#12290;&#12524;&#12505;&#12523;3&#12399;&#12487;&#12496;&#12483;&#12464;&#29992;&#12395;&#12513;&#12479;&#24773;&#22577;&#12434;&#36861;&#21152;&#12375;&#12414;&#12377;(&#38283;&#30330;&#32773;&#21521;&#12369;)&#12290;&#12524;&#12505;&#12523;3&#12391;&#36861;&#21152;&#12373;&#12428;&#12383;&#34892;&#12399;&#12289;&#20840;&#12390;&#35282;&#25324;&#24359;&#12391;&#22258;&#12431;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
  </p></div><div class="refsect1" title="&#36820;&#12426;&#20516;"><a name="id467570"></a><h2>&#36820;&#12426;&#20516;</h2><p>
   <span class="citerefentry"><span class="refentrytitle">mkvinfo</span>(1)</span>&#12399;&#19979;&#12398;3&#12388;&#12398;&#36820;&#12426;&#20516;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;
  </p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p>
     <code class="constant">0</code> -- &#12371;&#12398;&#36820;&#12426;&#20516;&#12399;&#27491;&#24120;&#12395;&#32066;&#20102;&#12375;&#12383;&#12371;&#12392;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;
    </p></li><li class="listitem"><p>
     <code class="constant">1</code> -- &#12371;&#12398;&#36820;&#12426;&#20516;&#12399;&#12289;&#23569;&#12394;&#12367;&#12392;&#12418;&#19968;&#12388;&#12398;&#35686;&#21578;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12375;&#12383;&#12364;&#12289;&#20966;&#29702;&#12364;&#32154;&#34892;&#12373;&#12428;&#12383;&#12371;&#12392;&#12434;&#24847;&#21619;&#12375;&#12414;&#12377;&#12290;&#35686;&#21578;&#12399;
'<code class="literal">&#35686;&#21578;:</code>' &#12392;&#12356;&#12358;&#25991;&#23383;&#21015;&#12434;&#20808;&#38957;&#12395;&#12388;&#12369;&#12390;&#20986;&#21147;&#12373;&#12428;&#12414;&#12377;&#12290;
    </p></li><li class="listitem"><p>
     &#12371;&#12398;&#36820;&#12426;&#20516;&#12399;&#12289;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12289;&#12456;&#12521;&#12540;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#34920;&#31034;&#12375;&#12383;&#30452;&#24460;&#12395;<span class="citerefentry"><span class="refentrytitle">mkvinfo</span>(1)</span>&#12364;&#32066;&#20102;&#12375;&#12383;&#12371;&#12392;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;&#12456;&#12521;&#12540;&#12513;&#12483;&#12475;&#12540;&#12472;&#12399;&#19981;&#27491;&#12394;&#12467;&#12510;&#12531;&#12489;&#12521;&#12452;&#12531;&#12420;&#12501;&#12449;&#12452;&#12523;I/O&#12456;&#12521;&#12540;&#12289;&#22730;&#12428;&#12383;&#12501;&#12449;&#12452;&#12523;&#12394;&#12393;&#27096;&#12293;&#12391;&#12377;&#12290;
    </p></li></ul></div></div><div class="refsect1" title="&#38306;&#36899;&#38917;&#30446;"><a name="mkvinfo.seealso"></a><h2>&#38306;&#36899;&#38917;&#30446;</h2><p>
   <span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>, <span class="citerefentry"><span class="refentrytitle">mkvextract</span>(1)</span>, <span class="citerefentry"><span class="refentrytitle">mkvpropedit</span>(1)</span>, <span class="citerefentry"><span class="refentrytitle">mmg</span>(1)</span>
  </p></div><div class="refsect1" title="&#12454;&#12455;&#12502;"><a name="mkvinfo.www"></a><h2>&#12454;&#12455;&#12502;</h2><p>
   &#26368;&#26032;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12399;&#12289;&#24120;&#26178;<a class="ulink" href="http://www.bunkus.org/videotools/mkvtoolnix/" target="_top">MKVToolNix&#12398;&#12507;&#12540;&#12512;&#12506;&#12540;&#12472;</a>&#12363;&#12425;&#21462;&#24471;&#12391;&#12365;&#12414;&#12377;&#12290;
  </p></div></div></body></html>
