<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>mkvmerge</title><meta name="generator" content="DocBook XSL Stylesheets V1.75.2"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div lang="ja" class="refentry" title="mkvmerge"><a name="mkvmerge"></a><div class="titlepage"></div><div class="refnamediv"><h2>&#21517;&#21069;</h2><p>mkvmerge &#8212; &#12510;&#12523;&#12481;&#12513;&#12487;&#12451;&#12450;&#12473;&#12488;&#12522;&#12540;&#12512;&#12434;<span class="productname">Matroska</span>&#8482;&#12501;&#12449;&#12452;&#12523;&#12395;&#26684;&#32013;&#12375;&#12414;&#12377;&#12290;</p></div><div class="refsynopsisdiv" title="&#26360;&#24335;"><a name="mkvmerge.synopsis"></a><h2>&#26360;&#24335;</h2><div class="cmdsynopsis"><p><code class="command">mkvmerge</code>  [global options] {-o
out} [options1] {file1} [
[options2]  {file2} ] [@optionsfile]</p></div></div><div class="refsect1" title="&#35500;&#26126;"><a name="mkvmerge.description"></a><h2>&#35500;&#26126;</h2><p>
   &#12371;&#12398;&#12503;&#12525;&#12464;&#12521;&#12512;&#12399;&#12356;&#12367;&#12388;&#12363;&#12398;&#12513;&#12487;&#12451;&#12450;&#12501;&#12449;&#12452;&#12523;&#12434;&#20837;&#21147;&#12392;&#12375;&#12289;&#12381;&#12428;&#12425;&#12395;&#26684;&#32013;&#12373;&#12428;&#12383;&#12473;&#12488;&#12522;&#12540;&#12512;&#12398;&#12358;&#12385;&#20840;&#12390;&#12289;&#12418;&#12375;&#12367;&#12399;&#36984;&#25246;&#12373;&#12428;&#12383;&#12418;&#12398;&#12434;<span class="productname">Matroska</span>&#8482;&#12501;&#12449;&#12452;&#12523;&#12395;&#26360;&#12365;&#36796;&#12415;&#12414;&#12377;&#12290;<a class="ulink" href="http://www.matroska.org/" target="_top"><span class="productname">Matroska</span>&#8482;</a>&#12398;&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12418;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </p><p>
   &#12464;&#12525;&#12540;&#12496;&#12523;&#12458;&#12503;&#12471;&#12519;&#12531;:
  </p><div class="variablelist"><dl><dt><span class="term"><code class="option">-v</code>, <code class="option">--verbose</code></span></dt><dd><p>&#12424;&#12426;&#35443;&#32048;&#12394;&#24773;&#22577;&#12434;&#34920;&#31034;&#12375;&#12414;&#12377;</p></dd><dt><span class="term"><code class="option">-q</code>, <code class="option">--quiet</code></span></dt><dd><p>&#12473;&#12486;&#12540;&#12479;&#12473;&#24773;&#22577;&#12398;&#20986;&#21147;&#12434;&#25233;&#21046;&#12375;&#12414;&#12377;&#12290;</p></dd><dt><span class="term"><code class="option">-o</code>, <code class="option">--output</code>
<em class="parameter"><code>file-name</code></em></span></dt><dd><p><em class="parameter"><code>file-name</code></em>&#12391;&#25351;&#23450;&#12375;&#12383;&#12501;&#12449;&#12452;&#12523;&#12395;&#26360;&#12365;&#36796;&#12415;&#12414;&#12377;&#12290;&#12418;&#12375;&#12289;&#12501;&#12449;&#12452;&#12523;&#20998;&#21106;&#12364;&#26377;&#21177;&#12394;&#22580;&#21512;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#33509;&#24178;&#35299;&#37320;&#12364;&#36949;&#12356;&#12414;&#12377;&#12290;&#35443;&#32048;&#12399;<a class="link" href="#mkvmerge.description.split"><code class="option">--split</code></a>&#12458;&#12503;&#12471;&#12519;&#12531;&#12398;&#35500;&#26126;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p></dd><dt><span class="term"><code class="option">-w</code>, <code class="option">--webm</code></span></dt><dd><p>WebM&#12398;&#35215;&#26684;&#12395;&#28310;&#25312;&#12375;&#12383;&#12501;&#12449;&#12452;&#12523;&#12434;&#20316;&#25104;&#12375;&#12414;&#12377;&#12290;mkvmerge&#12399;&#20986;&#21147;&#12501;&#12449;&#12452;&#12523;&#21517;&#12398;&#25313;&#24373;&#23376;&#12364;"webm"&#12391;&#12354;&#12387;&#12383;&#22580;&#21512;&#12395;&#12418;&#12371;&#12428;&#12434;&#12458;&#12531;&#12395;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12514;&#12540;&#12489;&#12391;&#12399;&#12356;&#12367;&#12388;&#12363;&#12398;&#21046;&#38480;&#12364;&#23455;&#26045;&#12373;&#12428;&#12414;&#12377;&#12290;&#20351;&#29992;&#12391;&#12365;&#12427;&#12467;&#12540;&#12487;&#12483;&#12463;&#12399;VP8&#12499;&#12487;&#12458;&#12392;Vorbis&#12458;&#12540;&#12487;&#12451;&#12458;&#12398;&#12488;&#12521;&#12483;&#12463;&#12398;&#12415;&#12391;&#12377;&#12290;&#12481;&#12515;&#12503;&#12479;&#12392;&#12479;&#12464;&#12399;&#20351;&#29992;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;DocType&#12504;&#12483;&#12480;&#12450;&#12452;&#12486;&#12512;&#12399;"webm"&#12408;&#12392;&#22793;&#26356;&#12373;&#12428;&#12414;&#12377;&#12290;
     </p></dd><dt><a name="mkvmerge.description.title"></a><span class="term"><code class="option">--title</code> <em class="parameter"><code>title</code></em></span></dt><dd><p>&#20986;&#21147;&#12501;&#12449;&#12452;&#12523;&#20840;&#20307;&#12398;&#12479;&#12452;&#12488;&#12523;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;(&#20363;:&#26144;&#30011;&#12398;&#12479;&#12452;&#12488;&#12523;&#12394;&#12393;)&#12290;</p></dd><dt><a name="mkvmerge.description.tags"></a><span class="term"><code class="option">--tags</code> <em class="parameter"><code>file-name</code></em></span></dt><dd><p><em class="parameter"><code>file-name</code></em>&#12391;&#25351;&#23450;&#12375;&#12383;<abbr class="abbrev">XML</abbr>&#12501;&#12449;&#12452;&#12523;&#12363;&#12425;&#12464;&#12525;&#12540;&#12496;&#12523;&#12479;&#12464;&#12434;&#35501;&#12415;&#36796;&#12415;&#12414;&#12377;&#12290;&#35443;&#32048;&#12399;&#12479;&#12464;&#12395;&#12388;&#12356;&#12390;&#12398;&#12475;&#12463;&#12471;&#12519;&#12531;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p></dd><dt><span class="term"><code class="option">--default-language</code> <em class="parameter"><code>language-code</code></em></span></dt><dd><p>&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#35328;&#35486;&#12467;&#12540;&#12489;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;<a class="link" href="#mkvmerge.description.language"><code class="option">--language</code></a>&#12458;&#12503;&#12471;&#12519;&#12531;&#12391;&#25351;&#23450;&#12375;&#12394;&#12363;&#12387;&#12383;&#12488;&#12521;&#12483;&#12463;&#12399;&#12377;&#12409;&#12390;&#12371;&#12371;&#12391;&#25351;&#23450;&#12375;&#12383;&#35328;&#35486;&#12467;&#12540;&#12489;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12399;'<code class="literal">und</code>'&#12289;&#12388;&#12414;&#12426;'&#26410;&#23450;&#32681;'&#12391;&#12377;&#12290;</p></dd></dl></div><p>
   &#12475;&#12464;&#12513;&#12531;&#12488;&#24773;&#22577;&#12398;&#25201;&#12356;: (&#12464;&#12525;&#12540;&#12496;&#12523;&#12458;&#12503;&#12471;&#12519;&#12531;)
  </p><div class="variablelist"><dl><dt><span class="term"><code class="option">--segmentinfo</code> <em class="parameter"><code>filename.xml</code></em></span></dt><dd><p>
      <abbr class="abbrev">XML</abbr>&#12501;&#12449;&#12452;&#12523;&#12363;&#12425;&#12475;&#12464;&#12513;&#12531;&#12488;&#24773;&#22577;&#12434;&#35501;&#12415;&#21462;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#12501;&#12449;&#12452;&#12523;&#12399;&#12289;&#12475;&#12464;&#12513;&#12531;&#12488;&#12501;&#12449;&#12511;&#12522;<abbr class="abbrev">UID</abbr>&#12289;&#12475;&#12464;&#12513;&#12531;&#12488;<abbr class="abbrev">UID</abbr>&#12289;&#21069;&#12289;&#21450;&#12403;&#12289;&#24460;&#12475;&#12464;&#12513;&#12531;&#12488;<abbr class="abbrev">UID</abbr>&#12456;&#12524;&#12513;&#12531;&#12488;&#12434;&#21547;&#12416;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;MKVToolNix&#12399;&#12289;&#12469;&#12531;&#12503;&#12523;&#12501;&#12449;&#12452;&#12523;&#12392;<abbr class="abbrev">DTD</abbr>&#12434;&#21547;&#12435;&#12391;&#37197;&#24067;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
     </p></dd><dt><span class="term"><code class="option">--segment-uid</code> <em class="parameter"><code>SID1,SID2,...</code></em></span></dt><dd><p>
      &#20351;&#29992;&#12377;&#12427;&#12475;&#12464;&#12513;&#12531;&#12488;UID&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;&#12371;&#12428;&#12399;&#12467;&#12531;&#12510;&#12391;&#21306;&#20999;&#12425;&#12428;&#12383;&#12289;&#36890;&#24120;&#12398;UID&#24418;&#24335;("0x"&#12434;&#21069;&#32622;&#12377;&#12427;&#12289;&#12414;&#12383;&#12399;&#12375;&#12394;&#12356;&#12289;&#31354;&#30333;&#12434;&#21547;&#12416;&#12289;&#12414;&#12383;&#12399;&#21547;&#12414;&#12394;&#12356;&#12289;&#12385;&#12423;&#12358;&#12393;32&#26689;&#12398;16&#36914;&#25968;)128&#12499;&#12483;&#12488;&#12475;&#12464;&#12513;&#12531;&#12488;UID&#12398;&#12522;&#12473;&#12488;&#12391;&#12377;&#12290;
     </p><p>
      &#20316;&#25104;&#12373;&#12428;&#12427;&#21508;&#12501;&#12449;&#12452;&#12523;&#12399;&#19968;&#12388;&#12398;&#12475;&#12464;&#12513;&#12531;&#12488;&#12434;&#21547;&#12415;&#12289;&#12381;&#12375;&#12390;&#21508;&#12475;&#12464;&#12513;&#12531;&#12488;&#12399;&#19968;&#12388;&#12398;&#12475;&#12464;&#12513;&#12531;&#12488;UID&#12434;&#25345;&#12385;&#12414;&#12377;&#12290;&#12418;&#12375;&#12289;&#20316;&#25104;&#12373;&#12428;&#12383;&#12475;&#12464;&#12513;&#12531;&#12488;&#12424;&#12426;&#12418;&#22810;&#25968;&#12398;&#12475;&#12464;&#12513;&#12531;&#12488;UID&#12364;&#25351;&#23450;&#12373;&#12428;&#12383;&#22580;&#21512;&#12289;&#20313;&#12387;&#12383;&#12475;&#12464;&#12513;&#12531;&#12488;UID&#12399;&#28961;&#35222;&#12373;&#12428;&#12414;&#12377;&#12290;&#12414;&#12383;&#12289;&#12418;&#12375;&#25351;&#23450;&#12373;&#12428;&#12383;&#12475;&#12464;&#12513;&#12531;&#12488;UID&#12424;&#12426;&#12418;&#22810;&#25968;&#12398;&#12475;&#12464;&#12513;&#12531;&#12488;&#12364;&#20316;&#25104;&#12373;&#12428;&#12383;&#22580;&#21512;&#12399;&#12289;&#12521;&#12531;&#12480;&#12512;&#12394;UID&#12364;&#20316;&#25104;&#12373;&#12428;&#12390;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;
     </p></dd></dl></div><p>
   &#12481;&#12515;&#12503;&#12479;&#21450;&#12403;&#12479;&#12464;&#12398;&#25201;&#12356;: (&#12464;&#12525;&#12540;&#12496;&#12523;&#12458;&#12503;&#12471;&#12519;&#12531;)
  </p><div class="variablelist"><dl><dt><span class="term"><code class="option">--chapter-language</code> <em class="parameter"><code>language-code</code></em></span></dt><dd><p>
      &#21508;&#12481;&#12515;&#12503;&#12479;&#12398;&#12456;&#12531;&#12488;&#12522;&#12395;&#26360;&#12365;&#36796;&#12416;ISO639-2&#35328;&#35486;&#12467;&#12540;&#12489;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12399;'<code class="literal">eng</code>'&#12391;&#12377;&#12290;&#35443;&#32048;&#12399;<a class="link" href="#mkvmerge.chapters" title="&#12481;&#12515;&#12503;&#12479;">&#12481;&#12515;&#12503;&#12479;</a>&#12398;&#12475;&#12463;&#12471;&#12519;&#12531;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
     </p><p>
      &#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12471;&#12531;&#12503;&#12523;&#12481;&#12515;&#12503;&#12479;&#12501;&#12449;&#12452;&#12523;&#12434;&#35501;&#12415;&#36796;&#12435;&#12384;&#22580;&#21512;&#12289;&#12381;&#12375;&#12390;&#12477;&#12540;&#12473;&#12501;&#12449;&#12452;&#12523;&#12364;&#12481;&#12515;&#12503;&#12479;&#12434;&#21547;&#12416;&#12364;&#12481;&#12515;&#12503;&#12479;&#12398;&#35328;&#35486;&#24773;&#22577;&#12434;&#21547;&#12414;&#12394;&#12363;&#12387;&#12383;&#22580;&#21512;(&#20363;:MP4,OGM&#12501;&#12449;&#12452;&#12523;)&#12395;&#36969;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;
     </p></dd><dt><a name="mkvmerge.description.chapter_charset"></a><span class="term"><code class="option">--chapter-charset</code> <em class="parameter"><code>character-set</code></em></span></dt><dd><p>
      &#12471;&#12531;&#12503;&#12523;&#12481;&#12515;&#12503;&#12479;&#12501;&#12449;&#12452;&#12523;&#12434;UTF-8&#12395;&#22793;&#25563;&#12377;&#12427;&#38555;&#12398;&#25991;&#23383;&#12467;&#12540;&#12489;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;<span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12398;&#25991;&#23383;&#12467;&#12540;&#12489;&#22793;&#25563;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;<a class="link" href="#mkvmerge.text_files_and_charsets" title="&#12486;&#12461;&#12473;&#12488;&#12501;&#12449;&#12452;&#12523;&#12392;&#25991;&#23383;&#12467;&#12540;&#12489;&#22793;&#25563;">&#12486;&#12461;&#12473;&#12488;&#12501;&#12449;&#12452;&#12523;&#12392;&#25991;&#23383;&#12467;&#12540;&#12489;</a>&#12398;&#12475;&#12463;&#12471;&#12519;&#12531;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
     </p><p>
      &#12371;&#12398;&#12473;&#12452;&#12483;&#12481;&#12399;&#12481;&#12515;&#12503;&#12479;&#12364;Ogg,OGM&#12501;&#12449;&#12452;&#12523;&#12394;&#12393;&#12398;&#12467;&#12531;&#12486;&#12490;&#12363;&#12425;&#12467;&#12500;&#12540;&#12373;&#12428;&#12427;&#38555;&#12395;&#12418;&#36969;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#35443;&#32048;&#12395;&#12388;&#12356;&#12390;&#12399;&#24460;&#36848;&#12398;&#12481;&#12515;&#12503;&#12479;&#12395;&#12388;&#12356;&#12390;&#12398;&#12475;&#12463;&#12471;&#12519;&#12531;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
     </p></dd><dt><span class="term"><code class="option">--cue-chapter-name-format</code> <em class="parameter"><code>format</code></em></span></dt><dd><p>
      <span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12399;&#38899;&#22768;&#12501;&#12449;&#12452;&#12523;&#21521;&#12369;&#12398;<abbr class="abbrev">CUE</abbr>&#12471;&#12540;&#12488;&#12363;&#12425;&#12481;&#12515;&#12503;&#12479;&#24773;&#22577;&#12434;&#35501;&#12415;&#36796;&#12416;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;<abbr class="abbrev">CUE</abbr>&#12471;&#12540;&#12488;&#12395;&#12399;&#36890;&#24120;<code class="varname">PERFORMER</code>&#12456;&#12531;&#12488;&#12522;&#21450;&#12403;<code class="varname">TITLE</code>&#12456;&#12531;&#12488;&#12522;&#12364;&#21508;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12456;&#12531;&#12488;&#12522;&#12395;&#23384;&#22312;&#12375;&#12414;&#12377;&#12290;<span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12399;&#12371;&#12428;&#12425;&#20108;&#12388;&#12398;&#25991;&#23383;&#21015;&#12434;&#12481;&#12515;&#12503;&#12479;&#12398;&#21517;&#21069;&#12434;&#29983;&#25104;&#12377;&#12427;&#12398;&#12395;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12434;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12391;&#25351;&#23450;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
     </p><p>
      &#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;'<code class="code">%p - %t</code>'&#12392;&#12356;&#12358;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12364;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;
     </p><p>
      &#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12364;&#25351;&#23450;&#12373;&#12428;&#12383;&#22580;&#21512;&#12289;&#19979;&#12398;&#12513;&#12479;&#25991;&#23383;&#20197;&#22806;&#12399;&#12381;&#12398;&#12414;&#12414;&#12467;&#12500;&#12540;&#12373;&#12428;&#12289;&#12513;&#12479;&#25991;&#23383;&#12399;&#20197;&#19979;&#12398;&#12424;&#12358;&#12395;&#32622;&#25563;&#12373;&#12428;&#12414;&#12377;&#12290;
     </p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p><em class="parameter"><code>%p</code></em>&#12399;&#12381;&#12398;&#12456;&#12531;&#12488;&#12522;&#12398;<code class="varname">PERFORMER</code>&#25991;&#23383;&#21015;&#12391;&#32622;&#25563;&#12373;&#12428;&#12414;&#12377;&#12290;</p></li><li class="listitem"><p><em class="parameter"><code>%t</code></em>&#12399;&#12381;&#12398;&#12456;&#12531;&#12488;&#12522;&#12398;<code class="varname">TITLE</code>&#25991;&#23383;&#21015;&#12391;&#32622;&#25563;&#12373;&#12428;&#12414;&#12377;&#12290;</p></li><li class="listitem"><p><em class="parameter"><code>%n</code></em>&#12399;&#12381;&#12398;&#12456;&#12531;&#12488;&#12522;&#12398;&#12488;&#12521;&#12483;&#12463;&#30058;&#21495;&#12391;&#32622;&#25563;&#12373;&#12428;&#12414;&#12377;&#12290;</p></li><li class="listitem"><p><em class="parameter"><code>%N</code></em>&#12399;&#12289;&#12381;&#12398;&#12456;&#12531;&#12488;&#12522;&#12398;&#12488;&#12521;&#12483;&#12463;&#30058;&#21495;&#12364;10&#26410;&#28288;&#12398;&#22580;&#21512;0&#12434;&#21069;&#32622;&#12375;&#12390;&#20108;&#26689;&#12395;&#12375;&#12383;&#25968;&#23383;&#12391;&#32622;&#25563;&#12373;&#12428;&#12414;&#12377;&#12290;</p></li></ul></div></dd><dt><span class="term"><code class="option">--chapters</code> <em class="parameter"><code>file-name</code></em></span></dt><dd><p>
      &#12481;&#12515;&#12503;&#12479;&#24773;&#22577;&#12434;<em class="parameter"><code>file-name</code></em>&#12391;&#25351;&#23450;&#12375;&#12383;&#12501;&#12449;&#12452;&#12523;&#12363;&#12425;&#35501;&#12415;&#36796;&#12415;&#12414;&#12377;&#12290;&#35443;&#32048;&#12399;<a class="link" href="#mkvmerge.chapters" title="&#12481;&#12515;&#12503;&#12479;">&#12481;&#12515;&#12503;&#12479;</a>&#12398;&#12475;&#12463;&#12471;&#12519;&#12531;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
     </p></dd><dt><a name="mkvmerge.description.global_tags"></a><span class="term"><code class="option">--global-tags</code> <em class="parameter"><code>file-name</code></em></span></dt><dd><p>
      <em class="parameter"><code>file-name</code></em>&#12391;&#25351;&#23450;&#12375;&#12383;&#12501;&#12449;&#12452;&#12523;&#12363;&#12425;&#12464;&#12525;&#12540;&#12496;&#12523;&#12479;&#12464;&#12434;&#35501;&#12415;&#36796;&#12415;&#12414;&#12377;&#12290;&#35443;&#32048;&#12399;<a class="link" href="#mkvmerge.tags" title="&#12479;&#12464;">&#12479;&#12464;</a>&#12398;&#12475;&#12463;&#12471;&#12519;&#12531;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
     </p></dd></dl></div><p>
   &#20986;&#21147;&#19968;&#33324;&#12398;&#12467;&#12531;&#12488;&#12525;&#12540;&#12523;&#65288;&#12464;&#12525;&#12540;&#12496;&#12523;&#12458;&#12503;&#12471;&#12519;&#12531;&#12398;&#32154;&#12365;&#65289;:
  </p><div class="variablelist"><dl><dt><span class="term"><code class="option">--track-order</code>
<em class="parameter"><code>FID1:TID1,FID2:TID2,...</code></em></span></dt><dd><p>
      &#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#20837;&#21147;&#12373;&#12428;&#12383;&#12488;&#12521;&#12483;&#12463;&#12364;&#37197;&#32622;&#12373;&#12428;&#12427;&#38918;&#24207;&#12434;&#22793;&#26356;&#12375;&#12414;&#12377;&#12290;&#12458;&#12503;&#12471;&#12519;&#12531;&#24341;&#25968;&#12399;&#12467;&#12531;&#12510;&#12391;&#21306;&#20999;&#12425;&#12428;&#12427;ID&#12506;&#12450;&#12398;&#12522;&#12473;&#12488;&#12391;&#12377;&#12290;&#21508;&#12506;&#12450;&#12399;&#26368;&#21021;&#12434;0&#12392;&#12375;&#12390;&#12467;&#12510;&#12531;&#12489;&#12521;&#12452;&#12531;&#12398;&#20309;&#30058;&#30446;&#12395;&#25351;&#23450;&#12375;&#12383;&#12501;&#12449;&#12452;&#12523;&#12391;&#12354;&#12427;&#12363;&#12434;&#31034;&#12377;&#12501;&#12449;&#12452;&#12523;ID(<em class="parameter"><code>FID1</code></em>)&#12392;&#12289;&#12381;&#12398;&#12501;&#12449;&#12452;&#12523;&#12398;&#20013;&#12398;&#20309;&#30058;&#30446;&#12398;&#12488;&#12521;&#12483;&#12463;&#12363;&#12434;&#31034;&#12377;&#12488;&#12521;&#12483;&#12463;ID(<em class="parameter"><code>TID1</code></em>)&#12363;&#12425;&#12394;&#12426;&#12414;&#12377;&#12290;&#12371;&#12371;&#12391;&#25351;&#23450;&#12373;&#12428;&#12394;&#12363;&#12387;&#12383;&#12488;&#12521;&#12483;&#12463;&#12399;&#12289;&#25351;&#23450;&#12373;&#12428;&#12383;&#12488;&#12521;&#12483;&#12463;&#12398;&#24460;&#12395;&#37197;&#32622;&#12373;&#12428;&#12414;&#12377;&#12290;
     </p></dd><dt><span class="term"><code class="option">--cluster-length</code> <em class="parameter"><code>spec</code></em></span></dt><dd><p>
      &#12463;&#12521;&#12473;&#12479;&#12372;&#12392;&#12398;&#12289;&#12487;&#12540;&#12479;&#12502;&#12525;&#12483;&#12463;&#20491;&#25968;&#12398;&#19978;&#38480;&#12414;&#12383;&#12399;&#25345;&#32154;&#26178;&#38291;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;<em class="parameter"><code>spec</code></em>&#12497;&#12521;&#12513;&#12540;&#12479;&#12395;&#12399;&#21336;&#20301;&#12394;&#12375;&#12398;&#25968;&#23383;<em class="parameter"><code>n</code></em>&#12418;&#12375;&#12367;&#12399;&#12289;'<code class="literal">ms</code>'&#12434;&#24460;&#12429;&#12395;&#20184;&#12369;&#12383;&#25968;&#23383;<em class="parameter"><code>d</code></em>&#12434;&#25351;&#23450;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
     </p><p>
      &#21336;&#20301;&#12364;&#25351;&#23450;&#12373;&#12428;&#12394;&#12363;&#12387;&#12383;&#22580;&#21512;&#12289;&#12463;&#12521;&#12473;&#12479;&#12372;&#12392;&#12398;&#12487;&#12540;&#12479;&#12502;&#12525;&#12483;&#12463;&#12398;&#26368;&#22823;&#20491;&#25968;&#12399;<em class="parameter"><code>n</code></em>&#12395;&#35373;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;&#19978;&#38480;&#12399;65535&#12391;&#12377;&#12290;
     </p><p>
      &#25968;&#23383;<em class="parameter"><code>d</code></em>&#12395;'<code class="literal">ms</code>'&#12364;&#24460;&#32622;&#12373;&#12428;&#12390;&#12356;&#12383;&#22580;&#21512;&#12289;<span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12399;&#21508;&#12487;&#12540;&#12479;&#12463;&#12521;&#12473;&#12479;&#27598;&#12395;&#26368;&#22823;&#12391;&#12418;<em class="parameter"><code>d</code></em>&#12511;&#12522;&#31186;&#20998;&#12398;&#12487;&#12540;&#12479;&#12375;&#12363;&#26684;&#32013;&#12375;&#12414;&#12379;&#12435;&#12290;<em class="parameter"><code>d</code></em>&#12398;&#26368;&#23567;&#20516;&#12399;'<code class="literal">100ms</code>'&#12289;&#26368;&#22823;&#20516;&#12399;'<code class="literal">32000ms</code>'&#12391;&#12377;&#12290;
     </p><p>
      &#12487;&#12501;&#12457;&#12523;&#12488;&#12399;&#12289;&#12487;&#12540;&#12479;&#12463;&#12521;&#12473;&#12479;&#27598;&#12395;65535&#12487;&#12540;&#12479;&#12502;&#12525;&#12483;&#12463;&#20197;&#19979;&#12289;5000ms&#20197;&#19979;&#12398;&#12487;&#12540;&#12479;&#12434;&#26360;&#12365;&#36796;&#12415;&#12414;&#12377;&#12290;
     </p><p>
      &#12503;&#12525;&#12464;&#12521;&#12512;&#12364;&#12354;&#12427;&#12501;&#12524;&#12540;&#12512;&#12434;&#35211;&#12388;&#12369;&#12424;&#12358;&#12392;&#12377;&#12427;&#12392;&#12365;&#12399;&#12289;&#12463;&#12521;&#12473;&#12479;&#12395;&#30452;&#25509;&#12471;&#12540;&#12463;&#12375;&#12390;&#12289;&#12381;&#12398;&#24460;&#12463;&#12521;&#12473;&#12479;&#20840;&#20307;&#12434;&#35501;&#12415;&#36796;&#12415;&#12414;&#12377;&#12290;&#12424;&#12387;&#12390;&#12289;&#12424;&#12426;&#22823;&#12365;&#12394;&#12463;&#12521;&#12473;&#12479;&#12434;&#20316;&#12427;&#12392;&#12289;&#12471;&#12540;&#12463;&#12364;&#19981;&#27491;&#30906;&#12363;&#12388;&#36933;&#12367;&#12394;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
     </p></dd><dt><a name="mkvmerge.description.no_cues"></a><span class="term"><code class="option">--no-cues</code></span></dt><dd><p>
      &#12461;&#12517;&#12540;&#12487;&#12540;&#12479;(AVI&#12501;&#12449;&#12452;&#12523;&#12395;&#12362;&#12369;&#12427;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12398;&#12424;&#12358;&#12394;&#12418;&#12398;)&#12434;&#20316;&#25104;&#12375;&#12414;&#12379;&#12435;&#12290;&#12461;&#12517;&#12540;&#12487;&#12540;&#12479;&#12394;&#12375;&#12391;&#12418;&#12501;&#12449;&#12452;&#12523;&#12399;&#20877;&#29983;&#12391;&#12365;&#12414;&#12377;&#12364;&#12289;&#12471;&#12540;&#12463;&#12399;&#19981;&#27491;&#30906;&#12363;&#12388;&#36933;&#12367;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#23569;&#12375;&#12391;&#12418;&#12501;&#12449;&#12452;&#12523;&#12469;&#12452;&#12474;&#12434;&#23567;&#12373;&#12367;&#12375;&#12424;&#12358;&#12392;&#24517;&#27515;&#12394;&#12392;&#12365;&#12289;&#12414;&#12383;&#12399;&#12486;&#12473;&#12488;&#30446;&#30340;&#20197;&#22806;&#12395;&#12399;&#20351;&#29992;&#12375;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290;<a class="link" href="#mkvmerge.description.cues"><code class="option">--cues</code></a>&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#21508;&#20837;&#21147;&#12501;&#12449;&#12452;&#12523;&#12372;&#12392;&#12395;&#25351;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;
     </p></dd><dt><span class="term"><code class="option">--clusters-in-meta-seek</code></span></dt><dd><p>
      &#12501;&#12449;&#12452;&#12523;&#12398;&#32066;&#31471;&#12395;&#20840;&#12390;&#12398;&#12463;&#12521;&#12473;&#12479;&#12434;&#21547;&#12416;&#12513;&#12479;&#12471;&#12540;&#12463;&#35201;&#32032;&#12434;&#20316;&#25104;&#12375;&#12414;&#12377;&#12290;<a class="link" href="#mkvmerge.file_layout" title="Matroska&#8482;&#12501;&#12449;&#12452;&#12523;&#12398;&#12524;&#12452;&#12450;&#12454;&#12488;"><span class="productname">Matroska</span>&#8482;&#12501;&#12449;&#12452;&#12523;&#12524;&#12452;&#12450;&#12454;&#12488;</a>&#12398;&#12475;&#12463;&#12471;&#12519;&#12531;&#12418;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
     </p></dd><dt><span class="term"><code class="option">--disable-lacing</code></span></dt><dd><p>
      &#20840;&#12390;&#12398;&#12488;&#12521;&#12483;&#12463;&#12391;&#35079;&#25968;&#12398;&#12501;&#12524;&#12540;&#12512;&#12434;1&#12388;&#12398;&#12502;&#12525;&#12483;&#12463;&#12395;&#12414;&#12392;&#12417;&#12414;&#12379;&#12435;&#12290;&#12371;&#12428;&#12399;&#29305;&#12395;&#22810;&#25968;&#12398;&#12458;&#12540;&#12487;&#12451;&#12458;&#12488;&#12521;&#12483;&#12463;&#12364;&#12354;&#12427;&#22580;&#21512;&#12395;&#12289;&#12501;&#12449;&#12452;&#12523;&#12469;&#12452;&#12474;&#12434;&#22679;&#22823;&#12373;&#12379;&#12414;&#12377;&#12290;&#12486;&#12473;&#12488;&#30446;&#30340;&#12391;&#12398;&#12415;&#20351;&#29992;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
     </p></dd><dt><span class="term"><code class="option">--enable-durations</code></span></dt><dd><p>
      &#20840;&#12390;&#12398;&#12502;&#12525;&#12483;&#12463;&#12398;&#38263;&#12373;&#12434;&#35352;&#37682;&#12375;&#12414;&#12377;&#12290;&#12371;&#12428;&#12399;&#12501;&#12449;&#12452;&#12523;&#12469;&#12452;&#12474;&#12434;&#22679;&#22823;&#12373;&#12379;&#12414;&#12377;&#12364;&#12289;&#29694;&#22312;&#12398;&#12392;&#12371;&#12429;&#12503;&#12524;&#12540;&#12516;&#12395;&#12399;&#20309;&#12398;&#12513;&#12522;&#12483;&#12488;&#12418;&#12418;&#12383;&#12425;&#12375;&#12414;&#12379;&#12435;&#12290;
     </p></dd><dt><span class="term"><code class="option">--timecode-scale</code> <em class="parameter"><code>factor</code></em></span></dt><dd><p>
      &#12479;&#12452;&#12512;&#12467;&#12540;&#12489;&#12473;&#12465;&#12540;&#12523;&#12398;&#20418;&#25968;&#12434;<em class="parameter"><code>factor</code></em>&#12395;&#24375;&#21046;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#20516;&#12399;1000&#65374;10000000&#12289;&#12418;&#12375;&#12367;&#12399;-1&#12395;&#35373;&#23450;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
     </p><p>
      &#36890;&#24120;<span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12399;<code class="constant">1000000</code>&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;&#12371;&#12428;&#12399;&#12479;&#12452;&#12512;&#12467;&#12540;&#12489;&#12392;&#12501;&#12524;&#12540;&#12512;&#25345;&#32154;&#26399;&#38291;&#12364;1&#12511;&#12522;&#31186;&#21336;&#20301;&#12398;&#31934;&#24230;&#12434;&#25345;&#12388;&#12371;&#12392;&#12434;&#24847;&#21619;&#12375;&#12414;&#12377;&#12290;&#12499;&#12487;&#12458;&#12488;&#12521;&#12483;&#12463;&#12434;&#21547;&#12414;&#12378;&#12289;1&#12388;&#20197;&#19978;&#12398;&#12458;&#12540;&#12487;&#12451;&#12458;&#12488;&#12521;&#12483;&#12463;&#12434;&#21547;&#12416;&#12501;&#12449;&#12452;&#12523;&#12391;&#12399;&#12289;<span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12399;&#20840;&#12390;&#12398;&#12479;&#12452;&#12512;&#12467;&#12540;&#12489;&#12392;&#12501;&#12524;&#12540;&#12512;&#25345;&#32154;&#26178;&#38291;&#12364;&#12469;&#12531;&#12503;&#12522;&#12531;&#12464;&#38899;1&#12388;&#20998;&#12398;&#31934;&#24230;&#12434;&#25345;&#12388;&#12424;&#12358;&#12479;&#12452;&#12512;&#12467;&#12540;&#12489;&#12473;&#12465;&#12540;&#12523;&#12398;&#20418;&#25968;&#12434;&#33258;&#21205;&#30340;&#12395;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;&#12371;&#12428;&#12395;&#12424;&#12387;&#12390;&#12458;&#12540;&#12496;&#12540;&#12504;&#12483;&#12489;&#12399;&#22823;&#12365;&#12367;&#12394;&#12426;&#12414;&#12377;&#12364;&#12289;&#27491;&#30906;&#12394;&#12471;&#12540;&#12463;&#12392;&#23637;&#38283;&#12364;&#21487;&#33021;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
     </p><p>
      &#29305;&#27530;&#12394;&#20516;<code class="constant">-1</code>&#12364;&#25351;&#23450;&#12373;&#12428;&#12383;&#22580;&#21512;&#12289;&#12383;&#12392;&#12360;&#12499;&#12487;&#12458;&#12488;&#12521;&#12483;&#12463;&#12364;&#23384;&#22312;&#12375;&#12390;&#12356;&#12390;&#12418;&#12469;&#12531;&#12503;&#12522;&#12531;&#12464;&#38899;&#12398;&#31934;&#24230;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;
     </p></dd></dl></div><p>
   &#12501;&#12449;&#12452;&#12523;&#12398;&#20998;&#21106;&#12392;&#32016;&#20184;&#12369;(&#12464;&#12525;&#12540;&#12496;&#12523;&#12458;&#12503;&#12471;&#12519;&#12531;&#12398;&#32154;&#12365;):
  </p><div class="variablelist"><dl><dt><a name="mkvmerge.description.split"></a><span class="term"><code class="option">--split</code> <em class="parameter"><code>specification</code></em></span></dt><dd><p>
      &#20986;&#21147;&#12501;&#12449;&#12452;&#12523;&#12434;&#25351;&#23450;&#12375;&#12383;&#12469;&#12452;&#12474;&#12289;&#21448;&#12399;&#26178;&#38291;&#12391;&#20998;&#21106;&#12375;&#12414;&#12377;&#12290;&#12488;&#12521;&#12483;&#12463;&#12399;&#12461;&#12540;&#12501;&#12524;&#12540;&#12512;&#12398;&#30452;&#24460;&#12391;&#12375;&#12363;&#20998;&#21106;&#12391;&#12365;&#12394;&#12356;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;<span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12399;&#12496;&#12483;&#12501;&#12449;&#12522;&#12531;&#12464;&#12434;&#34892;&#12358;&#12383;&#12417;&#12289;&#12501;&#12449;&#12452;&#12523;&#12399;&#20998;&#21106;&#12377;&#12409;&#12365;&#28857;&#12398;&#27425;&#12395;&#12367;&#12427;&#12461;&#12540;&#12501;&#12524;&#12540;&#12512;&#12398;&#30452;&#21069;&#12391;&#20998;&#21106;&#12373;&#12428;&#12414;&#12377;&#12290;&#12424;&#12387;&#12390;&#12289;&#20998;&#21106;&#28857;&#12399;&#12518;&#12540;&#12470;&#12364;&#25351;&#23450;&#12375;&#12383;&#28857;&#12424;&#12426;&#12418;&#33509;&#24178;&#24460;&#12429;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
     </p><p>
      &#29694;&#26178;&#28857;&#12391;&#12399;&#12289;<span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12399;&#19977;&#12388;&#12398;&#12514;&#12540;&#12489;&#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
     </p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>
        &#25351;&#23450;&#12469;&#12452;&#12474;&#12391;&#20998;&#21106;&#12375;&#12414;&#12377;&#12290;
       </p><p>
        &#26360;&#24335;: <code class="option">--split</code>
[<span class="optional">size:</span>]<em class="parameter"><code>d</code></em>[<span class="optional">k|m|g</span>]
       </p><p>
        &#20363;: <code class="code">--split size:700m</code> or <code class="code">--split 150000000</code>
       </p><p>
        &#12497;&#12521;&#12513;&#12540;&#12479;<em class="parameter"><code>d</code></em>&#12398;&#24460;&#12429;&#12395;&#12399;'<code class="literal">k</code>'&#12539;'<code class="literal">m</code>'&#12539;'<code class="literal">g</code>'&#12434;&#20184;&#12369;&#12390;&#12289;&#21336;&#20301;&#12364;&#12381;&#12428;&#12382;&#12428;KB&#12539;MB&#12539;GB&#12391;&#12354;&#12427;&#12371;&#12392;&#12434;&#31034;&#12377;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#20184;&#12369;&#12394;&#12356;&#22580;&#21512;&#12399;&#12496;&#12452;&#12488;&#21336;&#20301;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#20986;&#21147;&#20013;&#12398;&#12501;&#12449;&#12452;&#12523;&#12364;&#12371;&#12398;&#19978;&#38480;&#12395;&#36948;&#12375;&#12383;&#12425;&#12289;&#27425;&#12398;&#26032;&#12375;&#12356;&#12501;&#12449;&#12452;&#12523;&#12408;&#12398;&#20986;&#21147;&#12364;&#38283;&#22987;&#12373;&#12428;&#12414;&#12377;&#12290;
       </p><p>
        '<code class="literal">size:</code>'&#12392;&#12356;&#12358;&#25509;&#38957;&#36766;&#12399;&#12289;&#20114;&#25563;&#24615;&#12398;&#12383;&#12417;&#12395;&#30465;&#30053;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
       </p></li><li class="listitem"><p>
        &#25351;&#23450;&#26178;&#38291;&#12391;&#20998;&#21106;&#12375;&#12414;&#12377;&#12290;
       </p><p>
        &#26360;&#24335;: <code class="option">--split</code>
[<span class="optional">duration:</span>]<em class="parameter"><code>HH:MM:SS.nnnnnnnnn</code></em>|<em class="parameter"><code>d</code></em>s
       </p><p>
        &#20363;: <code class="code">--split duration:00:60:00.000</code> or <code class="code">--split 3600s</code>
       </p><p>
        &#12497;&#12521;&#12513;&#12540;&#12479;&#12399;<em class="parameter"><code>HH:MM:SS.nnnnnnnnn</code></em>&#12392;&#12356;&#12358;&#24418;&#24335;&#12391;&#12490;&#12494;&#31186;&#31934;&#24230;&#12391;&#38263;&#12373;&#12434;&#25351;&#23450;&#12377;&#12427;&#12363;&#12289;&#25968;&#23383;<em class="parameter"><code>d</code></em>&#12398;&#12354;&#12392;&#12395;'<code class="literal">s</code>'&#12392;&#26360;&#12356;&#12390;&#31186;&#25968;&#12391;&#38263;&#12373;&#12434;&#25351;&#23450;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;<em class="parameter"><code>HH</code></em>&#12399;&#26178;&#38291;&#12289;<em class="parameter"><code>MM</code></em>&#12399;&#20998;&#12289;<em class="parameter"><code>SS</code></em>&#12399;&#31186;&#25968;&#12391;<em class="parameter"><code>nnnnnnnnn</code></em>&#12490;&#12494;&#31186;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;&#26178;&#38291;&#21450;&#12403;&#12490;&#12494;&#31186;&#12399;&#30465;&#30053;&#12391;&#12365;&#12414;&#12377;&#12290;&#23567;&#25968;&#28857;&#12398;&#24460;&#12429;&#12395;&#12399;9&#26689;&#12414;&#12391;&#12398;&#25968;&#23383;&#12434;&#25351;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;&#25351;&#23450;&#12375;&#12383;&#38263;&#12373;&#12384;&#12369;&#20986;&#21147;&#12373;&#12428;&#12383;&#12425;&#12289;&#27425;&#12398;&#12501;&#12449;&#12452;&#12523;&#12408;&#12398;&#20986;&#21147;&#12364;&#38283;&#22987;&#12373;&#12428;&#12414;&#12377;&#12290;
       </p><p>
        '<code class="literal">duration:</code>'&#12392;&#12356;&#12358;&#25509;&#38957;&#36766;&#12399;&#12289;&#20114;&#25563;&#24615;&#12398;&#12383;&#12417;&#12395;&#30465;&#30053;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
       </p></li><li class="listitem"><p>
        &#25351;&#23450;&#12375;&#12383;&#21508;&#12479;&#12452;&#12512;&#12467;&#12540;&#12489;&#12391;&#20998;&#21106;&#12375;&#12414;&#12377;&#12290;
       </p><p>
        &#26360;&#24335;: <code class="option">--split</code>
timecodes:<em class="parameter"><code>A</code></em>[<span class="optional">,<em class="parameter"><code>B</code></em>[<span class="optional">,<em class="parameter"><code>C</code></em>...</span>]</span>]
       </p><p>
        &#20363;: <code class="code">--split timecodes:00:45:00.000,01:20:00.250,6300s</code>
       </p><p>
        &#12497;&#12521;&#12513;&#12540;&#12479;<em class="parameter"><code>A</code></em>&#12289;<em class="parameter"><code>B</code></em>&#12289;<em class="parameter"><code>C</code></em>&#8230;&#12399;&#12289;duration&#12391;&#20351;&#29992;&#12373;&#12428;&#12427;&#12418;&#12398;&#12392;&#21516;&#12376;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12391;&#25351;&#23450;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;(&#19978;&#35352;&#21442;&#29031;)&#12290;&#12479;&#12452;&#12512;&#12467;&#12540;&#12489;&#12398;&#12522;&#12473;&#12488;&#12399;&#12467;&#12531;&#12510;&#12391;&#21306;&#20999;&#12425;&#12428;&#12414;&#12377;&#12290;&#20837;&#21147;&#12473;&#12488;&#12522;&#12540;&#12512;&#12364;&#29694;&#22312;&#12398;&#20998;&#21106;&#28857;&#12395;&#36948;&#12377;&#12427;&#12392;&#27425;&#12398;&#12501;&#12449;&#12452;&#12523;&#12364;&#20316;&#25104;&#12373;&#12428;&#12289;&#12371;&#12398;&#12522;&#12473;&#12488;&#12363;&#12425;&#27425;&#12398;&#20998;&#21106;&#28857;&#12364;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;
       </p><p>
        '<code class="literal">timecodes:</code>'&#12392;&#12356;&#12358;&#25509;&#38957;&#36766;&#12399;&#12289;&#20114;&#25563;&#24615;&#12398;&#12383;&#12417;&#12395;&#30465;&#30053;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
       </p></li></ol></div><p>
       &#12371;&#12398;&#20998;&#21106;&#12514;&#12540;&#12489;&#12391;&#12399;&#12289;&#20986;&#21147;&#12501;&#12449;&#12452;&#12523;&#21517;&#12399;&#36890;&#24120;&#12398;&#25805;&#20316;&#12392;&#12399;&#30064;&#12427;&#25201;&#12356;&#12434;&#21463;&#12369;&#12414;&#12377;&#12290;&#12371;&#12398;&#12514;&#12540;&#12489;&#12391;&#12399;&#20986;&#21147;&#12501;&#12449;&#12452;&#12523;&#21517;&#12399;<code class="function">printf</code>&#12398;&#12424;&#12358;&#12395;'<code class="literal">%d</code>'&#12392;&#12356;&#12358;&#12497;&#12479;&#12540;&#12531;&#12434;&#21547;&#12416;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;'<code class="literal">%02d</code>'&#12398;&#12424;&#12358;&#12395;&#24133;&#25351;&#23450;&#12434;&#36861;&#21152;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;&#20986;&#21147;&#12501;&#12449;&#12452;&#12523;&#21517;&#12364;&#12371;&#12398;&#12497;&#12479;&#12540;&#12531;&#12434;&#21547;&#12416;&#22580;&#21512;&#12289;&#12501;&#12449;&#12452;&#12523;&#30058;&#21495;&#12364;&#36969;&#20999;&#12394;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12391;&#25351;&#23450;&#12373;&#12428;&#12383;&#20301;&#32622;&#12395;&#25407;&#20837;&#12373;&#12428;&#12414;&#12377;&#12290;&#21547;&#12414;&#12394;&#12356;&#22580;&#21512;&#12289;'<code class="literal">-%03d</code>'&#12392;&#12356;&#12358;&#12497;&#12479;&#12540;&#12531;&#12364;&#12501;&#12449;&#12452;&#12523;&#12398;&#25313;&#24373;&#23376;&#12398;&#30452;&#21069;&#12395;&#25351;&#23450;&#12373;&#12428;&#12383;&#12418;&#12398;&#12392;&#12415;&#12394;&#12373;&#12428;&#12289;&#20363;&#12360;&#12400;'<code class="literal">-o
output.mkv</code>'&#12434;&#25351;&#23450;&#12375;&#12383;&#22580;&#21512;&#12289;'<code class="literal">output-001.mkv</code>'&#31561;&#12398;&#12501;&#12449;&#12452;&#12523;&#21517;&#12395;&#20986;&#21147;&#12373;&#12428;&#12414;&#12377;&#12290;&#25313;&#24373;&#23376;&#12364;&#23384;&#22312;&#12375;&#12394;&#12356;&#22580;&#21512;&#12289;'<code class="literal">-%03d</code>'&#12399;&#12501;&#12449;&#12452;&#12523;&#21517;&#12398;&#26411;&#23614;&#12395;&#36861;&#21152;&#12373;&#12428;&#12414;&#12377;&#12290;
     </p></dd><dt><a name="mkvmerge.description.link"></a><span class="term"><code class="option">--link</code></span></dt><dd><p>
      &#20998;&#21106;&#12373;&#12428;&#12383;&#20986;&#21147;&#12501;&#12449;&#12452;&#12523;&#12434;&#30456;&#20114;&#12395;&#32016;&#20184;&#12369;&#12375;&#12414;&#12377;&#12290;&#35443;&#32048;&#12399;<a class="link" href="#mkvmerge.file_linking" title="&#12501;&#12449;&#12452;&#12523;&#32016;&#20184;&#12369;">&#12501;&#12449;&#12452;&#12523;&#32016;&#20184;&#12369;</a>&#12398;&#12475;&#12463;&#12471;&#12519;&#12531;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
     </p></dd><dt><span class="term"><code class="option">--link-to-previous</code> <em class="parameter"><code>segment-UID</code></em></span></dt><dd><p>
      &#26368;&#21021;&#12398;&#20986;&#21147;&#12501;&#12449;&#12452;&#12523;&#12434;<em class="parameter"><code>segment-UID</code></em>&#12391;&#25351;&#23450;&#12375;&#12383;&#12475;&#12464;&#12513;&#12531;&#12488;UID&#12395;&#32016;&#20184;&#12369;&#12375;&#12414;&#12377;&#12290;&#35443;&#32048;&#12399;<a class="link" href="#mkvmerge.file_linking" title="&#12501;&#12449;&#12452;&#12523;&#32016;&#20184;&#12369;">&#12501;&#12449;&#12452;&#12523;&#32016;&#20184;&#12369;</a>&#12398;&#12475;&#12463;&#12471;&#12519;&#12531;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
     </p></dd><dt><span class="term"><code class="option">--link-to-next</code> <em class="parameter"><code>segment-UID</code></em></span></dt><dd><p>
      &#26368;&#24460;&#12398;&#20986;&#21147;&#12501;&#12449;&#12452;&#12523;&#12434;<em class="parameter"><code>segment-UID</code></em>&#12391;&#25351;&#23450;&#12375;&#12383;&#12475;&#12464;&#12513;&#12531;&#12488;UID&#12395;&#32016;&#20184;&#12369;&#12375;&#12414;&#12377;&#12290;&#35443;&#32048;&#12399;<a class="link" href="#mkvmerge.file_linking" title="&#12501;&#12449;&#12452;&#12523;&#32016;&#20184;&#12369;">&#12501;&#12449;&#12452;&#12523;&#32016;&#20184;&#12369;</a>&#12398;&#12475;&#12463;&#12471;&#12519;&#12531;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
     </p></dd><dt><span class="term"><code class="option">--append-mode</code> <em class="parameter"><code>mode</code></em></span></dt><dd><p>
      &#12501;&#12449;&#12452;&#12523;&#12434;&#32080;&#21512;&#12377;&#12427;&#38555;&#12395;&#12289;&#12479;&#12452;&#12512;&#12467;&#12540;&#12489;&#12364;&#12393;&#12398;&#12424;&#12358;&#12395;&#35336;&#31639;&#12373;&#12428;&#12427;&#12363;&#12434;&#27770;&#23450;&#12375;&#12414;&#12377;&#12290;&#12497;&#12521;&#12513;&#12540;&#12479;<em class="parameter"><code>mode</code></em>&#12399;'<code class="literal">file</code>'(&#12487;&#12501;&#12457;&#12523;&#12488;)&#12289;'<code class="literal">track</code>&#12398;&#20108;&#12388;&#12398;&#20516;&#12434;&#21462;&#12426;&#24471;&#12414;&#12377;&#12290;
     </p><p>
      mkvmerge&#12364;&#20108;&#12388;&#12417;&#12398;&#12501;&#12449;&#12452;&#12523;(&#20197;&#24460;'<code class="literal">file2</code>'&#12392;&#21628;&#12406;)&#12398;&#12488;&#12521;&#12483;&#12463;(&#20197;&#24460;'<code class="literal">track2_1</code>'&#12392;&#21628;&#12406;)&#12434;&#12289;&#19968;&#12388;&#12417;&#12398;&#12501;&#12449;&#12452;&#12523;(&#20197;&#24460;'<code class="literal">file1</code>'&#12392;&#21628;&#12406;)&#12398;&#12488;&#12521;&#12483;&#12463;(&#20197;&#24460;'<code class="literal">track1_1</code>'&#12392;&#21628;&#12406;)&#12392;&#32080;&#21512;&#12377;&#12427;&#38555;&#12289;'<code class="literal">track2_1</code>'&#12398;&#12479;&#12452;&#12512;&#12467;&#12540;&#12489;&#12399;&#19968;&#23450;&#37327;&#12384;&#12369;&#12378;&#12425;&#12377;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;'<code class="literal">file</code>'&#12514;&#12540;&#12489;&#12391;&#12399;&#12289;&#12378;&#12425;&#12377;&#37327;&#12399;'<code class="literal">file1</code>'&#12398;&#20013;&#12398;'<code class="literal">track1_1</code>'&#20197;&#22806;&#12398;&#12488;&#12521;&#12483;&#12463;&#12434;&#21547;&#12416;&#20840;&#12390;&#12398;&#12488;&#12521;&#12483;&#12463;&#12398;&#20013;&#12391;&#19968;&#30058;&#22823;&#12365;&#12356;&#12479;&#12452;&#12512;&#12467;&#12540;&#12489;&#12398;&#20516;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;'<code class="literal">track</code>'&#12514;&#12540;&#12489;&#12391;&#12399;&#12289;'<code class="literal">track1_1</code>'&#12398;&#20013;&#12391;&#19968;&#30058;&#22823;&#12365;&#12356;&#12479;&#12452;&#12512;&#12467;&#12540;&#12489;&#12398;&#20516;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
     </p><p>
      &#27531;&#24565;&#12394;&#12364;&#12425;&#12289;mkvmerge&#12399;&#12393;&#12385;&#12425;&#12398;&#12514;&#12540;&#12489;&#12364;&#36969;&#20999;&#12391;&#12354;&#12427;&#12363;&#21028;&#26029;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12399;'<code class="literal">file</code>'&#12514;&#12540;&#12489;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;'<code class="literal">file</code>'&#12514;&#12540;&#12489;&#12399;&#29420;&#31435;&#12395;&#20316;&#12425;&#12428;&#12383;&#12501;&#12449;&#12452;&#12523;&#21516;&#22763;&#12434;&#32080;&#21512;&#12377;&#12427;&#38555;&#12289;&#20363;&#12360;&#12400;<abbr class="abbrev">AVI</abbr>&#21448;&#12399;<abbr class="abbrev">MP4</abbr>&#12501;&#12449;&#12452;&#12523;&#12434;&#32080;&#21512;&#12377;&#12427;&#38555;&#12395;&#12289;&#36890;&#24120;&#12399;&#12424;&#12426;&#19978;&#25163;&#12367;&#20685;&#12365;&#12414;&#12377;&#12290;'<code class="literal">tracks</code>'&#12514;&#12540;&#12489;&#12399;&#12289;&#20363;&#12360;&#12400;<abbr class="abbrev">VOB</abbr>&#12420;<abbr class="abbrev">EVO</abbr>&#12501;&#12449;&#12452;&#12523;&#12394;&#12393;&#12398;&#22823;&#12365;&#12394;&#12501;&#12449;&#12452;&#12523;&#12398;&#19968;&#37096;&#12364;&#12477;&#12540;&#12473;&#12398;&#22580;&#21512;&#12424;&#12426;&#19978;&#25163;&#12367;&#20685;&#12367;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
     </p><p>
      &#23383;&#24149;&#12488;&#12521;&#12483;&#12463;&#12399;'<code class="literal">track</code>'&#12514;&#12540;&#12489;&#12364;&#25351;&#23450;&#12373;&#12428;&#12383;&#22580;&#21512;&#12391;&#12418;&#12289;&#24120;&#12395;'<code class="literal">file</code>'&#12364;&#25351;&#23450;&#12373;&#12428;&#12383;&#12363;&#12398;&#12424;&#12358;&#12395;&#20966;&#29702;&#12373;&#12428;&#12414;&#12377;&#12290;
     </p></dd><dt><span class="term"><code class="option">--append-to</code>
<em class="parameter"><code>SFID1:STID1:DFID1:DTID1[<span class="optional">,...</span>]</code></em></span></dt><dd><p>
      &#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12393;&#12398;&#12488;&#12521;&#12483;&#12463;&#12364;&#12393;&#12398;&#12488;&#12521;&#12483;&#12463;&#12395;&#36861;&#21152;&#12373;&#12428;&#12427;&#12398;&#12363;&#12434;&#21046;&#24481;&#12375;&#12414;&#12377;&#12290;&#12501;&#12449;&#12452;&#12523;ID&#12289;&#12488;&#12521;&#12483;&#12463;ID&#12289;&#36861;&#21152;&#12377;&#12427;&#12501;&#12449;&#12452;&#12523;ID&#12289;&#36861;&#21152;&#12377;&#12427;&#12488;&#12521;&#12483;&#12463;ID&#12398;4&#12388;&#12398;ID&#12391;&#19968;&#32068;&#12398;&#25351;&#23450;&#12434;&#27083;&#25104;&#12375;&#12414;&#12377;&#12290;&#26368;&#21021;&#12398;&#12501;&#12449;&#12452;&#12523;ID&#12392;&#12488;&#12521;&#12483;&#12463;ID&#12398;&#32068;&#12415;&#21512;&#12431;&#12379;&#12399;&#12289;&#36861;&#21152;&#12373;&#12428;&#12427;&#23550;&#35937;&#12398;&#12488;&#12521;&#12483;&#12463;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#27425;&#12398;&#12501;&#12449;&#12452;&#12523;ID&#12392;&#12488;&#12521;&#12483;&#12463;ID&#12399;&#12289;&#12381;&#12398;&#12488;&#12521;&#12483;&#12463;&#12395;&#36861;&#21152;&#12373;&#12428;&#12427;&#12488;&#12521;&#12483;&#12463;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;
     </p><p>
      &#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#25351;&#23450;&#12373;&#12428;&#12394;&#12356;&#22580;&#21512;&#12289;&#27161;&#28310;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;&#12364;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#22580;&#21512;&#12289;&#21069;&#12398;&#12501;&#12449;&#12452;&#12523;&#12398;&#12488;&#12521;&#12483;&#12463;&#12395;&#12289;&#29694;&#22312;&#12398;&#12501;&#12449;&#12452;&#12523;&#12398;&#12488;&#12521;&#12483;&#12463;ID&#12364;&#21516;&#12376;&#12391;&#12354;&#12427;&#12488;&#12521;&#12483;&#12463;&#12364;&#36861;&#21152;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12428;&#12395;&#12424;&#12426;&#12289;&#21205;&#30011;&#12364;&#20108;&#12388;&#12398;&#12501;&#12449;&#12452;&#12523;&#12395;&#20998;&#21106;&#12373;&#12428;&#12390;&#12362;&#12426;&#12289;&#12363;&#12388;&#21516;&#12376;&#12488;&#12521;&#12483;&#12463;&#25968;&#12392;&#12488;&#12521;&#12483;&#12463;ID&#12434;&#25345;&#12388;&#22580;&#21512;&#12289;<span class="command"><strong>mkvmerge
-o output.mkv part1.mkv +part2.mkv</strong></span>&#12398;&#12424;&#12358;&#12395;&#12375;&#12390;&#31777;&#21336;&#12395;&#32080;&#21512;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
     </p></dd><dt><span class="term"><code class="option">+</code></span></dt><dd><p>
      '+'&#19968;&#25991;&#23383;&#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;&#27425;&#12395;&#25351;&#23450;&#12373;&#12428;&#12383;&#12501;&#12449;&#12452;&#12523;&#12399;&#36861;&#21152;&#12391;&#12399;&#12394;&#12367;&#32080;&#21512;&#12373;&#12428;&#12414;&#12377;&#12290;'+'&#12399;&#27425;&#12398;&#12501;&#12449;&#12452;&#12523;&#21517;&#12398;&#30452;&#21069;&#12395;&#32622;&#12367;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;&#12424;&#12387;&#12390;&#12289;&#27425;&#12398;&#20108;&#12388;&#12398;&#12467;&#12510;&#12531;&#12489;&#12399;&#31561;&#20385;&#12391;&#12377;&#12290;
     </p><pre class="screen">
$ mkvmerge -o full.mkv file1.mkv + file2.mkv
$ mkvmerge -o full.mkv file1.mkv +file2.mkv
     </pre></dd></dl></div><p>
   &#28155;&#20184;&#12501;&#12449;&#12452;&#12523;&#12398;&#12469;&#12509;&#12540;&#12488;&#65288;&#12464;&#12525;&#12540;&#12496;&#12523;&#12458;&#12503;&#12471;&#12519;&#12531;&#12398;&#32154;&#12365;&#65289;:
  </p><div class="variablelist"><dl><dt><a name="mkvmerge.description.attachment_description"></a><span class="term"><code class="option">--attachment-description</code> <em class="parameter"><code>description</code></em></span></dt><dd><p>
      &#27425;&#12398;&#28155;&#20184;&#12501;&#12449;&#12452;&#12523;&#12434;&#35500;&#26126;&#12377;&#12427;&#12503;&#12524;&#12540;&#12531;&#12486;&#12461;&#12473;&#12488;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#27425;&#12398;<a class="link" href="#mkvmerge.description.attach_file"><code class="option">--attach-file</code></a>&#12458;&#12503;&#12471;&#12519;&#12531;&#21448;&#12399;<code class="option">--attach-file-once</code>&#12458;&#12503;&#12471;&#12519;&#12531;&#12391;&#25351;&#23450;&#12375;&#12383;&#28155;&#20184;&#12501;&#12449;&#12452;&#12523;&#12395;&#36969;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;

     </p></dd><dt><span class="term"><code class="option">--attachment-mime-type</code> <em class="parameter"><code>MIME type</code></em></span></dt><dd><p>
      &#27425;&#12398;&#28155;&#20184;&#12501;&#12449;&#12452;&#12523;&#12398;<abbr class="abbrev">MIME</abbr>&#12479;&#12452;&#12503;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;<a class="link" href="#mkvmerge.description.attach_file"><code class="option">--attach-file</code></a>&#21450;&#12403;<a class="link" href="#mkvmerge.description.attach_file"><code class="option">--attach-file-once</code></a>&#12458;&#12503;&#12471;&#12519;&#12531;&#12395;&#36969;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#20844;&#24335;&#12395;&#35469;&#30693;&#12373;&#12428;&#12390;&#12356;&#12427;<abbr class="abbrev">MIME</abbr>&#12479;&#12452;&#12503;&#12399;&#20363;&#12360;&#12400;<a class="ulink" href="http://www.iana.org/assignments/media-types/" target="_top">IANA&#12398;&#12507;&#12540;&#12512;&#12506;&#12540;&#12472;</a>&#12395;&#25522;&#36617;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;<abbr class="abbrev">MIME</abbr>&#12479;&#12452;&#12503;&#12399;&#28155;&#20184;&#12501;&#12449;&#12452;&#12523;&#12395;&#24517;&#38920;&#12391;&#12377;&#12290;
     </p></dd><dt><span class="term"><code class="option">--attachment-name</code> <em class="parameter"><code>name</code></em></span></dt><dd><p>
      &#12371;&#12398;&#28155;&#20184;&#12501;&#12449;&#12452;&#12523;&#12398;&#12289;&#20986;&#21147;&#12501;&#12449;&#12452;&#12523;&#20869;&#12391;&#12398;&#21517;&#21069;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#25351;&#23450;&#12373;&#12428;&#12394;&#12363;&#12387;&#12383;&#22580;&#21512;&#12289;<a class="link" href="#mkvmerge.description.attach_file"><code class="option">--attach-file</code></a>&#12414;&#12383;&#12399;<a class="link" href="#mkvmerge.description.attach_file"><code class="option">--attach-file-once</code></a>&#12391;&#25351;&#23450;&#12373;&#12428;&#12383;&#12501;&#12449;&#12452;&#12523;&#21517;&#12364;&#12381;&#12398;&#12414;&#12414;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;
     </p></dd><dt><a name="mkvmerge.description.attach_file"></a><span class="term">
     <code class="option">--attach-file</code> <em class="parameter"><code>file-name</code></em>,
<code class="option">--attach-file-once</code> <em class="parameter"><code>file-name</code></em>
    </span></dt><dd><p>
      <span class="productname">Matroska</span>&#8482;&#12501;&#12449;&#12452;&#12523;&#12398;&#20869;&#37096;&#12395;&#28155;&#20184;&#12501;&#12449;&#12452;&#12523;&#12434;&#20316;&#25104;&#12375;&#12414;&#12377;&#12290;&#12371;&#12428;&#12425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#20351;&#29992;&#12377;&#12427;&#12395;&#12399;&#12289;<abbr class="abbrev">MIME</abbr>&#12479;&#12452;&#12503;&#12434;&#12371;&#12428;&#12425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12424;&#12426;&#21069;&#12395;&#25351;&#23450;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;&#20108;&#12388;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12398;&#36949;&#12356;&#12399;&#12289;&#20986;&#21147;&#12501;&#12449;&#12452;&#12523;&#12434;&#20998;&#21106;&#12377;&#12427;&#38555;&#12395;&#12289;<code class="option">--attach-file</code>&#12391;&#12399;&#20840;&#12390;&#12398;&#20986;&#21147;&#12501;&#12449;&#12452;&#12523;&#12395;&#28155;&#20184;&#12373;&#12428;&#12414;&#12377;&#12364;&#12289;<code class="option">--attach-file-once</code>&#12391;&#12399;&#26368;&#21021;&#12395;&#20316;&#25104;&#12373;&#12428;&#12383;&#12501;&#12449;&#12452;&#12523;&#12395;&#12375;&#12363;&#28155;&#20184;&#12373;&#12428;&#12394;&#12356;&#28857;&#12391;&#12377;&#12290;&#20998;&#21106;&#12364;&#20351;&#29992;&#12373;&#12428;&#12394;&#12356;&#22580;&#21512;&#12289;&#20108;&#12388;&#12399;&#31561;&#20385;&#12391;&#12377;&#12290;
     </p><p>
      <span class="citerefentry"><span class="refentrytitle">mkvextract</span>(1)</span>&#12391;<span class="productname">Matroska</span>&#8482;&#12501;&#12449;&#12452;&#12523;&#12363;&#12425;&#28155;&#20184;&#12501;&#12449;&#12452;&#12523;&#12434;&#25277;&#20986;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
     </p></dd></dl></div><p>
   &#21508;&#20837;&#21147;&#12501;&#12449;&#12452;&#12523;&#12395;&#25351;&#23450;&#12391;&#12365;&#12427;&#12458;&#12503;&#12471;&#12519;&#12531;:
  </p><div class="variablelist"><dl><dt><span class="term"><code class="option">-a</code>, <code class="option">--audio-tracks</code>
<em class="parameter"><code>n,m,...</code></em></span></dt><dd><p>
      &#12458;&#12540;&#12487;&#12451;&#12458;&#12488;&#12521;&#12483;&#12463;<em class="parameter"><code>n</code></em>&#12289;<em class="parameter"><code>m</code></em>&#8230;&#12434;&#12467;&#12500;&#12540;&#12375;&#12414;&#12377;&#12290;&#30058;&#21495;&#12399;<a class="link" href="#mkvmerge.description.identify"><code class="option">--identify</code></a>&#12458;&#12503;&#12471;&#12519;&#12531;&#12391;&#24471;&#12425;&#12428;&#12427;&#12488;&#12521;&#12483;&#12463;ID&#12391;&#12377;&#12290;&#12371;&#12428;&#12399;&#21336;&#32020;&#12395;&#12488;&#12521;&#12483;&#12463;&#30058;&#21495;&#12434;&#31034;&#12377;&#12418;&#12398;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;(<a class="link" href="#mkvmerge.track_ids" title="&#12488;&#12521;&#12483;&#12463;ID">&#12488;&#12521;&#12483;&#12463;ID</a>&#12398;&#12475;&#12463;&#12471;&#12519;&#12531;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;)&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;:
&#20840;&#12390;&#12398;&#12458;&#12540;&#12487;&#12451;&#12458;&#12488;&#12521;&#12483;&#12463;&#12434;&#12467;&#12500;&#12540;&#12375;&#12414;&#12377;&#12290;
     </p></dd><dt><span class="term"><code class="option">-d</code>, <code class="option">--video-tracks</code>
<em class="parameter"><code>n,m,...</code></em></span></dt><dd><p>
      &#12499;&#12487;&#12458;&#12488;&#12521;&#12483;&#12463;<em class="parameter"><code>n</code></em>&#12289;<em class="parameter"><code>m</code></em>&#8230;&#12434;&#12467;&#12500;&#12540;&#12375;&#12414;&#12377;&#12290;&#25968;&#23383;&#12399;<a class="link" href="#mkvmerge.description.identify"><code class="option">--identify</code></a>&#12458;&#12503;&#12471;&#12519;&#12531;&#12391;&#24471;&#12425;&#12428;&#12427;&#12488;&#12521;&#12483;&#12463;ID&#12391;&#12377;&#12290;&#12371;&#12428;&#12399;&#21336;&#32020;&#12395;&#12488;&#12521;&#12483;&#12463;&#30058;&#21495;&#12434;&#31034;&#12377;&#12418;&#12398;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;(<a class="link" href="#mkvmerge.track_ids" title="&#12488;&#12521;&#12483;&#12463;ID">&#12488;&#12521;&#12483;&#12463;ID</a>&#12398;&#12475;&#12463;&#12471;&#12519;&#12531;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;)&#12290; &#12487;&#12501;&#12457;&#12523;&#12488;:
&#20840;&#12390;&#12398;&#12499;&#12487;&#12458;&#12488;&#12521;&#12483;&#12463;&#12434;&#12467;&#12500;&#12540;&#12375;&#12414;&#12377;&#12290;
     </p></dd><dt><span class="term"><code class="option">-s</code>, <code class="option">--subtitle-tracks</code>
<em class="parameter"><code>n,m,...</code></em></span></dt><dd><p>
      &#23383;&#24149;&#12488;&#12521;&#12483;&#12463;<em class="parameter"><code>n</code></em>&#12289;<em class="parameter"><code>m</code></em>&#8230;&#12434;&#12467;&#12500;&#12540;&#12375;&#12414;&#12377;&#12290;&#30058;&#21495;&#12399;<a class="link" href="#mkvmerge.description.identify"><code class="option">--identify</code></a>&#12458;&#12503;&#12471;&#12519;&#12531;&#12391;&#24471;&#12425;&#12428;&#12427;&#12488;&#12521;&#12483;&#12463;ID&#12391;&#12377;&#12290;&#12371;&#12428;&#12399;&#21336;&#32020;&#12395;&#12488;&#12521;&#12483;&#12463;&#30058;&#21495;&#12434;&#31034;&#12377;&#12418;&#12398;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;(<a class="link" href="#mkvmerge.track_ids" title="&#12488;&#12521;&#12483;&#12463;ID">&#12488;&#12521;&#12483;&#12463;ID</a>&#12398;&#12475;&#12463;&#12471;&#12519;&#12531;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;)&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;:
&#20840;&#12390;&#12398;&#23383;&#24149;&#12488;&#12521;&#12483;&#12463;&#12434;&#12467;&#12500;&#12540;&#12375;&#12414;&#12377;&#12290;
     </p></dd><dt><span class="term"><code class="option">-b</code>, <code class="option">--button-tracks</code>
<em class="parameter"><code>n,m,...</code></em></span></dt><dd><p>
      &#12508;&#12479;&#12531;&#12488;&#12521;&#12483;&#12463;<em class="parameter"><code>n</code></em>&#12289;<em class="parameter"><code>m</code></em>&#8230;&#12434;&#12467;&#12500;&#12540;&#12375;&#12414;&#12377;&#12290;&#30058;&#21495;&#12399;<a class="link" href="#mkvmerge.description.identify"><code class="option">--identify</code></a>&#12458;&#12503;&#12471;&#12519;&#12531;&#12391;&#24471;&#12425;&#12428;&#12427;&#12488;&#12521;&#12483;&#12463;ID&#12391;&#12377;&#12290;&#12371;&#12428;&#12399;&#21336;&#32020;&#12395;&#12488;&#12521;&#12483;&#12463;&#30058;&#21495;&#12434;&#31034;&#12377;&#12418;&#12398;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;(<a class="link" href="#mkvmerge.track_ids" title="&#12488;&#12521;&#12483;&#12463;ID">&#12488;&#12521;&#12483;&#12463;ID</a>&#12398;&#12475;&#12463;&#12471;&#12519;&#12531;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;)&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;:
&#20840;&#12390;&#12398;&#12508;&#12479;&#12531;&#12488;&#12521;&#12483;&#12463;&#12434;&#12467;&#12500;&#12540;&#12375;&#12414;&#12377;&#12290;
     </p></dd><dt><span class="term"><code class="option">--track-tags</code> <em class="parameter"><code>n,m,...</code></em></span></dt><dd><p>
      &#12488;&#12521;&#12483;&#12463;<em class="parameter"><code>n</code></em>&#12289;<em class="parameter"><code>m</code></em>&#8230;&#12398;&#12479;&#12464;&#12434;&#12467;&#12500;&#12540;&#12375;&#12414;&#12377;&#12290;&#30058;&#21495;&#12399;<a class="link" href="#mkvmerge.description.identify"><code class="option">--identify</code></a>&#12458;&#12503;&#12471;&#12519;&#12531;&#12391;&#24471;&#12425;&#12428;&#12427;&#12488;&#12521;&#12483;&#12463;ID&#12391;&#12377;&#12290;&#12371;&#12428;&#12399;&#21336;&#32020;&#12395;&#12488;&#12521;&#12483;&#12463;&#30058;&#21495;&#12434;&#31034;&#12377;&#12418;&#12398;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;(<a class="link" href="#mkvmerge.track_ids" title="&#12488;&#12521;&#12483;&#12463;ID">&#12488;&#12521;&#12483;&#12463;ID</a>&#12398;&#12475;&#12463;&#12471;&#12519;&#12531;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;)&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;:
&#20840;&#12390;&#12398;&#12488;&#12521;&#12483;&#12463;&#12398;&#12479;&#12464;&#12434;&#12467;&#12500;&#12540;&#12375;&#12414;&#12377;&#12290;
     </p></dd><dt><a name="mkvmerge.description.attachments"></a><span class="term"><code class="option">-m</code>, <code class="option">--attachments</code>
<em class="parameter"><code>n[<span class="optional">:all|first</span>],m[<span class="optional">:all|first</span>],...</code></em></span></dt><dd><p>
      ID&#12364;<em class="parameter"><code>n</code></em>&#12289;<em class="parameter"><code>m</code></em>&#8230;&#12398;&#28155;&#20184;&#12501;&#12449;&#12452;&#12523;&#12434;&#20840;&#12390;&#12398;&#12289;&#12414;&#12383;&#12399;&#26368;&#21021;&#12398;&#20986;&#21147;&#12501;&#12449;&#12452;&#12523;&#12395;&#12467;&#12500;&#12540;&#12375;&#12414;&#12377;&#12290;&#21508;ID&#12398;&#24460;&#12429;&#12395;&#12399;&#12289;'<code class="literal">:all</code>'(&#12487;&#12501;&#12457;&#12523;&#12488;)&#21448;&#12399;'<code class="literal">:first</code>'&#12434;&#25351;&#23450;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#20986;&#21147;&#12501;&#12449;&#12452;&#12523;&#20998;&#21106;&#12364;&#26377;&#21177;&#12398;&#22580;&#21512;&#12289;'<code class="literal">:all</code>'&#12434;&#12388;&#12369;&#12383;ID&#12398;&#28155;&#20184;&#12501;&#12449;&#12452;&#12523;&#12399;&#20840;&#12390;&#12398;&#20986;&#21147;&#12501;&#12449;&#12452;&#12523;&#12395;&#12467;&#12500;&#12540;&#12373;&#12428;&#12289;'<code class="literal">:first</code>'&#12434;&#12388;&#12369;&#12383;&#22580;&#21512;&#12399;&#26368;&#21021;&#12398;&#20986;&#21147;&#12501;&#12449;&#12452;&#12523;&#12395;&#12398;&#12415;&#12467;&#12500;&#12540;&#12373;&#12428;&#12414;&#12377;&#12290;&#20998;&#21106;&#12364;&#26377;&#21177;&#12391;&#12394;&#12356;&#22580;&#21512;&#12399;&#20108;&#12388;&#12399;&#21516;&#31561;&#12391;&#12377;&#12290;
     </p><p>
      &#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;&#20840;&#12390;&#12398;&#28155;&#20184;&#12501;&#12449;&#12452;&#12523;&#12364;&#20840;&#12390;&#12398;&#20986;&#21147;&#12501;&#12449;&#12452;&#12523;&#12395;&#12467;&#12500;&#12540;&#12373;&#12428;&#12414;&#12377;&#12290;
     </p></dd><dt><span class="term"><code class="option">-A</code>, <code class="option">--no-audio</code></span></dt><dd><p>
      &#12371;&#12398;&#12501;&#12449;&#12452;&#12523;&#12363;&#12425;&#12458;&#12540;&#12487;&#12451;&#12458;&#12488;&#12521;&#12483;&#12463;&#12434;&#12467;&#12500;&#12540;&#12375;&#12414;&#12379;&#12435;&#12290;
     </p></dd><dt><span class="term"><code class="option">-D</code>, <code class="option">--no-video</code></span></dt><dd><p>
      &#12371;&#12398;&#12501;&#12449;&#12452;&#12523;&#12363;&#12425;&#12499;&#12487;&#12458;&#12488;&#12521;&#12483;&#12463;&#12434;&#12467;&#12500;&#12540;&#12375;&#12414;&#12379;&#12435;&#12290;
     </p></dd><dt><span class="term"><code class="option">-S</code>, <code class="option">--no-subtitles</code></span></dt><dd><p>
      &#12371;&#12398;&#12501;&#12449;&#12452;&#12523;&#12363;&#12425;&#23383;&#24149;&#12488;&#12521;&#12483;&#12463;&#12434;&#12467;&#12500;&#12540;&#12375;&#12414;&#12379;&#12435;&#12290;
     </p></dd><dt><span class="term"><code class="option">-B</code>, <code class="option">--no-buttons</code></span></dt><dd><p>
      &#12371;&#12398;&#12501;&#12449;&#12452;&#12523;&#12363;&#12425;&#12508;&#12479;&#12531;&#12488;&#12521;&#12483;&#12463;&#12434;&#12467;&#12500;&#12540;&#12375;&#12414;&#12379;&#12435;&#12290;
     </p></dd><dt><span class="term"><code class="option">-T</code>, <code class="option">--no-track-tags</code></span></dt><dd><p>
      &#12371;&#12398;&#12501;&#12449;&#12452;&#12523;&#12363;&#12425;&#12458;&#12540;&#12487;&#12451;&#12458;&#12488;&#12521;&#12483;&#12463;&#12434;&#12467;&#12500;&#12540;&#12375;&#12414;&#12379;&#12435;&#12290;
     </p></dd><dt><a name="mkvmerge.description.no_chapters"></a><span class="term"><code class="option">--no-chapters</code></span></dt><dd><p>
      &#12371;&#12398;&#12501;&#12449;&#12452;&#12523;&#12363;&#12425;&#12481;&#12515;&#12503;&#12479;&#12434;&#12467;&#12500;&#12540;&#12375;&#12414;&#12379;&#12435;&#12290;
     </p></dd><dt><a name="mkvmerge.description.no_attachments"></a><span class="term"><code class="option">-M</code>, <code class="option">--no-attachments</code></span></dt><dd><p>
      &#12371;&#12398;&#12501;&#12449;&#12452;&#12523;&#12363;&#12425;&#28155;&#20184;&#12501;&#12449;&#12452;&#12523;&#12434;&#12467;&#12500;&#12540;&#12375;&#12414;&#12379;&#12435;&#12290;
     </p></dd><dt><span class="term"><code class="option">--no-global-tags</code></span></dt><dd><p>
      &#12371;&#12398;&#12501;&#12449;&#12452;&#12523;&#12363;&#12425;&#12464;&#12525;&#12540;&#12496;&#12523;&#12479;&#12464;&#12434;&#24341;&#12365;&#32153;&#12366;&#12414;&#12379;&#12435;&#12290;
     </p></dd><dt><span class="term"><code class="option">--chapter-charset</code> <em class="parameter"><code>character-set</code></em></span></dt><dd><p>
      &#12477;&#12540;&#12473;&#12501;&#12449;&#12452;&#12523;&#12395;&#21547;&#12414;&#12428;&#12427;&#12481;&#12515;&#12503;&#12479;&#24773;&#22577;&#12434;&#12434;UTF-8&#12395;&#22793;&#25563;&#12377;&#12427;&#38555;&#12398;&#25991;&#23383;&#12467;&#12540;&#12489;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;<span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12398;&#25991;&#23383;&#12467;&#12540;&#12489;&#22793;&#25563;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;<a class="link" href="#mkvmerge.text_files_and_charsets" title="&#12486;&#12461;&#12473;&#12488;&#12501;&#12449;&#12452;&#12523;&#12392;&#25991;&#23383;&#12467;&#12540;&#12489;&#22793;&#25563;">&#12486;&#12461;&#12473;&#12488;&#12501;&#12449;&#12452;&#12523;&#12392;&#25991;&#23383;&#12467;&#12540;&#12489;</a>&#12398;&#12475;&#12463;&#12471;&#12519;&#12531;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
     </p></dd><dt><span class="term"><code class="option">--chapter-language</code> <em class="parameter"><code>language-code</code></em></span></dt><dd><p>
      &#21508;&#12481;&#12515;&#12503;&#12479;&#12456;&#12531;&#12488;&#12522;&#12398;ISO639-2&#35328;&#35486;&#12467;&#12540;&#12489;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12477;&#12540;&#12473;&#12501;&#12449;&#12452;&#12523;&#12364;&#12481;&#12515;&#12503;&#12479;&#12399;&#21547;&#12415;&#12414;&#12377;&#12364;&#12289;&#12481;&#12515;&#12503;&#12479;&#12398;&#35328;&#35486;&#24773;&#22577;&#12434;&#21547;&#12414;&#12394;&#12356;&#22580;&#21512;(&#20363;:MP4&#12289;OGM&#12501;&#12449;&#12452;&#12523;)&#12395;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;
     </p></dd><dt><span class="term"><code class="option">-y</code>, <code class="option">--sync</code>
<em class="parameter"><code>TID:d[<span class="optional">,o[<span class="optional">/p</span>]</span>]</code></em></span></dt><dd><p>
      &#12488;&#12521;&#12483;&#12463;ID&#12364;<em class="parameter"><code>TID</code></em>&#12398;&#12488;&#12521;&#12483;&#12463;&#12398;&#12479;&#12452;&#12512;&#12467;&#12540;&#12489;&#12434;<em class="parameter"><code>d</code></em>&#12511;&#12522;&#31186;&#12384;&#12369;&#35519;&#25972;&#12375;&#12414;&#12377;&#12290;&#12488;&#12521;&#12483;&#12463;ID&#12399;<a class="link" href="#mkvmerge.description.identify"><code class="option">--identify</code></a>&#12458;&#12503;&#12471;&#12519;&#12531;&#12391;&#24471;&#12425;&#12428;&#12427;&#12418;&#12398;&#12392;&#21516;&#12376;&#12391;&#12377;(<a class="link" href="#mkvmerge.track_ids" title="&#12488;&#12521;&#12483;&#12463;ID">&#12488;&#12521;&#12483;&#12463;ID</a>&#12398;&#12475;&#12463;&#12471;&#12519;&#12531;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;)&#12290;
     </p><p>
      <em class="parameter"><code>o</code></em>/<em class="parameter"><code>p</code></em>:
&#12479;&#12452;&#12512;&#12473;&#12479;&#12531;&#12503;&#12434;<em class="parameter"><code>o</code></em>/<em class="parameter"><code>p</code></em>&#12398;&#21106;&#21512;&#12391;&#35519;&#25972;&#12375;&#12289;&#12522;&#12491;&#12450;&#12489;&#12522;&#12501;&#12488;&#12434;&#20462;&#27491;&#12375;&#12414;&#12377;&#12290;<em class="parameter"><code>p</code></em>&#12364;&#30465;&#30053;&#12373;&#12428;&#12383;&#22580;&#21512;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;1&#12364;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;<em class="parameter"><code>o</code></em>&#21450;&#12403;<em class="parameter"><code>p</code></em>&#12395;&#12399;&#23567;&#25968;&#12434;&#25351;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;
     </p><p>
      &#12487;&#12501;&#12457;&#12523;&#12488;: &#12510;&#12491;&#12517;&#12450;&#12523;&#21516;&#26399;&#20462;&#27491;&#12399;&#34892;&#12431;&#12428;&#12414;&#12379;&#12435;(<em class="parameter"><code>d</code></em> = <code class="constant">0</code>
&#12363;&#12388;<em class="parameter"><code>o</code></em> = <code class="constant">1.0</code>&#12398;&#22580;&#21512;&#12392;&#21516;&#12376;&#12391;&#12377;)&#12290;
     </p><p>
      &#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#30064;&#12427;&#12488;&#12521;&#12483;&#12463;ID&#12434;&#25351;&#23450;&#12377;&#12427;&#12371;&#12392;&#12391;&#35079;&#25968;&#12398;&#20837;&#21147;&#12488;&#12521;&#12483;&#12463;&#12395;&#23550;&#12375;&#12390;&#20351;&#29992;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
     </p></dd><dt><a name="mkvmerge.description.cues"></a><span class="term"><code class="option">--cues</code> <em class="parameter"><code>TID:none|iframes|all</code></em></span></dt><dd><p>
      &#25351;&#23450;&#12373;&#12428;&#12383;&#12488;&#12521;&#12483;&#12463;&#12395;&#12388;&#12356;&#12390;&#12289;&#12393;&#12398;&#12488;&#12521;&#12483;&#12463;CUE(&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;)&#12456;&#12531;&#12488;&#12522;&#12364;&#20316;&#25104;&#12373;&#12428;&#12427;&#12398;&#12363;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;(<a class="link" href="#mkvmerge.track_ids" title="&#12488;&#12521;&#12483;&#12463;ID">&#12488;&#12521;&#12483;&#12463;ID</a>&#12398;&#12475;&#12463;&#12471;&#12519;&#12531;&#12434;&#21442;&#29031;)&#12290;'<code class="literal">none</code>'&#12399;CUE&#12456;&#12531;&#12488;&#12522;&#12434;&#20316;&#25104;&#12375;&#12414;&#12379;&#12435;&#12290;'<code class="literal">iframes</code>&#12399;&#21069;&#26041;&#21442;&#29031;&#21450;&#12403;&#24460;&#26041;&#21442;&#29031;&#12434;&#21547;&#12414;&#12394;&#12356;&#12502;&#12525;&#12483;&#12463;(&#12499;&#12487;&#12458;&#12488;&#12521;&#12483;&#12463;&#12391;&#12399;
I
frame)&#12398;&#12415;&#12364;CUE&#12471;&#12540;&#12488;&#12395;&#25407;&#20837;&#12373;&#12428;&#12414;&#12377;&#12290;'<code class="literal">all</code>'&#12391;&#12399;<span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12399;&#20840;&#12390;&#12398;&#12502;&#12525;&#12483;&#12463;&#12395;&#23550;&#12375;&#12390;CUE&#12456;&#12531;&#12488;&#12522;&#12434;&#20316;&#25104;&#12375;&#12289;&#38750;&#24120;&#12395;&#22823;&#12365;&#12394;&#12501;&#12449;&#12452;&#12523;&#12434;&#20986;&#21147;&#12377;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
     </p><p>
      &#12487;&#12501;&#12457;&#12523;&#12488;&#12399;&#12499;&#12487;&#12458;&#12488;&#12521;&#12483;&#12463;&#12399;'<code class="literal">iframes</code>&#12391;&#12289;&#12381;&#12398;&#20182;&#12398;&#12488;&#12521;&#12483;&#12463;&#12399;'<code class="literal">none</code>'&#12391;&#12377;&#12290;<code class="option">--cues</code>&#12364;&#20351;&#29992;&#12373;&#12428;&#12390;&#12356;&#12427;&#12363;&#12393;&#12358;&#12363;&#12395;&#38306;&#12431;&#12425;&#12378;CUE&#12456;&#12531;&#12488;&#12522;&#12398;&#20316;&#25104;&#12434;&#25233;&#21046;&#12377;&#12427;&#12289;<a class="link" href="#mkvmerge.description.no_cues"><code class="option">--no-cues</code></a>&#12458;&#12503;&#12471;&#12519;&#12531;&#12418;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
     </p><p>
      &#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#30064;&#12427;&#12488;&#12521;&#12483;&#12463;ID&#12434;&#25351;&#23450;&#12377;&#12427;&#12371;&#12392;&#12391;&#35079;&#25968;&#12398;&#20837;&#21147;&#12488;&#12521;&#12483;&#12463;&#12395;&#23550;&#12375;&#12390;&#20351;&#29992;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
     </p></dd><dt><span class="term"><code class="option">--default-track</code>
<em class="parameter"><code>TID[<span class="optional">:bool</span>]</code></em></span></dt><dd><p>
      &#30465;&#30053;&#21487;&#33021;&#12394;&#24341;&#25968;<em class="parameter"><code>bool</code></em>&#12364;&#25351;&#23450;&#12373;&#12428;&#12394;&#12363;&#12387;&#12383;&#22580;&#21512;&#12289;&#25351;&#23450;&#12373;&#12428;&#12383;&#12488;&#12521;&#12483;&#12463;&#12395;'&#12487;&#12501;&#12457;&#12523;&#12488;'&#12501;&#12521;&#12464;&#12434;&#20184;&#19982;&#12375;&#12414;&#12377;(<a class="link" href="#mkvmerge.track_ids" title="&#12488;&#12521;&#12483;&#12463;ID">&#12488;&#12521;&#12483;&#12463;ID</a>&#12398;&#12475;&#12463;&#12471;&#12519;&#12531;&#12418;&#21442;&#29031;)&#12290;&#12518;&#12540;&#12470;&#12364;&#26126;&#31034;&#30340;&#12395;&#12488;&#12521;&#12483;&#12463;&#12434;&#36984;&#25246;&#12375;&#12394;&#12363;&#12387;&#12383;&#22580;&#21512;&#12289;&#12503;&#12524;&#12452;&#12516;&#12540;&#12399;'&#12487;&#12501;&#12457;&#12523;&#12488;'&#12501;&#12521;&#12464;&#12398;&#20184;&#12356;&#12383;&#12488;&#12521;&#12483;&#12463;&#12434;&#20778;&#20808;&#30340;&#12395;&#20877;&#29983;&#12375;&#12414;&#12377;&#12290;&#21508;&#12488;&#12521;&#12483;&#12463;&#12398;&#31278;&#39006;(&#12458;&#12540;&#12487;&#12451;&#12458;&#12289;&#12499;&#12487;&#12458;&#12289;&#23383;&#24149;&#12289;&#12508;&#12479;&#12531;)&#12372;&#12392;&#12395;&#12289;&#19968;&#12388;&#12384;&#12369;&#12398;&#12488;&#12521;&#12483;&#12463;&#12395;&#12384;&#12369;'&#12487;&#12501;&#12457;&#12523;&#12488;'&#12501;&#12521;&#12464;&#12399;&#20184;&#19982;&#12391;&#12365;&#12414;&#12377;&#12290;&#12418;&#12375;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12501;&#12521;&#12464;&#12434;&#12393;&#12398;&#12488;&#12521;&#12483;&#12463;&#12395;&#12418;&#20184;&#12369;&#12383;&#12367;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;&#20840;&#12390;&#12398;&#12488;&#12521;&#12483;&#12463;&#12391;<em class="parameter"><code>bool</code></em>&#12434;<code class="constant">0</code>&#12395;&#12377;&#12428;&#12400;&#21487;&#33021;&#12391;&#12377;&#12290;
     </p><p>
      &#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#30064;&#12427;&#12488;&#12521;&#12483;&#12463;ID&#12434;&#25351;&#23450;&#12377;&#12427;&#12371;&#12392;&#12391;&#35079;&#25968;&#12398;&#20837;&#21147;&#12488;&#12521;&#12483;&#12463;&#12395;&#23550;&#12375;&#12390;&#20351;&#29992;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
     </p></dd><dt><span class="term"><code class="option">--forced-track</code>
<em class="parameter"><code>TID[<span class="optional">:bool</span>]</code></em></span></dt><dd><p>
      &#30465;&#30053;&#21487;&#33021;&#12394;&#24341;&#25968;<em class="parameter"><code>bool</code></em>&#12364;&#25351;&#23450;&#12373;&#12428;&#12394;&#12363;&#12387;&#12383;&#22580;&#21512;&#12289;&#25351;&#23450;&#12373;&#12428;&#12383;&#12488;&#12521;&#12483;&#12463;&#12395;'&#24375;&#21046;&#34920;&#31034;'&#12501;&#12521;&#12464;&#12434;&#20184;&#19982;&#12375;&#12414;&#12377;&#65288;<a class="link" href="#mkvmerge.track_ids" title="&#12488;&#12521;&#12483;&#12463;ID">&#12488;&#12521;&#12483;&#12463;ID</a>&#12398;&#12475;&#12463;&#12471;&#12519;&#12531;&#12418;&#21442;&#29031;&#12290;&#65289;&#12503;&#12524;&#12540;&#12516;&#12399;&#12371;&#12398;&#12501;&#12521;&#12464;&#12364;<code class="constant">1</code>&#12395;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#20840;&#12390;&#12398;&#12488;&#12521;&#12483;&#12463;&#12434;&#20877;&#29983;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
     </p><p>
      &#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#30064;&#12427;&#12488;&#12521;&#12483;&#12463;ID&#12434;&#25351;&#23450;&#12377;&#12427;&#12371;&#12392;&#12391;&#35079;&#25968;&#12398;&#20837;&#21147;&#12488;&#12521;&#12483;&#12463;&#12395;&#23550;&#12375;&#12390;&#20351;&#29992;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
     </p></dd><dt><span class="term"><code class="option">--blockadd</code> <em class="parameter"><code>TID:level</code></em></span></dt><dd><p>
      &#25351;&#23450;&#12375;&#12383;&#12488;&#12521;&#12483;&#12463;&#12391;&#12289;&#12524;&#12505;&#12523;<em class="parameter"><code>level</code></em>&#12414;&#12391;&#12398;<code class="classname">BlockAddition</code>&#12434;&#20445;&#25345;&#12375;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#20840;&#12390;&#20445;&#25345;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;WAVPACK4&#12394;&#12393;&#12398;&#29305;&#23450;&#12398;&#12467;&#12540;&#12487;&#12483;&#12463;&#12395;&#12398;&#12415;&#26377;&#21177;&#12391;&#12377;&#12290;
     </p></dd><dt><a name="mkvmerge.description.track_name"></a><span class="term"><code class="option">--track-name</code> <em class="parameter"><code>TID:name</code></em></span></dt><dd><p>
      &#25351;&#23450;&#12375;&#12383;&#12488;&#12521;&#12483;&#12463;&#12398;&#12488;&#12521;&#12483;&#12463;&#21517;&#12434;<em class="parameter"><code>name</code></em>&#12395;&#12375;&#12414;&#12377;(<a class="link" href="#mkvmerge.track_ids" title="&#12488;&#12521;&#12483;&#12463;ID">&#12488;&#12521;&#12483;&#12463;ID</a>&#12398;&#12475;&#12463;&#12471;&#12519;&#12531;&#12418;&#21442;&#29031;)&#12290;
     </p></dd><dt><a name="mkvmerge.description.language"></a><span class="term"><code class="option">--language</code> <em class="parameter"><code>TID:language</code></em></span></dt><dd><p>
      &#25351;&#23450;&#12375;&#12383;&#12488;&#12521;&#12483;&#12463;&#12398;&#35328;&#35486;&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;(<a class="link" href="#mkvmerge.track_ids" title="&#12488;&#12521;&#12483;&#12463;ID">&#12488;&#12521;&#12483;&#12463;ID</a>&#12398;&#12475;&#12463;&#12471;&#12519;&#12531;&#12418;&#21442;&#29031;)&#12290;ISO639-2 &#35328;&#35486;&#12467;&#12540;&#12489;&#21450;&#12403;
ISO639-1 &#22269;&#21029;&#12467;&#12540;&#12489;&#12364;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;&#22269;&#21029;&#12467;&#12540;&#12489;&#12399;&#35328;&#35486;&#12467;&#12540;&#12489;&#12408;&#33258;&#21205;&#30340;&#12395;&#22793;&#25563;&#12373;&#12428;&#12414;&#12377;&#12290;ISO639-2 &#12395;&#21547;&#12414;&#12428;&#12427;&#20840;&#12390;&#12398;&#12467;&#12540;&#12489;&#12399;<a class="link" href="#mkvmerge.description.list_languages"><code class="option">--list-languages</code></a>&#12458;&#12503;&#12471;&#12519;&#12531;&#12391;&#19968;&#35239;&#12391;&#12365;&#12414;&#12377;&#12290;
     </p><p>
      &#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#30064;&#12427;&#12488;&#12521;&#12483;&#12463;ID&#12434;&#25351;&#23450;&#12377;&#12427;&#12371;&#12392;&#12391;&#35079;&#25968;&#12398;&#20837;&#21147;&#12488;&#12521;&#12483;&#12463;&#12395;&#23550;&#12375;&#12390;&#20351;&#29992;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
     </p></dd><dt><span class="term"><code class="option">-t</code>, <code class="option">--tags</code>
<em class="parameter"><code>TID:file-name</code></em></span></dt><dd><p>
      <em class="parameter"><code>file-name</code></em>&#12391;&#25351;&#23450;&#12375;&#12383;&#12501;&#12449;&#12452;&#12523;&#12363;&#12425;&#12464;&#12525;&#12540;&#12496;&#12523;&#12479;&#12464;&#12434;&#35501;&#12415;&#36796;&#12415;&#12414;&#12377;&#12290;&#35443;&#32048;&#12399;<a class="link" href="#mkvmerge.tags" title="&#12479;&#12464;">&#12479;&#12464;</a>&#12398;&#12475;&#12463;&#12471;&#12519;&#12531;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
     </p></dd><dt><span class="term"><code class="option">--aac-is-sbr</code>
<em class="parameter"><code>TID[<span class="optional">:0|1</span>]</code></em></span></dt><dd><p>
      <span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12395;ID&#12364;<em class="parameter"><code>TID</code></em>&#12398;&#12488;&#12521;&#12483;&#12463;&#12364;<abbr class="abbrev">SBR AAC</abbr>
(&#21029;&#21517;<abbr class="abbrev">HE-AAC</abbr>&#21448;&#12399;<abbr class="abbrev">AAC+</abbr>)&#12391;&#12354;&#12427;&#12371;&#12392;&#12434;&#25945;&#12360;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289; a)
&#12477;&#12540;&#12473;&#12501;&#12449;&#12452;&#12523;&#12364;(<span class="productname">Matroska</span>&#8482;&#12501;&#12449;&#12452;&#12523;&#12391;&#12399;<span class="emphasis"><em>&#12394;&#12367;</em></span>)<abbr class="abbrev">AAC</abbr>&#12501;&#12449;&#12452;&#12523;&#12391;&#12354;&#12426;&#12363;&#12388;
b) <abbr class="abbrev">AAC</abbr>&#12501;&#12449;&#12452;&#12523;&#12364;<abbr class="abbrev">SBR
AAC</abbr>&#12487;&#12540;&#12479;&#12434;&#21547;&#12416;&#22580;&#21512;&#12395;&#24517;&#35201;&#12391;&#12377;&#12290;&#12371;&#12398;&#12473;&#12452;&#12483;&#12481;&#12364;&#23384;&#22312;&#12377;&#12427;&#29702;&#30001;&#12399;&#12289;&#36890;&#24120;&#12398;<abbr class="abbrev">AAC</abbr>&#12501;&#12449;&#12452;&#12523;&#12392;<abbr class="abbrev">SBR
AAC</abbr>&#12501;&#12449;&#12452;&#12523;&#12434;&#33258;&#21205;&#30340;&#12395;&#21306;&#21029;&#12377;&#12427;&#12371;&#12392;&#12399;&#12289;<abbr class="abbrev">AAC</abbr>&#12501;&#12524;&#12540;&#12512;&#12434;&#23436;&#20840;&#12395;&#12487;&#12467;&#12540;&#12489;&#12375;&#12394;&#12369;&#12428;&#12400;&#25216;&#34899;&#30340;&#12395;&#19981;&#21487;&#33021;&#12391;&#12354;&#12427;&#12383;&#12417;&#12391;&#12377;&#12290;<abbr class="abbrev">AAC</abbr>&#12399;&#12356;&#12367;&#12388;&#12363;&#12398;&#29305;&#35377;&#21839;&#38988;&#12434;&#25265;&#12360;&#12390;&#12356;&#12427;&#12383;&#12417;&#12289;<span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12399;&#23558;&#26469;&#30340;&#12395;&#12418;&#12371;&#12398;&#12487;&#12467;&#12540;&#12489;&#12473;&#12486;&#12540;&#12472;&#12434;&#21547;&#12416;&#12371;&#12392;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#12424;&#12387;&#12390;&#12289;<abbr class="abbrev">SBR
AAC</abbr>&#12395;&#12399;&#12371;&#12398;&#12473;&#12452;&#12483;&#12481;&#12364;&#24517;&#38920;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#12473;&#12452;&#12483;&#12481;&#12364;&#25351;&#23450;&#12373;&#12428;&#12394;&#12363;&#12387;&#12383;&#22580;&#21512;&#12289;&#20986;&#21147;&#12501;&#12449;&#12452;&#12523;&#12399;&#27491;&#24120;&#12395;&#20877;&#29983;&#12364;&#12391;&#12365;&#12394;&#12367;&#12394;&#12427;&#12363;&#12289;&#23436;&#20840;&#12395;&#20877;&#29983;&#19981;&#33021;&#12395;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
     </p><p>
      &#12477;&#12540;&#12473;&#12501;&#12449;&#12452;&#12523;&#12364;<span class="productname">Matroska</span>&#8482;&#12501;&#12449;&#12452;&#12523;&#12398;&#22580;&#21512;&#12289;<code class="classname">CodecID</code>&#12395;&#12424;&#12426;<abbr class="abbrev">SBR
AAC</abbr>&#12434;&#26908;&#30693;&#12391;&#12365;&#12414;&#12377;&#12290;&#12375;&#12363;&#12375;&#12289;<code class="classname">CodecID</code>&#12364;&#19981;&#27491;&#12394;&#22580;&#21512;&#12289;&#12371;&#12398;&#12473;&#12452;&#12483;&#12481;&#12391;&#20462;&#27491;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
     </p><p>
      &#12418;&#12375;&#12289;mkvmerge&#12364;<abbr class="abbrev">AAC</abbr>&#12501;&#12449;&#12452;&#12523;&#12434;&#38291;&#36949;&#12387;&#12390;<abbr class="abbrev">SBR</abbr>&#12392;&#35469;&#35672;&#12375;&#12390;&#12375;&#12414;&#12387;&#12383;&#22580;&#21512;&#12289;&#12488;&#12521;&#12483;&#12463;ID&#12395;'<code class="literal">:0</code>'&#12434;&#25351;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;
     </p></dd><dt><span class="term"><code class="option">--timecodes</code> <em class="parameter"><code>TID:file-name</code></em></span></dt><dd><p>
      &#25351;&#23450;&#12375;&#12383;&#12488;&#12521;&#12483;&#12463;ID&#12398;&#12479;&#12452;&#12512;&#12467;&#12540;&#12489;&#12434;&#12289;<em class="parameter"><code>file-name</code></em>&#12363;&#12425;&#35501;&#12415;&#36796;&#12415;&#12414;&#12377;&#12290;&#12371;&#12428;&#12425;&#12398;&#12479;&#12452;&#12512;&#12467;&#12540;&#12489;&#12399;<span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12364;&#36890;&#24120;&#35336;&#31639;&#12377;&#12427;&#12479;&#12452;&#12512;&#12467;&#12540;&#12489;&#12434;&#24375;&#21046;&#30340;&#12395;&#19978;&#26360;&#12365;&#12375;&#12414;&#12377;&#12290;<a class="link" href="#mkvmerge.external_timecode_files" title="&#22806;&#37096;&#12479;&#12452;&#12512;&#12467;&#12540;&#12489;&#12501;&#12449;&#12452;&#12523;">&#22806;&#37096;&#12479;&#12452;&#12512;&#12467;&#12540;&#12489;&#12501;&#12449;&#12452;&#12523;</a>&#12398;&#12475;&#12463;&#12471;&#12519;&#12531;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
     </p></dd><dt><span class="term"><code class="option">--default-duration</code> <em class="parameter"><code>TID:x</code></em></span></dt><dd><p>
      &#25351;&#23450;&#12375;&#12383;&#12488;&#12521;&#12483;&#12463;&#12398; default duration &#12434;&#24375;&#21046;&#30340;&#12395;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;&#12488;&#12521;&#12483;&#12463;&#12398;&#12479;&#12452;&#12512;&#12467;&#12540;&#12489;&#12418;&#12289; default duration
&#12395;&#21512;&#12358;&#12424;&#12358;&#12395;&#22793;&#26356;&#12373;&#12428;&#12414;&#12377;&#12290;&#24341;&#25968;<em class="parameter"><code>x</code></em>&#12399;'<code class="literal">s</code>'&#12289;'<code class="literal">ms</code>'&#12289;'<code class="literal">us</code>'&#12289;'<code class="literal">ns</code>'&#12289;'<code class="literal">fps</code>'&#12398;&#12358;&#12385;&#12393;&#12428;&#12363;&#19968;&#12388;&#12434;&#24460;&#32622;&#12373;&#12428;&#12390;&#12356;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;&#12381;&#12428;&#12382;&#12428;&#12289;
default duration
&#12399;&#31186;&#12289;&#12511;&#12522;&#31186;&#12289;&#12510;&#12452;&#12463;&#12525;&#31186;&#12289;&#12490;&#12494;&#31186;&#12289;'fps'&#21336;&#20301;&#12391;&#25351;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;<em class="parameter"><code>x</code></em>&#12399;&#23567;&#25968;&#12414;&#12383;&#12399;&#20998;&#25968;&#12391;&#25351;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;
     </p><p>
      default duration &#12364;&#24375;&#21046;&#30340;&#12395;&#25351;&#23450;&#12373;&#12428;&#12394;&#12356;&#22580;&#21512;&#12289;mkvmerge&#12399;&#12488;&#12521;&#12483;&#12463;&#12398; default duration
&#12434;&#12467;&#12531;&#12486;&#12490;&#21448;&#12399;&#20351;&#29992;&#12373;&#12428;&#12390;&#12356;&#12427;&#12467;&#12540;&#12487;&#12483;&#12463;&#12363;&#12425;&#21462;&#24471;&#12375;&#12390;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12398;&#20351;&#29992;&#20363;&#12398;&#19968;&#12388;&#12392;&#12375;&#12390;&#12289;<span class="foreignphrase"><em class="foreignphrase">AVC/h.264</em></span>&#12456;&#12524;&#12513;&#12531;&#12479;&#12522;&#12473;&#12488;&#12522;&#12540;&#12512;&#12434;&#36861;&#21152;&#12377;&#12427;&#22580;&#21512;&#12364;&#12354;&#12370;&#12425;&#12428;&#12414;&#12377;&#12290;&#12394;&#12380;&#12394;&#12425;&#12289;&#12371;&#12428;&#12399;&#12289;&#12501;&#12524;&#12540;&#12512;&#25968;&#12420;&#12501;&#12524;&#12540;&#12512;&#27598;&#12398;
default duration &#12398;&#24773;&#22577;&#12434;&#26684;&#32013;&#12375;&#12390;&#12356;&#12394;&#12356;&#12383;&#12417;&#12391;&#12377;&#12290;&#12371;&#12398;&#12424;&#12358;&#12394;&#12501;&#12449;&#12452;&#12523;&#12395;&#23550;&#12375;&#12390;&#12399;&#12289;&#25351;&#23450;&#12373;&#12428;&#12394;&#12356;&#12363;&#12366;&#12426;<span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12399; default
duration &#12434;'<code class="literal">25fps</code>'&#12392;&#20206;&#23450;&#12375;&#12414;&#12377;&#12290;
     </p><p>
      &#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#22806;&#37096;&#12479;&#12452;&#12512;&#12467;&#12540;&#12489;&#12501;&#12449;&#12452;&#12523;&#12434;&#20351;&#29992;&#12379;&#12378;&#12395;&#12499;&#12487;&#12458;&#12488;&#12521;&#12483;&#12463;&#12398;<abbr class="abbrev">FPS</abbr>&#12434;&#22793;&#26356;&#12377;&#12427;&#12398;&#12395;&#12418;&#20351;&#12360;&#12414;&#12377;&#12290;
     </p></dd><dt><span class="term"><code class="option">--nalu-size-length</code> <em class="parameter"><code>TID:n</code></em></span></dt><dd><p>
      <abbr class="abbrev">NALU</abbr>&#12469;&#12452;&#12474;&#38263;&#12434;<em class="parameter"><code>n</code></em>&#12496;&#12452;&#12488;&#12395;&#24375;&#21046;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12399;<span class="foreignphrase"><em class="foreignphrase">AVC/h.264</em></span>&#12456;&#12524;&#12513;&#12531;&#12479;&#12522;&#12473;&#12488;&#12522;&#12540;&#12512;&#12497;&#12465;&#12479;&#12452;&#12470;&#12364;&#20351;&#29992;&#12373;&#12428;&#12427;&#22580;&#21512;&#12395;&#12398;&#12415;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#20309;&#12418;&#25351;&#23450;&#12375;&#12394;&#12363;&#12387;&#12383;&#26178;&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;4&#12496;&#12452;&#12488;&#12391;&#12377;&#12364;&#12289;65535&#12496;&#12452;&#12488;&#20197;&#19978;&#12398;&#12501;&#12524;&#12540;&#12512;&#12420;&#12473;&#12521;&#12452;&#12473;&#12364;&#21547;&#12414;&#12428;&#12390;&#12356;&#12394;&#12356;&#12501;&#12449;&#12452;&#12523;&#12418;&#23384;&#22312;&#12375;&#12414;&#12377;&#12290;&#12381;&#12398;&#12424;&#12358;&#12394;&#12501;&#12449;&#12452;&#12523;&#12391;&#12399;&#12289;&#12371;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12434;&#20351;&#29992;&#12375;&#12390;NALU&#12469;&#12452;&#12474;&#38263;&#12434;2&#12395;&#28187;&#12425;&#12377;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
     </p></dd></dl></div><p>
   &#12499;&#12487;&#12458;&#12488;&#12521;&#12483;&#12463;&#12395;&#12398;&#12415;&#36969;&#29992;&#12373;&#12428;&#12427;&#12458;&#12503;&#12471;&#12519;&#12531;:
  </p><div class="variablelist"><dl><dt><span class="term"><code class="option">-f</code>, <code class="option">--fourcc</code>
<em class="parameter"><code>TID:FourCC</code></em></span></dt><dd><p>
      <code class="classname">FourCC</code>&#12434;&#25351;&#23450;&#12375;&#12383;&#20516;&#12395;&#24375;&#21046;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;&#12499;&#12487;&#12458;&#12488;&#12521;&#12483;&#12463;&#12364;'<span class="foreignphrase"><em class="foreignphrase">MS&#20114;&#25563;&#12514;&#12540;&#12489;</em></span>'&#12391;&#12354;&#12427;&#22580;&#21512;&#12395;&#12398;&#12415;&#26377;&#21177;&#12391;&#12377;&#12290;
     </p></dd><dt><a name="mkvmerge.description.display_dimensions"></a><span class="term"><code class="option">--display-dimensions</code>
<em class="parameter"><code>TID:widthxheight</code></em></span></dt><dd><p>
      <span class="productname">Matroska</span>&#8482;&#12501;&#12449;&#12452;&#12523;&#12399;&#20877;&#29983;&#26178;&#12398;&#30011;&#20687;&#12473;&#12465;&#12540;&#12523;&#12434;&#27770;&#23450;&#12377;&#12427;&#12383;&#12417;&#12398;&#20108;&#12388;&#12398;&#20516;&#12434;&#25345;&#12385;&#12414;&#12377;&#12290;&#34920;&#31034;&#24133;&#12392;&#34920;&#31034;&#39640;&#12373;&#12391;&#12377;&#12290;&#12371;&#12428;&#12425;&#12398;&#20516;&#12434;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12391;&#12289;&#20363;&#12360;&#12400;'<code class="literal">1:640x480</code>'&#12398;&#12424;&#12358;&#12395;&#25351;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;
     </p><p>
      &#12371;&#12428;&#12425;&#12398;&#20516;&#12434;&#35373;&#23450;&#12377;&#12427;&#21029;&#12398;&#26041;&#27861;&#12392;&#12375;&#12390;&#12289;<a class="link" href="#mkvmerge.description.aspect_ratio"><code class="option">--aspect-ratio</code></a>&#21448;&#12399;<a class="link" href="#mkvmerge.description.aspect_ratio_factor"><code class="option">--aspect-ratio-factor</code></a>&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;(&#19979;&#35352;&#21442;&#29031;)&#12290;&#12371;&#12428;&#12425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#20114;&#12356;&#12395;&#25490;&#20182;&#30340;&#12391;&#12377;&#12290;
     </p></dd><dt><a name="mkvmerge.description.aspect_ratio"></a><span class="term"><code class="option">--aspect-ratio</code>
<em class="parameter"><code>TID:ratio|width/height</code></em></span></dt><dd><p>
      <span class="productname">Matroska</span>&#8482;&#12501;&#12449;&#12452;&#12523;&#12399;&#20877;&#29983;&#26178;&#12398;&#30011;&#20687;&#12473;&#12465;&#12540;&#12523;&#12434;&#27770;&#23450;&#12377;&#12427;&#12383;&#12417;&#12398;&#20108;&#12388;&#12398;&#20516;&#12434;&#25345;&#12385;&#12414;&#12377;&#12290;&#34920;&#31034;&#24133;&#12392;&#34920;&#31034;&#39640;&#12373;&#12391;&#12377;&#12290;&#12371;&#12428;&#12425;&#12398;&#20516;&#12434;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12391;&#12289;&#20363;&#12360;&#12400;'<code class="literal">1:640x480</code>'&#12398;&#12424;&#12358;&#12395;&#25351;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;<span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12399;&#33258;&#21205;&#30340;&#12395;&#34920;&#31034;&#24133;&#21450;&#12403;&#34920;&#31034;&#39640;&#12373;&#12434;&#12289;&#30011;&#20687;&#12398;&#20803;&#12398;&#24133;&#12392;&#39640;&#12373;&#12289;&#12381;&#12375;&#12390;&#25351;&#23450;&#12373;&#12428;&#12383;&#12450;&#12473;&#12506;&#12463;&#12488;&#27604;&#12363;&#12425;&#33258;&#21205;&#30340;&#12395;&#35336;&#31639;&#12375;&#12414;&#12377;&#12290;&#12450;&#12473;&#12506;&#12463;&#12488;&#27604;&#12399;&#12289;&#23567;&#25968;<em class="parameter"><code>ratio</code></em>&#12414;&#12383;&#12399;&#20998;&#25968;'<em class="parameter"><code>width</code></em>/<em class="parameter"><code>height</code></em>'(&#20363;:
'<code class="literal">16/9</code>')&#12398;&#24418;&#24335;&#12391;&#25351;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;
     </p><p>
      &#12371;&#12428;&#12425;&#12398;&#20516;&#12434;&#35373;&#23450;&#12377;&#12427;&#21029;&#12398;&#26041;&#27861;&#12392;&#12375;&#12390;&#12289;<a class="link" href="#mkvmerge.description.aspect_ratio_factor"><code class="option">--aspect-ratio-factor</code></a>&#21448;&#12399;<a class="link" href="#mkvmerge.description.display_dimensions"><code class="option">--display-dimensions</code></a>&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;(&#19978;&#35352;&#21450;&#12403;&#19979;&#35352;&#21442;&#29031;)&#12290;&#12371;&#12428;&#12425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#20114;&#12356;&#12395;&#25490;&#20182;&#30340;&#12391;&#12377;&#12290;
     </p></dd><dt><a name="mkvmerge.description.aspect_ratio_factor"></a><span class="term"><code class="option">--aspect-ratio-factor</code> <em class="parameter"><code>TID:factor|n/d</code></em></span></dt><dd><p>
      &#12450;&#12473;&#12506;&#12463;&#12488;&#27604;&#12434;&#35373;&#23450;&#12377;&#12427;&#12418;&#12358;&#12402;&#12392;&#12388;&#12398;&#26041;&#27861;&#12399;&#12289;&#20803;&#12398;&#12450;&#12473;&#12506;&#12463;&#12488;&#27604;&#12363;&#12425;&#12398;&#20418;&#25968;&#12434;&#25351;&#23450;&#12377;&#12427;&#26041;&#27861;&#12391;&#12377;&#12290;&#20803;&#12398;&#12450;&#12473;&#12506;&#12463;&#12488;&#27604;&#12395;&#12289;<em class="parameter"><code>factor</code></em>&#12434;&#20055;&#12376;&#12383;&#12418;&#12398;&#12364;&#26032;&#12375;&#12356;&#12450;&#12473;&#12506;&#12463;&#12488;&#27604;&#12392;&#12375;&#12390;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;
     </p><p>
      &#12371;&#12428;&#12425;&#12398;&#20516;&#12434;&#35373;&#23450;&#12377;&#12427;&#21029;&#12398;&#26041;&#27861;&#12392;&#12375;&#12390;&#12289;<a class="link" href="#mkvmerge.description.aspect_ratio"><code class="option">--aspect-ratio</code></a>&#21448;&#12399;<a class="link" href="#mkvmerge.description.display_dimensions"><code class="option">--display-dimensions</code></a>&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;(&#19978;&#35352;&#21442;&#29031;)&#12290;&#12371;&#12428;&#12425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#20114;&#12356;&#12395;&#25490;&#20182;&#30340;&#12391;&#12377;&#12290;
     </p></dd><dt><span class="term"><code class="option">--cropping</code> <em class="parameter"><code>TID:left,top,right,bottom</code></em></span></dt><dd><p>
      &#12499;&#12487;&#12458;&#12488;&#12521;&#12483;&#12463;&#12398;&#12500;&#12463;&#12475;&#12523;&#12463;&#12525;&#12483;&#12500;&#12531;&#12464;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12434;&#25351;&#23450;&#12375;&#12383;&#20516;&#12395;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;
     </p></dd><dt><span class="term"><code class="option">--stereo-mode</code> <em class="parameter"><code>TID:n|keyword</code></em></span></dt><dd><p>
      &#12488;&#12521;&#12483;&#12463;ID&#12364;<em class="parameter"><code>TID</code></em>&#12398;&#12499;&#12487;&#12458;&#12488;&#12521;&#12483;&#12463;&#12398;&#12473;&#12486;&#12524;&#12458;&#12514;&#12540;&#12489;&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;&#12514;&#12540;&#12489;&#12399;<code class="constant">0</code>&#12363;&#12425;<code class="constant">3</code>&#12414;&#12391;&#12398;&#25968;&#23383;<em class="parameter"><code>n</code></em>&#12289;&#21448;&#12399;'<code class="literal">none</code>'(<em class="parameter"><code>n</code></em>=<code class="constant">0</code>&#12392;&#21516;&#31561;)&#12289;'<code class="literal">right</code>'(<em class="parameter"><code>n</code></em>=<code class="constant">1</code>&#12392;&#21516;&#31561;)&#12289;'<code class="literal">left</code>'(<em class="parameter"><code>n</code></em>=<code class="constant">2</code>&#12392;&#21516;&#31561;)&#12289;&#21450;&#12403;'<code class="literal">both</code>'(<em class="parameter"><code>n</code></em>=<code class="constant">3</code>&#12392;&#21516;&#31561;)&#12398;&#12358;&#12385;&#12398;&#12393;&#12428;&#12363;&#12434;<em class="parameter"><code>keyword</code></em>&#12392;&#12375;&#12390;&#25351;&#23450;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
     </p></dd><dt><a name="mkvmerge.description.compression"></a><span class="term"><code class="option">--compression</code> <em class="parameter"><code>TID:method</code></em></span></dt><dd><p>
      VobSub&#12488;&#12521;&#12483;&#12463;&#12398;&#22311;&#32302;&#27861;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;&#12503;&#12524;&#12452;&#12516;&#12540;&#12364;&#36984;&#25246;&#12375;&#12383;&#22311;&#32302;&#27861;&#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12390;&#12356;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#25351;&#23450;&#12391;&#12365;&#12427;&#22311;&#32302;&#27861;&#12399;&#12289;'<code class="literal">none</code>'&#12289;'<code class="literal">zlib</code>'&#12289;'<code class="literal">lzo</code>'/'<code class="literal">lxo1x</code>'&#12289;'<code class="literal">bz2</code>'/'<code class="literal">bzlib</code>'&#21450;&#12403;'<code class="literal">mpeg4_p2</code>'/'<code class="literal">mpeg4p2</code>'&#12391;&#12377;&#12290;'<code class="literal">lzo</code>'/'<code class="literal">lxo1x</code>'&#12392;'<code class="literal">bz2</code>'/'<code class="literal">bzlib</code>'&#12399;<span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12364;&#12381;&#12428;&#12382;&#12428;&#12289;<span class="productname">liblzo</span>&#8482;&#21450;&#12403;<span class="productname">bzlib</span>&#8482;&#22311;&#32302;&#12521;&#12452;&#12502;&#12521;&#12522;&#12398;&#12469;&#12509;&#12540;&#12488;&#20184;&#12365;&#12391;&#12467;&#12531;&#12497;&#12452;&#12523;&#12373;&#12428;&#12383;&#12392;&#12365;&#12398;&#12415;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;
     </p><p>
      '<code class="literal">mpeg4_p2</code>'/'<code class="literal">mpeg4p2</code>'&#22311;&#32302;&#27861;&#12399;&#12289;'<span class="foreignphrase"><em class="foreignphrase">header
removal</em></span>'&#12392;&#21628;&#12400;&#12428;&#12427;&#29305;&#27530;&#12394;&#22311;&#32302;&#27861;&#12391;&#12289;MPEG4 part2
&#12499;&#12487;&#12458;&#12488;&#12521;&#12483;&#12463;&#12395;&#12398;&#12415;&#36969;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;&#12381;&#12428;&#20197;&#22806;&#12398;&#22311;&#32302;&#27861;&#12399;&#19968;&#33324;&#30340;&#12394;&#22311;&#32302;&#27861;&#12391;&#12289;&#12393;&#12435;&#12394;&#31278;&#39006;&#12398;&#12488;&#12521;&#12483;&#12463;&#12395;&#36969;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;
     </p><p>
      &#12487;&#12501;&#12457;&#12523;&#12488;&#12399;'<code class="literal">zlib</code>'&#22311;&#32302;&#27861;&#12391;&#12377;&#12290;&#12371;&#12398;&#22311;&#32302;&#27861;&#12399;&#12411;&#12392;&#12435;&#12393;&#20840;&#12390;&#12398;&#20877;&#29983;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;'<code class="literal">none</code>'&#20197;&#22806;&#12398;&#20182;&#12398;&#22311;&#32302;&#27861;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12427;&#12392;&#12399;&#38480;&#12426;&#12414;&#12379;&#12435;&#12290;
     </p></dd></dl></div><p>
   &#12486;&#12461;&#12473;&#12488;&#23383;&#24149;&#12488;&#12521;&#12483;&#12463;&#12395;&#12398;&#12415;&#36969;&#29992;&#12373;&#12428;&#12427;&#12458;&#12503;&#12471;&#12519;&#12531;:
  </p><div class="variablelist"><dl><dt><a name="mkvmerge.description.sub_charset"></a><span class="term"><code class="option">--sub-charset</code> <em class="parameter"><code>TID:character-set</code></em></span></dt><dd><p>
      &#25351;&#23450;&#12375;&#12383;ID&#12398;&#31034;&#12377;&#12488;&#12521;&#12483;&#12463;&#12398;UTF-8&#23383;&#24149;&#12434;UTF-8&#12408;&#22793;&#25563;&#12377;&#12427;&#38555;&#12398;&#25991;&#23383;&#12467;&#12540;&#12489;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;&#29694;&#22312;&#12398;&#12525;&#12465;&#12540;&#12523;&#12398;&#35373;&#23450;&#12364;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;<span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12398;&#25991;&#23383;&#12467;&#12540;&#12489;&#22793;&#25563;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;<a class="link" href="#mkvmerge.text_files_and_charsets" title="&#12486;&#12461;&#12473;&#12488;&#12501;&#12449;&#12452;&#12523;&#12392;&#25991;&#23383;&#12467;&#12540;&#12489;&#22793;&#25563;">&#12486;&#12461;&#12473;&#12488;&#12501;&#12449;&#12452;&#12523;&#12392;&#25991;&#23383;&#12467;&#12540;&#12489;</a>&#12398;&#12475;&#12463;&#12471;&#12519;&#12531;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
     </p><p>
      &#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#30064;&#12427;&#12488;&#12521;&#12483;&#12463;ID&#12434;&#25351;&#23450;&#12377;&#12427;&#12371;&#12392;&#12391;&#35079;&#25968;&#12398;&#20837;&#21147;&#12488;&#12521;&#12483;&#12463;&#12395;&#23550;&#12375;&#12390;&#20351;&#29992;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
     </p></dd></dl></div><p>
   &#12381;&#12398;&#20182;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;:
  </p><div class="variablelist"><dl><dt><a name="mkvmerge.description.identify"></a><span class="term"><code class="option">-i</code>, <code class="option">--identify</code>
<em class="parameter"><code>file-name</code></em></span></dt><dd><p>
      <span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12395;&#12289;&#21336;&#19968;&#12398;&#12501;&#12449;&#12452;&#12523;&#12434;&#25506;&#26619;&#12375;&#12390;&#12381;&#12398;&#31278;&#39006;&#12392;&#12289;&#12501;&#12449;&#12452;&#12523;&#12395;&#21547;&#12414;&#12428;&#12427;&#12488;&#12521;&#12483;&#12463;&#21450;&#12403;&#12381;&#12398;&#12488;&#12521;&#12483;&#12463;ID&#12434;&#34920;&#31034;&#12373;&#12379;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#25351;&#23450;&#12375;&#12383;&#22580;&#21512;&#12289;&#20182;&#12395;&#25351;&#23450;&#12391;&#12365;&#12427;&#12398;&#12399;&#12501;&#12449;&#12452;&#12523;&#21517;&#12398;&#12415;&#12391;&#12377;&#12290;
     </p></dd><dt><span class="term"><code class="option">-l</code>, <code class="option">--list-types</code></span></dt><dd><p>
      &#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12427;&#20837;&#21147;&#12501;&#12449;&#12452;&#12523;&#12398;&#31278;&#39006;&#12434;&#21015;&#25369;&#12375;&#12414;&#12377;&#12290;
     </p></dd><dt><a name="mkvmerge.description.list_languages"></a><span class="term"><code class="option">--list-languages</code></span></dt><dd><p>
      <a class="link" href="#mkvmerge.description.language"><code class="option">--language</code></a>&#12458;&#12503;&#12471;&#12519;&#12531;&#12395;&#25351;&#23450;&#12391;&#12365;&#12427;&#12289;ISO639-2&#35328;&#35486;&#12467;&#12540;&#12489;&#12398;&#19968;&#35239;&#12434;&#20986;&#21147;&#12375;&#12414;&#12377;&#12290;
     </p></dd><dt><span class="term"><code class="option">--priority</code> <em class="parameter"><code>priority</code></em></span></dt><dd><p>
      <span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12434;&#23455;&#34892;&#12377;&#12427;&#38555;&#12398;&#12503;&#12525;&#12475;&#12473;&#20778;&#20808;&#24230;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#25351;&#23450;&#12391;&#12365;&#12427;&#12398;&#12399;'<code class="literal">lowest</code>'&#12289;'<code class="literal">lower</code>'&#12289;'<code class="literal">normal</code>'&#12289;'<code class="literal">higher</code>'&#12289;&#21450;&#12403;'<code class="literal">highest</code>'&#12391;&#12377;&#12290;&#25351;&#23450;&#12373;&#12428;&#12394;&#12356;&#22580;&#21512;&#12289;'<code class="literal">normal</code>'&#12364;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;UNIX&#31995;&#12398;&#12471;&#12473;&#12486;&#12512;&#12391;&#12399;&#12289;<span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12399;<span class="citerefentry"><span class="refentrytitle">nice</span>(2)</span>&#38306;&#25968;&#12434;&#20351;&#29992;&#12377;&#12427;&#12398;&#12391;&#12289;'<code class="literal">higher</code>'&#21450;&#12403;'<code class="literal">highest</code>'&#12399;&#12473;&#12540;&#12497;&#12540;&#12518;&#12540;&#12470;&#12398;&#12415;&#12364;&#20351;&#29992;&#21487;&#33021;&#12391;&#12377;&#12290;Windows&#12391;&#12399;&#20840;&#12390;&#12398;&#12518;&#12540;&#12470;&#12364;&#20840;&#20778;&#20808;&#24230;&#12434;&#20351;&#29992;&#21487;&#33021;&#12391;&#12377;&#12290;
     </p></dd><dt><a name="mkvmerge.description.command_line_charset"></a><span class="term"><code class="option">--command-line-charset</code> <em class="parameter"><code>character-set</code></em></span></dt><dd><p>
      &#12467;&#12510;&#12531;&#12489;&#12521;&#12452;&#12531;&#25991;&#23383;&#21015;&#12398;&#25991;&#23383;&#12467;&#12540;&#12489;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12399;&#12289;&#12471;&#12473;&#12486;&#12512;&#12398;&#29694;&#22312;&#12398;&#12525;&#12465;&#12540;&#12523;&#12398;&#25991;&#23383;&#12467;&#12540;&#12489;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#35373;&#23450;&#12399;<a class="link" href="#mkvmerge.description.title"><code class="option">--title</code></a>&#12289;<a class="link" href="#mkvmerge.description.track_name"><code class="option">--track-name</code></a>&#12289;&#21450;&#12403;<a class="link" href="#mkvmerge.description.attachment_description"><code class="option">--attachment-description</code></a>&#12398;&#19977;&#12388;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12398;&#24341;&#25968;&#12395;&#24433;&#38911;&#12375;&#12414;&#12377;&#12290;
     </p></dd><dt><a name="mkvmerge.description.output_charset"></a><span class="term"><code class="option">--output-charset</code> <em class="parameter"><code>character-set</code></em></span></dt><dd><p>
      &#20986;&#21147;&#12377;&#12427;&#25991;&#23383;&#12467;&#12540;&#12489;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12399;&#12289;&#12471;&#12473;&#12486;&#12512;&#12398;&#29694;&#22312;&#12398;&#12525;&#12465;&#12540;&#12523;&#12398;&#25991;&#23383;&#12467;&#12540;&#12489;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
     </p></dd><dt><a name="mkvmerge.description.redirect_output"></a><span class="term"><code class="option">-r</code>, <code class="option">--redirect-output</code>
<em class="parameter"><code>file-name</code></em></span></dt><dd><p>
      &#20840;&#12390;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#12467;&#12531;&#12477;&#12540;&#12523;&#12391;&#12399;&#12394;&#12367;<em class="parameter"><code>file-name</code></em>&#12391;&#25351;&#23450;&#12375;&#12383;&#12501;&#12449;&#12452;&#12523;&#12395;&#26360;&#12365;&#20986;&#12375;&#12414;&#12377;&#12290;&#20986;&#21147;&#12522;&#12480;&#12452;&#12524;&#12463;&#12488;&#12395;&#12424;&#12387;&#12390;&#12418;&#21516;&#12376;&#12371;&#12392;&#12364;&#31777;&#21336;&#12395;&#12391;&#12365;&#12414;&#12377;&#12364;&#12289;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#24517;&#35201;&#12394;&#22580;&#21512;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;&#12479;&#12540;&#12511;&#12490;&#12523;&#12364;&#12501;&#12449;&#12452;&#12523;&#12395;&#26360;&#12365;&#36796;&#12416;&#21069;&#12395;&#20986;&#21147;&#12434;&#20966;&#29702;&#12375;&#12390;&#12375;&#12414;&#12358;&#22580;&#21512;&#12394;&#12393;&#12391;&#12377;&#12290;<a class="link" href="#mkvmerge.description.output_charset"><code class="option">--output-charset</code></a>&#12395;&#12424;&#12387;&#12390;&#25351;&#23450;&#12373;&#12428;&#12383;&#25991;&#23383;&#12467;&#12540;&#12489;&#12399;&#23562;&#37325;&#12373;&#12428;&#12414;&#12377;&#12290;
     </p></dd><dt><a name="mkvmerge.description.ui_language"></a><span class="term"><code class="option">--ui-language</code> <em class="parameter"><code>code</code></em></span></dt><dd><p>
      &#25351;&#23450;&#12375;&#12383;<em class="parameter"><code>code</code></em>&#12434;&#24375;&#21046;&#30340;&#12395;&#35328;&#35486;&#12467;&#12540;&#12489;(&#20363;:
&#26085;&#26412;&#35486;&#12394;&#12425;&#12400;'<code class="literal">ja_JP</code>')&#12392;&#12375;&#12390;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;&#12375;&#12363;&#12375;&#12289;&#29872;&#22659;&#22793;&#25968;<code class="varname">LANG</code>&#12420;<code class="varname">LC_MESSAGES</code>&#12289;<code class="varname">LC_ALL</code>&#12434;&#20351;&#29992;&#12375;&#12383;&#12411;&#12358;&#12364;&#22909;&#12414;&#12375;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;<em class="parameter"><code>code</code></em>&#12395;<code class="literal">list</code>&#12392;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;&#25351;&#23450;&#12391;&#12365;&#12427;&#35328;&#35486;&#12467;&#12540;&#12489;&#12398;&#19968;&#35239;&#12434;&#20986;&#21147;&#12375;&#12414;&#12377;&#12290;
     </p></dd><dt><span class="term"><code class="option">@</code>options-file</span></dt><dd><p>
      <em class="parameter"><code>options-file</code></em>&#12391;&#25351;&#23450;&#12373;&#12428;&#12383;&#12501;&#12449;&#12452;&#12523;&#12363;&#12425;&#36861;&#21152;&#12398;&#12467;&#12510;&#12531;&#12489;&#12521;&#12452;&#12531;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#35501;&#12415;&#36796;&#12415;&#12414;&#12377;&#12290;&#34892;&#12391;&#26368;&#21021;&#12398;&#31354;&#30333;&#25991;&#23383;&#12391;&#12394;&#12356;&#25991;&#23383;&#12364;&#12495;&#12483;&#12471;&#12517;&#12510;&#12540;&#12463;('<code class="literal">#</code>')&#12391;&#12354;&#12427;&#34892;&#12399;&#12467;&#12513;&#12531;&#12488;&#12392;&#12375;&#12390;&#25201;&#12431;&#12428;&#12289;&#28961;&#35222;&#12373;&#12428;&#12414;&#12377;&#12290;&#34892;&#38957;&#12289;&#21450;&#12403;&#34892;&#26411;&#12398;&#31354;&#30333;&#25991;&#23383;&#12399;&#21462;&#12426;&#38500;&#12363;&#12428;&#12414;&#12377;&#12290;&#21508;&#34892;&#12395;&#12399;&#19968;&#12388;&#12378;&#12388;&#12375;&#12363;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#25351;&#23450;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#12513;&#12479;&#12461;&#12515;&#12521;&#12463;&#12479;&#12398;&#12456;&#12473;&#12465;&#12540;&#12503;&#12399;&#24517;&#35201;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
     </p><p>
      '<span class="command"><strong>mkvmerge -o "my file.mkv" -A "a movie.avi"
sound.ogg</strong></span>'&#12392;&#12356;&#12358;&#12467;&#12510;&#12531;&#12489;&#12521;&#12452;&#12531;&#12392;&#21516;&#12376;&#12371;&#12392;&#12399;&#12289;&#27425;&#12398;&#12424;&#12358;&#12394;&#12458;&#12503;&#12471;&#12519;&#12531;&#12501;&#12449;&#12452;&#12523;&#12395;&#12424;&#12387;&#12390;&#25351;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;
     </p><pre class="programlisting">
# "my file.mkv" &#12395;&#26360;&#12365;&#36796;&#12416;&#12290;
-o
my file.mkv
# "a movie.avi" &#12363;&#12425;&#12499;&#12487;&#12458;&#12488;&#12521;&#12483;&#12463;&#12398;&#12415;&#12434;&#21462;&#12426;&#20986;&#12377;&#12290;
-A
a movie.avi
sound.ogg
     </pre></dd><dt><span class="term"><code class="option">--capabilities</code></span></dt><dd><p>
      &#12467;&#12531;&#12497;&#12452;&#12523;&#26178;&#12395;&#32068;&#36796;&#12414;&#12428;&#12383;&#12458;&#12503;&#12471;&#12519;&#12531;&#27231;&#33021;&#12434;&#19968;&#35239;&#34920;&#31034;&#12375;&#12390;&#32066;&#20102;&#12375;&#12414;&#12377;&#12290;&#20986;&#21147;&#12398;&#19968;&#34892;&#30446;&#12399;&#12496;&#12540;&#12472;&#12519;&#12531;&#24773;&#22577;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#20197;&#38477;&#12398;&#20840;&#12390;&#12398;&#34892;&#12399;&#12289;&#12381;&#12398;&#27231;&#33021;&#12364;&#12467;&#12531;&#12497;&#12452;&#12523;&#12373;&#12428;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#31034;&#12377;&#19968;&#21336;&#35486;&#12398;&#12415;&#12434;&#21547;&#12415;&#12414;&#12377;&#12290;&#12458;&#12503;&#12471;&#12519;&#12531;&#27231;&#33021;&#12398;&#19968;&#35239;&#12434;&#19979;&#12395;&#31034;&#12375;&#12414;&#12377;&#12290;
     </p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p>
        "'<code class="literal">BZ2</code>' -- <span class="productname">bzlib</span>&#8482;&#22311;&#32302;&#12521;&#12452;&#12502;&#12521;&#12522;&#12290;<a class="link" href="#mkvmerge.description.compression"><code class="option">--compression</code></a>&#12458;&#12503;&#12471;&#12519;&#12531;&#12395;&#25351;&#23450;&#12391;&#12365;&#12427;&#22311;&#32302;&#12513;&#12477;&#12483;&#12489;&#12395;&#24433;&#38911;&#12375;&#12414;&#12377;&#12290;
       </p></li><li class="listitem"><p>
        '<code class="literal">LZO</code>' -- <span class="productname">lzo</span>&#8482;&#22311;&#32302;&#12521;&#12452;&#12502;&#12521;&#12522;&#12290;<a class="link" href="#mkvmerge.description.compression"><code class="option">--compression</code></a>&#12458;&#12503;&#12471;&#12519;&#12531;&#12395;&#25351;&#23450;&#12391;&#12365;&#12427;&#22311;&#32302;&#12513;&#12477;&#12483;&#12489;&#12395;&#24433;&#38911;&#12375;&#12414;&#12377;&#12290;
       </p></li><li class="listitem"><p>
        '<code class="literal">FLAC</code>' -- &#29983;<abbr class="abbrev">FLAC</abbr>&#12501;&#12449;&#12452;&#12523;&#12398;&#35501;&#12415;&#36796;&#12415;&#21450;&#12403;&#12289;&#20182;&#12398;&#12467;&#12531;&#12486;&#12490;(&#20363;:
<span class="productname">Ogg</span>&#8482;&#12289;<span class="productname">Matroska</span>&#8482;&#12394;&#12393;)&#12395;&#26684;&#32013;&#12373;&#12428;&#12383;<abbr class="abbrev">FLAC</abbr>&#12488;&#12521;&#12483;&#12463;&#12398;&#20966;&#29702;&#12290;
       </p></li></ul></div></dd><dt><span class="term"><code class="option">-h</code>, <code class="option">--help</code></span></dt><dd><p>
      &#12467;&#12510;&#12531;&#12489;&#26360;&#24335;&#24773;&#22577;&#12434;&#20986;&#21147;&#12375;&#12390;&#32066;&#20102;&#12375;&#12414;&#12377;&#12290;
     </p></dd><dt><span class="term"><code class="option">-V</code>, <code class="option">--version</code></span></dt><dd><p>
      &#12496;&#12540;&#12472;&#12519;&#12531;&#24773;&#22577;&#12434;&#20986;&#21147;&#12375;&#12390;&#32066;&#20102;&#12375;&#12414;&#12377;&#12290;
     </p></dd></dl></div></div><div class="refsect1" title="&#20351;&#29992;&#27861;"><a name="mkvmerge.usage"></a><h2>&#20351;&#29992;&#27861;</h2><p>
   &#21508;&#12501;&#12449;&#12452;&#12523;&#12395;&#12388;&#12356;&#12390;&#12289;&#12518;&#12540;&#12470;&#12399;<span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12364;&#21462;&#12426;&#20986;&#12377;&#12409;&#12365;&#12488;&#12521;&#12483;&#12463;&#12434;&#36984;&#25246;&#12391;&#12365;&#12414;&#12377;&#12290;&#21462;&#12426;&#20986;&#12373;&#12428;&#12383;&#12488;&#12521;&#12483;&#12463;&#12399;&#12289;&#12377;&#12409;&#12390;<code class="option">-o</code>&#12391;&#25351;&#23450;&#12373;&#12428;&#12383;&#12501;&#12449;&#12452;&#12523;&#12395;&#26360;&#12365;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#26082;&#30693;&#12398;(&#12469;&#12509;&#12540;&#12488;&#28168;&#12398;)&#20837;&#21147;&#12501;&#12449;&#12452;&#12523;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12399;<code class="option">-l</code>&#12458;&#12503;&#12471;&#12519;&#12531;&#12391;&#21462;&#24471;&#12391;&#12365;&#12414;&#12377;&#12290;
  </p></div><div class="refsect1" title="&#20363;"><a name="mkvmerge.examples"></a><h2>&#20363;</h2><p>
   &#12354;&#12394;&#12383;&#12399;&#12289; MyMovie.avi &#12392;&#12356;&#12358;&#12501;&#12449;&#12452;&#12523;&#12434;&#25345;&#12387;&#12390;&#12356;&#12390;&#12289;&#12414;&#12383;&#12458;&#12540;&#12487;&#12451;&#12458;&#12488;&#12521;&#12483;&#12463;&#12364;&#21029;&#12398;&#12289;&#20363;&#12360;&#12400;
'<code class="literal">MyMovie.wav</code>'&#12392;&#12356;&#12358;&#12501;&#12449;&#12452;&#12523;&#12395;&#20837;&#12387;&#12390;&#12356;&#12427;&#12392;&#12375;&#12414;&#12377;&#12290;&#12354;&#12394;&#12383;&#12399;&#12289;&#12414;&#12378;&#38899;&#22768;&#12434;<span class="productname">OggVorbis</span>&#8482;&#12391;&#12456;&#12531;&#12467;&#12540;&#12489;&#12375;&#12383;&#12356;&#12392;&#24605;&#12356;&#12414;&#12377;&#12290;
  </p><pre class="screen">$ oggenc -q4 -oMyMovie.ogg MyMovie.wav</pre><p>
   &#25968;&#20998;&#24460;&#12289;&#12499;&#12487;&#12458;&#12392;&#12458;&#12540;&#12487;&#12451;&#12458;&#12434;&#32080;&#21512;&#12391;&#12365;&#12414;&#12377;&#12290;
  </p><pre class="screen">$ mkvmerge -o MyMovie-with-sound.mkv MyMovie.avi MyMovie.ogg</pre><p>
   <abbr class="abbrev">AVI</abbr>&#12501;&#12449;&#12452;&#12523;&#12364;&#26082;&#12395;&#12458;&#12540;&#12487;&#12451;&#12458;&#12488;&#12521;&#12483;&#12463;&#12434;&#25345;&#12387;&#12390;&#12356;&#12383;&#22580;&#21512;(&#12381;&#12375;&#12390;&#12381;&#12398;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12434;<span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12364;&#12469;&#12509;&#12540;&#12488;&#12375;&#12390;&#12356;&#12383;&#22580;&#21512;)&#12289;&#12381;&#12398;&#12488;&#12521;&#12483;&#12463;&#12418;&#12467;&#12500;&#12540;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12428;&#12434;&#36991;&#12369;&#12427;&#12395;&#12399;&#12289;&#19979;&#12398;&#12424;&#12358;&#12395;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </p><pre class="screen">$ mkvmerge -o MyMovie-with-sound.mkv -A MyMovie.avi MyMovie.ogg</pre><p>
   &#12385;&#12423;&#12387;&#12392;&#32771;&#12360;&#12390;&#12289;&#12354;&#12394;&#12383;&#12399;&#12418;&#12358;&#12402;&#12392;&#12388;&#12398;&#12458;&#12540;&#12487;&#12451;&#12458;&#12488;&#12521;&#12483;&#12463;(&#20363;&#12360;&#12400;&#12458;&#12540;&#12487;&#12451;&#12458;&#12467;&#12513;&#12531;&#12479;&#12522;&#12420;&#21561;&#26367;&#12360;&#12394;&#12393;)&#12434;'<code class="literal">MyMovie-add-audio.wav</code>&#12395;&#12522;&#12483;&#12500;&#12531;&#12464;&#12375;&#12414;&#12375;&#12383;&#12290;&#20877;&#12403;&#12456;&#12531;&#12467;&#12540;&#12489;&#12375;&#12390;&#12289;&#26032;&#12375;&#12356;&#12501;&#12449;&#12452;&#12523;&#12395;&#12414;&#12392;&#12417;&#12414;&#12377;&#12290;
  </p><pre class="screen">
$ oggenc -q4 -oMyMovie-add-audio.ogg MyMovie-add-audio.wav
$ mkvmerge -o MM-complete.mkv MyMovie-with-sound.mkv MyMovie-add-audio.ogg
  </pre><p>
   &#21516;&#12376;&#12371;&#12392;&#12399;&#12289;&#27425;&#12398;&#12424;&#12358;&#12395;&#12375;&#12390;&#12418;&#21487;&#33021;&#12391;&#12377;&#12290;
  </p><pre class="screen">$ mkvmerge -o MM-complete.mkv -A MyMovie.avi MyMovie.ogg MyMovie-add-audio.ogg</pre><p>
   &#12354;&#12392;&#12399;<span class="productname">mplayer</span>&#8482;&#12434;&#31435;&#12385;&#19978;&#12370;&#12390;&#21205;&#30011;&#12434;&#27005;&#12375;&#12416;&#12384;&#12369;&#12391;&#12377;&#12290;&#12418;&#12375;&#12289;&#35079;&#25968;&#12398;&#12458;&#12540;&#12487;&#12451;&#12458;&#12488;&#12521;&#12483;&#12463;(&#12418;&#12375;&#12363;&#12377;&#12427;&#12392;&#12499;&#12487;&#12458;&#12488;&#12521;&#12483;&#12463;&#12418;)&#12364;&#12354;&#12427;&#22580;&#21512;&#12399;&#12289;&#20877;&#29983;&#12377;&#12427;&#12488;&#12521;&#12483;&#12463;&#12434;'<code class="option">-vid</code>'&#12392;'<code class="option">-aid</code>'&#12458;&#12503;&#12471;&#12519;&#12531;&#12391;<span class="productname">mplayer</span>&#8482;&#12395;&#25351;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;&#12476;&#12525;&#12505;&#12540;&#12473;&#12391;&#12289;&#12499;&#12487;&#12458;&#12392;&#12458;&#12540;&#12487;&#12451;&#12458;&#12398;&#21306;&#21029;&#12434;&#12375;&#12394;&#12356;ID&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;
  </p><p>
   &#12418;&#12375;&#12289;&#12458;&#12540;&#12487;&#12451;&#12458;&#12488;&#12521;&#12483;&#12463;&#12398;&#21516;&#26399;&#12434;&#12392;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#22580;&#21512;&#12418;&#12289;&#31777;&#21336;&#12395;&#12392;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#12414;&#12378;&#12289;&#27425;&#12398;&#12424;&#12358;&#12395;&#12375;&#12390;Vorbis&#12488;&#12521;&#12483;&#12463;&#12398;&#12488;&#12521;&#12483;&#12463;ID&#12434;&#21462;&#24471;&#12375;&#12414;&#12377;&#12290;
  </p><pre class="screen">$ mkvmerge --identify outofsync.ogg</pre><p>
   &#27425;&#12395;&#12289;&#12371;&#12398;ID&#12434;&#20351;&#12387;&#12390;&#12289;&#27425;&#12398;&#12424;&#12358;&#12394;&#12467;&#12510;&#12531;&#12489;&#12521;&#12452;&#12531;&#12434;&#23455;&#34892;&#12375;&#12414;&#12377;&#12290;
  </p><pre class="screen">$ mkvmerge -o goodsync.mkv -A source.avi -y 12345:200 outofsync.ogg</pre><p>
   &#19978;&#12398;&#12424;&#12358;&#12395;&#12377;&#12427;&#12392;&#12289;'<code class="literal">outofsync.ogg</code>'&#12395;&#20837;&#12387;&#12390;&#12356;&#12427;&#12289;ID&#12364;
<code class="constant">12345</code> &#12398;&#12458;&#12540;&#12487;&#12451;&#12458;&#12488;&#12521;&#12483;&#12463;&#12398;&#26368;&#21021;&#12395;200ms&#12398;&#28961;&#38899;&#12434;&#25407;&#20837;&#12375;&#12414;&#12377;&#12290;
  </p><p>
   &#26368;&#21021;&#12399;&#21516;&#26399;&#12364;&#12392;&#12428;&#12390;&#12356;&#12427;&#12398;&#12395;&#12384;&#12435;&#12384;&#12435;&#12392;&#12378;&#12428;&#12390;&#12356;&#12367;&#21205;&#30011;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#12424;&#12358;&#12394;&#21205;&#30011;&#12395;&#12399;&#12289;&#20840;&#12390;&#12398;&#12479;&#12452;&#12512;&#12467;&#12540;&#12489;&#12395;&#36969;&#29992;&#12373;&#12428;&#12427;&#36933;&#12428;&#20418;&#25968;&#12434;&#25351;&#23450;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#12487;&#12540;&#12479;&#12399;&#36861;&#21152;&#12418;&#21066;&#38500;&#12418;&#12373;&#12428;&#12394;&#12356;&#12398;&#12391;&#12289;&#12354;&#12414;&#12426;&#22823;&#12365;&#12394;&#12289;&#12414;&#12383;&#12399;&#12354;&#12414;&#12426;&#12395;&#23567;&#12373;&#12394;&#20418;&#25968;&#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12414;&#12378;&#12356;&#32080;&#26524;&#12395;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;&#20363;&#12392;&#12375;&#12390;&#12289;&#31169;&#12364;&#22793;&#25563;&#12375;&#12383;&#12354;&#12427;&#21205;&#30011;&#12399;&#12289;&#20840;&#38263;&#12364;<code class="constant">77340</code>&#12501;&#12524;&#12540;&#12512;&#12391;&#12289;&#26368;&#32066;&#30340;&#12395;<code class="constant">0.2</code>&#31186;&#12378;&#12428;&#12390;&#12356;&#12414;&#12375;&#12383;&#12290;<code class="constant">29.97fps</code>&#12391;&#12399;&#12289;<code class="constant">0.2</code>&#12399;&#32004;<code class="constant">6</code>&#12501;&#12524;&#12540;&#12512;&#12395;&#30456;&#24403;&#12375;&#12414;&#12377;&#12290;&#12424;&#12387;&#12390;&#12289;&#31169;&#12399;&#27425;&#12398;&#12424;&#12358;&#12394;&#12467;&#12510;&#12531;&#12489;&#12434;&#23455;&#34892;&#12375;&#12414;&#12375;&#12383;&#12290;
  </p><pre class="screen">$ mkvmerge -o goodsync.mkv -y 23456:0,77346/77340 outofsync.mkv</pre><p>
   &#32080;&#26524;&#12399;&#33391;&#22909;&#12391;&#12375;&#12383;&#12290;
  </p><p>
   &#21516;&#26399;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#23383;&#24149;&#12395;&#12418;&#21516;&#27096;&#12395;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;
  </p><p>
   &#12486;&#12461;&#12473;&#12488;&#23383;&#24149;&#12434;&#29983;&#25104;&#12377;&#12427;&#12395;&#12399;&#12289;<span class="productname">SubRipper</span>&#8482;&#12398;&#12424;&#12358;&#12394;Windows&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#20351;&#29992;&#12377;&#12427;&#12363;&#12289;<span class="citerefentry"><span class="refentrytitle">transcode</span>(1)</span>&#12398;&#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12398;&#12289;<code class="literal">contrib/subrip</code>'&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12398;&#20013;&#12395;&#12354;&#12427;<span class="productname">subrip</span>&#8482;&#12497;&#12483;&#12465;&#12540;&#12472;&#12364;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;&#19968;&#33324;&#30340;&#12394;&#12503;&#12525;&#12475;&#12473;&#12399;&#20197;&#19979;&#12398;&#36890;&#12426;&#12391;&#12377;&#12290;
  </p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>&#12477;&#12540;&#12473;&#12363;&#12425;&#29983;&#23383;&#24149;&#12434;&#25277;&#20986;:</p><pre class="screen">$ tccat -i /path/to/copied/dvd/ -T 1 -L | tcextract -x ps1 -t vob -a 0x20 | subtitle2pgm -o mymovie</pre></li><li class="listitem"><p>&#20986;&#21147;&#12373;&#12428;&#12383;PGM&#12452;&#12513;&#12540;&#12472;&#12434;gocr&#12391;&#12486;&#12461;&#12473;&#12488;&#21270;:</p><pre class="screen">$ pgm2txt mymovie</pre></li><li class="listitem"><p>&#20986;&#21147;&#12373;&#12428;&#12383;&#12486;&#12461;&#12473;&#12488;&#12501;&#12449;&#12452;&#12523;&#12434;&#26657;&#27491;:</p><pre class="screen">$ ispell -d american *txt</pre></li><li class="listitem"><p>&#12486;&#12461;&#12473;&#12488;&#12501;&#12449;&#12452;&#12523;&#12434;SRT&#12501;&#12449;&#12452;&#12523;&#12395;&#22793;&#25563;:</p><pre class="screen">$ srttool -s -w -i mymovie.srtx -o mymovie.srt</pre></li></ol></div><p>
   &#20986;&#21147;&#12373;&#12428;&#12383;&#12501;&#12449;&#12452;&#12523;&#12434;<span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12398;&#20837;&#21147;&#12501;&#12449;&#12452;&#12523;&#12392;&#12375;&#12390;&#20351;&#29992;&#12377;&#12427;:
  </p><pre class="screen">$ mkvmerge -o mymovie.mkv mymovie.avi mymovie.srt</pre><p>
   &#12418;&#12375;&#12289;&#12354;&#12427;&#12488;&#12521;&#12483;&#12463;&#12395;&#35328;&#35486;&#12467;&#12540;&#12489;&#12434;&#25351;&#23450;&#12375;&#12383;&#12356;&#12394;&#12425;&#12400;&#12289;&#31777;&#21336;&#12395;&#25351;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;&#12414;&#12378;&#12289;&#25351;&#23450;&#12377;&#12427;&#35328;&#35486;&#12398;ISO639-2&#12467;&#12540;&#12489;&#12434;&#35519;&#12409;&#12414;&#12377;&#12290;&#27425;&#12398;&#12424;&#12358;&#12395;&#12377;&#12428;&#12400;<span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12395;&#20840;&#12390;&#12398;&#35328;&#35486;&#12467;&#12540;&#12489;&#12434;&#19968;&#35239;&#34920;&#31034;&#12373;&#12379;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
  </p><pre class="screen">$ mkvmerge --list-languages</pre><p>
   &#24517;&#35201;&#12394;&#35328;&#35486;&#12434;&#12522;&#12473;&#12488;&#12398;&#20013;&#12363;&#12425;&#25506;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;<span class="productname">Matroska</span>&#8482;&#12501;&#12449;&#12452;&#12523;&#12398;&#20013;&#12395;&#12289;&#20108;&#12388;&#12398;&#12458;&#12540;&#12487;&#12451;&#12458;&#12488;&#12521;&#12483;&#12463;&#12364;&#12354;&#12426;&#12289;&#12488;&#12521;&#12483;&#12463;ID&#12399;2&#12392;3&#12384;&#12392;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#20108;&#12388;&#12395;&#35328;&#35486;&#12467;&#12540;&#12489;&#12434;&#25351;&#23450;&#12377;&#12427;&#12395;&#12399;&#12289;&#27425;&#12398;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;
  </p><pre class="screen">$ mkvmerge -o with-lang-codes.mkv --language 2:ger --language 3:dut without-lang-codes.mkv</pre><p>
   &#12371;&#12398;&#12424;&#12358;&#12395;&#12289;<a class="link" href="#mkvmerge.description.language"><code class="option">--language</code></a>&#12473;&#12452;&#12483;&#12481;&#12434;&#35079;&#25968;&#22238;&#20351;&#12358;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
  </p><p>
   &#12503;&#12524;&#12452;&#12516;&#12540;&#12395;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12458;&#12521;&#12531;&#12480;&#35486;&#12434;&#20877;&#29983;&#12373;&#12379;&#12383;&#12356;&#12392;&#12365;&#12418;&#12354;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;&#12373;&#12425;&#12395;&#12289;&#20363;&#12360;&#12400;&#33521;&#35486;&#12392;&#12501;&#12521;&#12531;&#12473;&#35486;&#12398;&#23383;&#24149;&#12364;&#12354;&#12387;&#12390;&#12289;&#12501;&#12521;&#12531;&#12473;&#35486;&#12434;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#20877;&#29983;&#12373;&#12379;&#12383;&#12356;&#12392;&#20206;&#23450;&#12375;&#12414;&#12377;&#12290;&#12371;&#12428;&#12399;&#12289;&#27425;&#12398;&#12424;&#12358;&#12395;&#12377;&#12428;&#12400;&#21487;&#33021;&#12391;&#12377;&#12290;
  </p><pre class="screen">$ mkvmerge -o with-lang-codes.mkv --language 2:ger --language 3:dut --default-track 3 without-lang-codes.mkv --language 0:eng english.srt --default-track 0 --language 0:fre french.srt</pre><p>
   &#12418;&#12375;&#12289;&#25351;&#23450;&#12375;&#12383;&#12399;&#12378;&#12398;&#35328;&#35486;&#12420;&#12487;&#12501;&#12457;&#12523;&#12488;&#12501;&#12521;&#12464;&#12364;<span class="citerefentry"><span class="refentrytitle">mkvinfo</span>(1)</span>&#12398;&#20986;&#21147;&#12395;&#35211;&#24403;&#12383;&#12425;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;<a class="link" href="#mkvmerge.default_values" title="&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;">&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;</a>&#12398;&#12475;&#12463;&#12471;&#12519;&#12531;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </p></div><div class="refsect1" title="&#12488;&#12521;&#12483;&#12463;ID"><a name="mkvmerge.track_ids"></a><h2>&#12488;&#12521;&#12483;&#12463;ID</h2><p>
   <span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12398;&#20013;&#12395;&#12399;&#12289;&#12393;&#12398;&#12488;&#12521;&#12483;&#12463;&#12395;&#36969;&#29992;&#12377;&#12427;&#12363;&#12434;&#29305;&#23450;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289;&#12488;&#12521;&#12483;&#12463;ID&#12434;&#25351;&#23450;&#12377;&#12427;&#24517;&#35201;&#12394;&#12418;&#12398;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#12488;&#12521;&#12483;&#12463;ID&#12399;&#12289;&#20837;&#21147;&#12501;&#12449;&#12452;&#12523;&#12364;demux&#12373;&#12428;&#12427;&#38555;&#12395;&#34920;&#31034;&#12373;&#12428;&#12427;&#12411;&#12363;&#12289;<span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12395;<a class="link" href="#mkvmerge.description.identify"><code class="option">--identify</code></a>&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#25351;&#23450;&#12375;&#12390;&#34920;&#31034;&#12373;&#12379;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;&#12371;&#12398;&#22580;&#21512;&#12398;&#20986;&#21147;&#12399;&#27425;&#12398;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  </p><pre class="screen">
$ mkvmerge -i v.mkv
File 'v.mkv': container: <span class="productname">Matroska</span>&#8482;
Track ID 1: video (V_MS/VFW/FOURCC, DIV3)
Track ID 2: audio (A_MPEG/L3)
  </pre><p>
   &#12488;&#12521;&#12483;&#12463;ID&#12399;&#27425;&#12398;&#12424;&#12358;&#12395;&#21106;&#12426;&#24403;&#12390;&#12425;&#12428;&#12414;&#12377;:
  </p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p>
     <abbr class="abbrev">AVI</abbr> &#12501;&#12449;&#12452;&#12523;: &#12499;&#12487;&#12458;&#12488;&#12521;&#12483;&#12463;&#12398;ID&#12399;0&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12458;&#12540;&#12487;&#12451;&#12458;&#12488;&#12521;&#12483;&#12463;&#12398;ID&#12399;1&#12363;&#12425;&#26119;&#38918;&#12395;&#21106;&#12426;&#24403;&#12390;&#12425;&#12428;&#12414;&#12377;&#12290;
    </p></li><li class="listitem"><p>
     <abbr class="abbrev">AAC</abbr>&#12289;<abbr class="abbrev">AC3</abbr>&#12289;<abbr class="abbrev">MP3</abbr>&#12289;<abbr class="abbrev">SRT</abbr>&#12289;&#21450;&#12403;<abbr class="abbrev">WAV</abbr>&#12501;&#12449;&#12452;&#12523;:
&#12501;&#12449;&#12452;&#12523;&#20013;&#12398;&#21807;&#19968;&#12398;&#12488;&#12521;&#12483;&#12463;&#12364;ID 0 &#12434;&#21106;&#12426;&#24403;&#12390;&#12425;&#12428;&#12414;&#12377;&#12290;
    </p></li><li class="listitem"><p>
     Ogg/<abbr class="abbrev">OGM</abbr> &#12501;&#12449;&#12452;&#12523;: &#26368;&#21021;&#12398;&#12488;&#12521;&#12483;&#12463;&#12434;0&#12392;&#12375;&#12390;&#12289;&#35211;&#20184;&#12363;&#12387;&#12383;&#38918;&#12395;&#21106;&#12426;&#24403;&#12390;&#12425;&#12428;&#12414;&#12377;&#12290;
    </p></li><li class="listitem"><p>
     <span class="productname">Matroska</span>&#8482; &#12501;&#12449;&#12452;&#12523;:
<span class="citerefentry"><span class="refentrytitle">mkvinfo</span>(1)</span>&#12364;&#34920;&#31034;&#12377;&#12427;&#12488;&#12521;&#12483;&#12463;&#30058;&#21495;&#12364;&#12488;&#12521;&#12483;&#12463;ID&#12392;&#12375;&#12390;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12428;&#12399;&#12488;&#12521;&#12483;&#12463;UID&#12391;&#12399;<span class="emphasis"><em>&#12354;&#12426;&#12414;&#12379;&#12435;</em></span>&#12290;
    </p></li></ul></div><p>
   '<code class="constant">-1</code>'&#12399;&#29305;&#27530;&#12391;&#12289;&#12381;&#12398;&#12473;&#12452;&#12483;&#12481;&#12364;&#20837;&#21147;&#12501;&#12449;&#12452;&#12523;&#12363;&#12425;&#35501;&#12415;&#36796;&#12414;&#12428;&#12427;&#20840;&#12390;&#12398;&#12488;&#12521;&#12483;&#12463;&#12395;&#36969;&#29992;&#12373;&#12428;&#12427;&#12371;&#12392;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;
  </p><p>
   &#12488;&#12521;&#12483;&#12463;ID&#12434;&#20351;&#29992;&#12377;&#12427;&#12458;&#12503;&#12471;&#12519;&#12531;&#12398;&#35500;&#26126;&#12395;&#12399;&#12289;'<code class="literal">TID</code>'&#12364;&#21547;&#12414;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;&#12414;&#12383;&#12289;<code class="option">--atracks</code>&#12289;<code class="option">--vtracks</code>&#12289;<code class="option">--stracks</code>&#21450;&#12403;<code class="option">--btracks</code>&#12458;&#12503;&#12471;&#12519;&#12531;&#12418;&#12488;&#12521;&#12483;&#12463;ID&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;
  </p></div><div class="refsect1" title="&#12486;&#12461;&#12473;&#12488;&#12501;&#12449;&#12452;&#12523;&#12392;&#25991;&#23383;&#12467;&#12540;&#12489;&#22793;&#25563;"><a name="mkvmerge.text_files_and_charsets"></a><h2>&#12486;&#12461;&#12473;&#12488;&#12501;&#12449;&#12452;&#12523;&#12392;&#25991;&#23383;&#12467;&#12540;&#12489;&#22793;&#25563;</h2><div class="note" title="&#27880;&#35352;" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">&#27880;&#35352;</h3><p>
    &#12371;&#12398;&#12475;&#12463;&#12471;&#12519;&#12531;&#12399;&#12289;&#26263;&#40665;&#12398;&#12358;&#12385;&#12395;<span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12384;&#12369;&#12391;&#12394;&#12367;MKVToolNix&#12398;&#20840;&#12390;&#12398;&#12503;&#12525;&#12464;&#12521;&#12512;&#12395;&#12354;&#12390;&#12399;&#12414;&#12426;&#12414;&#12377;&#12290;
   </p></div><p>
   <span class="productname">Matroska</span>&#8482;&#12501;&#12449;&#12452;&#12523;&#12395;&#26684;&#32013;&#12373;&#12428;&#12390;&#12356;&#12427;&#12486;&#12461;&#12473;&#12488;&#12398;&#25991;&#23383;&#12467;&#12540;&#12489;&#12399;&#20840;&#12390;UTF-8&#12391;&#12377;&#12290;&#12424;&#12387;&#12390;&#12289;<span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12364;&#12486;&#12461;&#12473;&#12488;&#12501;&#12449;&#12452;&#12523;&#12434;&#35501;&#12415;&#36796;&#12416;&#38555;&#12395;&#12399;&#20840;&#12390;&#12434;UTF-8&#12395;&#25991;&#23383;&#12467;&#12540;&#12489;&#22793;&#25563;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#20195;&#12431;&#12426;&#12395;&#12289;<span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12364;&#20363;&#12360;&#12400;<a class="link" href="#mkvmerge.description.ui_language"><code class="option">--ui-language</code></a>&#12395;&#12424;&#12387;&#12390;&#38750;&#33521;&#35486;&#32763;&#35379;&#12364;&#20351;&#29992;&#12373;&#12428;&#12427;&#38555;&#12420;&#12289;<span class="productname">Matroska</span>&#8482;&#12501;&#12449;&#12452;&#12523;&#12395;&#26684;&#32013;&#12373;&#12428;&#12390;&#12356;&#12383;&#12486;&#12461;&#12473;&#12488;&#12434;&#20986;&#21147;&#12377;&#12427;&#38555;&#12395;&#12399;&#12289;UTF-8&#12363;&#12425;&#25351;&#23450;&#12373;&#12428;&#12383;&#25991;&#23383;&#12467;&#12540;&#12489;&#12395;&#22793;&#25563;&#12377;&#12428;&#12400;&#12424;&#12356;&#12392;&#12356;&#12358;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  </p><p>
   <span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12399;&#12371;&#12398;&#22793;&#25563;&#12434;<span class="foreignphrase"><em class="foreignphrase">&#12496;&#12452;&#12488;&#12539;&#12458;&#12540;&#12480;&#12540;&#12539;&#12510;&#12540;&#12463;</em></span>(<abbr class="abbrev">BOM</abbr>)&#12398;&#26377;&#28961;&#12289;&#21448;&#12399;&#12471;&#12473;&#12486;&#12512;&#12398;&#12525;&#12465;&#12540;&#12523;&#12395;&#22522;&#12389;&#12356;&#12390;&#33258;&#21205;&#30340;&#12395;&#34892;&#12394;&#12356;&#12414;&#12377;&#12290;&#12525;&#12465;&#12540;&#12523;&#12363;&#12425;&#12393;&#12398;&#12424;&#12358;&#12395;&#25991;&#23383;&#12467;&#12540;&#12489;&#12364;&#25512;&#28204;&#12373;&#12428;&#12427;&#12363;&#12399;&#12289;<span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12434;&#23455;&#34892;&#12377;&#12427;&#12471;&#12473;&#12486;&#12512;&#12395;&#20381;&#23384;&#12375;&#12414;&#12377;&#12290;
  </p><p>
   BOM&#12391;&#22987;&#12414;&#12427;&#12486;&#12461;&#12473;&#12488;&#12501;&#12449;&#12452;&#12523;&#12399;&#12289;&#26082;&#12395;UTF&#12456;&#12531;&#12467;&#12540;&#12487;&#12451;&#12531;&#12464;&#12398;&#19968;&#31278;&#12391;&#12456;&#12531;&#12467;&#12540;&#12489;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;<span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12399;UTF-8&#12289;UTF-16&#12522;&#12488;&#12523;&#12456;&#12531;&#12487;&#12451;&#12450;&#12531;&#21450;&#12403;&#12499;&#12483;&#12464;&#12456;&#12531;&#12487;&#12451;&#12450;&#12531;&#12289;UTF-32&#12522;&#12488;&#12523;&#12456;&#12531;&#12487;&#12451;&#12450;&#12531;&#21450;&#12403;&#12499;&#12483;&#12464;&#12456;&#12531;&#12487;&#12451;&#12450;&#12531;&#12398;&#20116;&#12388;&#12398;&#12514;&#12540;&#12489;&#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12414;&#12377;&#12290;BOM&#12391;&#22987;&#12414;&#12427;&#12486;&#12461;&#12473;&#12488;&#12501;&#12449;&#12452;&#12523;&#12399;&#33258;&#21205;&#30340;&#12395;UTF-8&#12395;&#22793;&#25563;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#22580;&#21512;&#12289;&#12486;&#12461;&#12473;&#12488;&#12501;&#12449;&#12452;&#12523;&#12398;&#25991;&#23383;&#12467;&#12540;&#12489;&#12434;&#25351;&#23450;&#12377;&#12427;&#12497;&#12521;&#12513;&#12540;&#12479;(&#20363;:
<a class="link" href="#mkvmerge.description.sub_charset"><code class="option">--sub-charset</code></a>)&#12399;&#20840;&#12390;&#40665;&#27578;&#12373;&#12428;&#12414;&#12377;&#12290;
  </p><p>
   UNIX&#31995;&#12471;&#12473;&#12486;&#12512;&#19978;&#12391;&#12399;&#12289;<span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12399;<span class="citerefentry"><span class="refentrytitle">setlocale</span>(3)</span>&#12471;&#12473;&#12486;&#12512;&#12467;&#12540;&#12523;&#12434;&#20351;&#12358;&#12398;&#12391;&#12289;<code class="varname">LANG</code>&#12289;<code class="varname">LC_ALL</code>&#21450;&#12403;<code class="varname">LC_CYPE</code>&#29872;&#22659;&#22793;&#25968;&#12434;&#20351;&#29992;&#12377;&#12427;&#12290;&#22823;&#25269;&#12399;&#12289;UTF-8&#12363;ISO-8859-*&#12501;&#12449;&#12511;&#12522;&#12398;&#12393;&#12428;&#12363;&#12364;&#20840;&#12390;&#12398;&#12486;&#12461;&#12473;&#12488;&#12501;&#12449;&#12452;&#12523;&#12392;&#12467;&#12510;&#12531;&#12489;&#12521;&#12452;&#12531;&#25991;&#23383;&#21015;&#12398;&#20966;&#29702;&#12289;&#21450;&#12403;&#12467;&#12531;&#12477;&#12540;&#12523;&#12408;&#12398;&#20986;&#21147;&#12398;&#25991;&#23383;&#12467;&#12540;&#12489;&#12392;&#12375;&#12390;&#20351;&#29992;&#12373;&#12428;&#12427;&#12290;
  </p><p>
   Windows&#12391;&#12399;&#12289;<span class="command"><strong>cmd.exe</strong></span>Windows&#12471;&#12455;&#12523;&#12503;&#12525;&#12464;&#12521;&#12512;&#12398;&#23455;&#35013;&#26041;&#24335;&#12398;&#12383;&#12417;&#12395;&#12289;<span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12399;&#20108;&#12388;&#12398;&#30064;&#12394;&#12427;&#25991;&#23383;&#12467;&#12540;&#12489;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;&#19968;&#12388;&#30446;&#12399;<code class="function">GetCP()</code>&#12471;&#12473;&#12486;&#12512;&#12467;&#12540;&#12523;&#12395;&#12424;&#12387;&#12390;&#27770;&#23450;&#12373;&#12428;&#12427;&#25991;&#23383;&#12467;&#12540;&#12489;&#12391;&#12377;&#12290;&#12371;&#12398;&#25991;&#23383;&#12467;&#12540;&#12489;&#12399;&#12486;&#12461;&#12473;&#12488;&#12501;&#12449;&#12452;&#12523;&#22793;&#25563;&#12395;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#20351;&#29992;&#12373;&#12428;&#12289;MKVToolNix&#12497;&#12483;&#12465;&#12540;&#12472;&#12395;&#21547;&#12414;&#12428;&#12427;<abbr class="abbrev">GUI</abbr>&#12503;&#12525;&#12464;&#12521;&#12512;&#12391;&#34920;&#31034;&#12373;&#12428;&#12427;&#20840;&#12390;&#12398;&#25991;&#23383;&#21015;&#12395;&#36969;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;<span class="command"><strong>cmd.exe</strong></span>&#12399;&#12418;&#12358;&#19968;&#12388;&#12398;&#12289;<code class="function">GetACP()</code>&#12471;&#12473;&#12486;&#12512;&#12467;&#12540;&#12523;&#12395;&#12424;&#12426;&#27770;&#23450;&#12373;&#12428;&#12427;&#25991;&#23383;&#12467;&#12540;&#12489;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;&#12371;&#12428;&#12399;&#12467;&#12510;&#12531;&#12489;&#12521;&#12452;&#12531;&#25991;&#23383;&#21015;&#21450;&#12403;&#12467;&#12531;&#12477;&#12540;&#12523;&#12408;&#12398;&#20986;&#21147;&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#25991;&#23383;&#12467;&#12540;&#12489;&#12391;&#12377;&#12290;
  </p><p>
   &#27425;&#12398;&#12424;&#12358;&#12394;&#25991;&#23383;&#12467;&#12540;&#12489;&#12434;&#25351;&#23450;&#12377;&#12427;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  </p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p>
     <a class="link" href="#mkvmerge.description.sub_charset"><code class="option">--sub-charset</code></a>&#12399;&#12289;&#12486;&#12461;&#12473;&#12488;&#23383;&#24149;&#12501;&#12449;&#12452;&#12523;&#12398;&#25991;&#23383;&#12467;&#12540;&#12489;&#12392;&#12289;&#20182;&#12398;&#12467;&#12531;&#12486;&#12490;&#12395;&#26684;&#32013;&#12373;&#12428;&#12383;&#12486;&#12461;&#12473;&#12488;&#23383;&#24149;&#12488;&#12521;&#12483;&#12463;&#12398;&#25991;&#23383;&#12467;&#12540;&#12489;&#12364;&#26326;&#26151;&#12373;&#12394;&#12367;&#27770;&#23450;&#12391;&#12365;&#12394;&#12356;&#22580;&#21512;(&#20363;:
Ogg&#12501;&#12449;&#12452;&#12523;)&#12398;&#25991;&#23383;&#12467;&#12540;&#12489;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;
    </p></li><li class="listitem"><p>
     <a class="link" href="#mkvmerge.description.chapter_charset"><code class="option">--chapter-charset</code></a>&#12399;&#12289;&#12481;&#12515;&#12503;&#12479;&#12486;&#12461;&#12473;&#12488;&#12501;&#12449;&#12452;&#12523;&#12398;&#25991;&#23383;&#12467;&#12540;&#12489;&#12392;&#12289;&#20182;&#12398;&#12467;&#12531;&#12486;&#12490;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12395;&#26684;&#32013;&#12373;&#12428;&#12390;&#12356;&#12427;&#12481;&#12515;&#12503;&#12479;&#21450;&#12403;&#12479;&#12452;&#12488;&#12523;&#12398;&#25991;&#23383;&#12467;&#12540;&#12489;&#12434;&#26326;&#26151;&#12373;&#12394;&#12367;&#27770;&#23450;&#12391;&#12365;&#12394;&#12356;&#22580;&#21512;(&#20363;:
Ogg&#12501;&#12449;&#12452;&#12523;&#12398;&#12481;&#12515;&#12503;&#12479;&#24773;&#22577;&#12289;&#12488;&#12521;&#12483;&#12463;&#12392;&#12501;&#12449;&#12452;&#12523;&#12398;&#12479;&#12452;&#12488;&#12523;&#31561;&#12289;&#21450;&#12403;MP4&#12501;&#12449;&#12452;&#12523;&#12398;&#12481;&#12515;&#12503;&#12479;&#24773;&#22577;)&#12398;&#25991;&#23383;&#12467;&#12540;&#12489;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;
    </p></li><li class="listitem"><p>
     <a class="link" href="#mkvmerge.description.command_line_charset"><code class="option">--command-line-charset</code></a>&#12399;&#20840;&#12390;&#12398;&#12467;&#12510;&#12531;&#12489;&#12521;&#12452;&#12531;&#25991;&#23383;&#21015;&#12398;&#25991;&#23383;&#12467;&#12540;&#12489;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;
    </p></li><li class="listitem"><p>
     <a class="link" href="#mkvmerge.description.output_charset"><code class="option">--output-charset</code></a>&#12399;&#12467;&#12531;&#12477;&#12540;&#12523;&#12395;&#20986;&#21147;&#12373;&#12428;&#12427;&#25991;&#23383;&#21015;&#12398;&#25991;&#23383;&#12467;&#12540;&#12489;&#21450;&#12403;&#12289;<a class="link" href="#mkvmerge.description.redirect_output"><code class="option">--redirect-output</code></a>&#12458;&#12503;&#12471;&#12519;&#12531;&#12395;&#12424;&#12426;&#12501;&#12449;&#12452;&#12523;&#12395;&#20986;&#21147;&#12364;&#12522;&#12480;&#12452;&#12524;&#12463;&#12488;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#12381;&#12398;&#12501;&#12449;&#12452;&#12523;&#12398;&#25991;&#23383;&#21015;&#12398;&#25991;&#23383;&#12467;&#12540;&#12489;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;
    </p></li></ul></div></div><div class="refsect1" title="&#23383;&#24149;"><a name="mkvmerge.subtitles"></a><h2>&#23383;&#24149;</h2><p>
   <span class="productname">Matroska</span>&#8482;&#12395;&#12399;&#12289;&#12356;&#12367;&#12388;&#12363;&#23383;&#24149;&#12398;&#22475;&#12417;&#36796;&#12415;&#26041;&#27861;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#29694;&#26178;&#28857;&#12391;&#12399;&#12289;<span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12399;&#12486;&#12461;&#12473;&#12488;&#12289;VobSub&#12289;&#21450;&#12403;Kate&#23383;&#24149;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12398;&#12415;&#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;&#12486;&#12461;&#12473;&#12488;&#23383;&#24149;&#12399;&#12289;&#12503;&#12524;&#12452;&#12516;&#12540;&#12391;&#27491;&#12375;&#12367;&#34920;&#31034;&#12373;&#12428;&#12427;&#12383;&#12417;&#12395;UTF-8&#12391;&#20445;&#23384;&#12373;&#12428;&#12394;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;(<span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12398;&#25991;&#23383;&#12467;&#12540;&#12489;&#22793;&#25563;&#12395;&#12388;&#12356;&#12390;&#12399;<a class="link" href="#mkvmerge.text_files_and_charsets" title="&#12486;&#12461;&#12473;&#12488;&#12501;&#12449;&#12452;&#12523;&#12392;&#25991;&#23383;&#12467;&#12540;&#12489;&#22793;&#25563;">&#12486;&#12461;&#12473;&#12488;&#12501;&#12449;&#12452;&#12523;&#12392;&#25991;&#23383;&#12467;&#12540;&#12489;</a>&#12398;&#12475;&#12463;&#12471;&#12519;&#12531;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;)&#12290;Kate&#23383;&#24149;&#12399;&#26082;&#12395;UTF-8&#12391;&#12456;&#12531;&#12467;&#12540;&#12489;&#12373;&#12428;&#12390;&#12356;&#12427;&#12398;&#12391;&#12289;&#20877;&#22793;&#25563;&#12377;&#12427;&#24517;&#35201;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  </p><p>
   &#29694;&#22312;&#12289;&#27425;&#12398;&#23383;&#24149;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12364;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
  </p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p>
     SubRip&#12486;&#12461;&#12473;&#12488;&#23383;&#24149;&#24418;&#24335;(SRT)&#12501;&#12449;&#12452;&#12523;
    </p></li><li class="listitem"><p>
     Substation Alpha (SSA) / Advanced Substation (ASS) &#23383;&#24149;
    </p></li><li class="listitem"><p>
     OggKate&#12473;&#12488;&#12522;&#12540;&#12512;
    </p></li><li class="listitem"><p>
     VobSub&#12499;&#12483;&#12488;&#12510;&#12483;&#12503;&#23383;&#24149;
    </p></li></ul></div></div><div class="refsect1" title="&#12501;&#12449;&#12452;&#12523;&#32016;&#20184;&#12369;"><a name="mkvmerge.file_linking"></a><h2>&#12501;&#12449;&#12452;&#12523;&#32016;&#20184;&#12369;</h2><p>
   <span class="productname">Matroska</span>&#8482;&#12399;&#12501;&#12449;&#12452;&#12523;&#32016;&#20184;&#12369;&#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12414;&#12377;&#12290;&#12501;&#12449;&#12452;&#12523;&#32016;&#20184;&#12369;&#12392;&#12399;&#12289;&#21336;&#32020;&#12395;&#29694;&#22312;&#12398;&#12501;&#12449;&#12452;&#12523;&#12398;&#21069;&#12398;&#12289;&#21448;&#12399;&#27425;&#12398;&#12501;&#12449;&#12452;&#12523;&#12434;&#25351;&#23450;&#12377;&#12427;&#27231;&#33021;&#12391;&#12377;&#12290;&#27491;&#30906;&#12395;&#35328;&#12358;&#12392;&#12289;&#26412;&#24403;&#12395;&#32016;&#20184;&#12369;&#12373;&#12428;&#12427;&#12398;&#12399;&#12501;&#12449;&#12452;&#12523;&#12391;&#12399;&#12394;&#12367;<span class="productname">Matroska</span>&#8482;&#12475;&#12464;&#12513;&#12531;&#12488;&#12391;&#12377;&#12290;&#12411;&#12392;&#12435;&#12393;&#12398;&#12501;&#12449;&#12452;&#12523;&#12399;<span class="productname">Matroska</span>&#8482;&#12475;&#12464;&#12513;&#12531;&#12488;&#12434;&#19968;&#12388;&#12375;&#12363;&#25345;&#12383;&#12394;&#12356;&#12398;&#12391;&#12289;&#20197;&#38477;&#12398;&#35500;&#26126;&#12391;&#12399;&#12424;&#12426;&#27491;&#30906;&#12394;'&#12475;&#12464;&#12513;&#12531;&#12488;&#32016;&#20184;&#12369;'&#12392;&#12356;&#12358;&#29992;&#35486;&#12391;&#12399;&#12394;&#12367;&#12289;'&#12501;&#12449;&#12452;&#12523;&#32016;&#20184;&#12369;'&#12392;&#12356;&#12358;&#29992;&#35486;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;
  </p><p>
   &#21508;&#12475;&#12464;&#12513;&#12531;&#12488;&#12399;&#12518;&#12491;&#12540;&#12463;&#12394;128bit&#24133;&#12398;&#12475;&#12464;&#12513;&#12531;&#12488;UID&#12434;&#25345;&#12385;&#12414;&#12377;&#12290;&#12371;&#12398;UID&#12399;<span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12364;&#33258;&#21205;&#30340;&#12395;&#29983;&#25104;&#12375;&#12414;&#12377;&#12290;&#32016;&#20184;&#12369;&#12399;&#22522;&#26412;&#30340;&#12395;&#12475;&#12464;&#12513;&#12531;&#12488;UID(&#30053;&#12375;&#12390;<abbr class="abbrev">SID</abbr>)&#12434;&#12504;&#12483;&#12480;&#24773;&#22577;&#12398;&#20013;&#12395;&#25407;&#20837;&#12377;&#12427;&#12371;&#12392;&#12391;&#34892;&#12431;&#12428;&#12414;&#12377;&#12290;<span class="citerefentry"><span class="refentrytitle">mkvinfo</span>(1)</span>&#12399;&#12371;&#12398;<abbr class="abbrev">SID</abbr>&#12434;&#12289;&#23384;&#22312;&#12377;&#12427;&#22580;&#21512;&#12399;&#34920;&#31034;&#12375;&#12414;&#12377;&#12290;
  </p><p>
   &#12418;&#12375;&#12402;&#12392;&#12388;&#12398;&#12501;&#12449;&#12452;&#12523;&#12364;&#12356;&#12367;&#12388;&#12363;&#12398;&#23567;&#12373;&#12394;&#12501;&#12449;&#12452;&#12523;&#12395;&#20998;&#21106;&#12373;&#12428;&#12390;&#32016;&#20184;&#12369;&#12373;&#12428;&#12427;&#22580;&#21512;&#12289;&#12479;&#12452;&#12512;&#12467;&#12540;&#12489;&#12399;0&#12363;&#12425;&#22987;&#12414;&#12425;&#12378;&#12289;&#21069;&#12398;&#12501;&#12449;&#12452;&#12523;&#12398;&#32154;&#12365;&#12363;&#12425;&#22987;&#12414;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#26041;&#24335;&#12391;&#12399;&#12289;&#21069;&#12398;&#12501;&#12449;&#12452;&#12523;&#12364;&#28961;&#12356;&#22580;&#21512;&#12418;&#32118;&#23550;&#26178;&#38291;&#12364;&#20445;&#12383;&#12428;&#12414;&#12377;(&#20363;:
&#12473;&#12488;&#12522;&#12540;&#12511;&#12531;&#12464;&#12434;&#20351;&#29992;&#12375;&#12390;&#12356;&#12427;&#38555;)&#12290;&#12418;&#12375;&#12289;&#32016;&#20184;&#12369;&#12364;&#20351;&#29992;&#12373;&#12428;&#12394;&#12356;&#22580;&#21512;&#12289;&#12479;&#12452;&#12512;&#12467;&#12540;&#12489;&#12399;&#21508;&#12501;&#12449;&#12452;&#12523;&#12391;0&#12363;&#12425;&#22987;&#12414;&#12426;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;<span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12399;&#12501;&#12449;&#12452;&#12523;&#32016;&#20184;&#12369;&#12434;&#20351;&#29992;&#12375;&#12414;&#12379;&#12435;&#12290;&#12501;&#12449;&#12452;&#12523;&#32016;&#20184;&#12369;&#12434;&#20351;&#29992;&#12375;&#12383;&#12356;&#22580;&#21512;&#12399;&#12289;<code class="option">--link</code>&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#20351;&#29992;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12501;&#12449;&#12452;&#12523;&#20998;&#21106;&#12364;&#26377;&#21177;&#12394;&#22580;&#21512;&#20197;&#22806;&#12395;&#12399;&#28961;&#21177;&#12391;&#12377;&#12290;
  </p><p>
   &#12501;&#12449;&#12452;&#12523;&#20998;&#21106;&#12364;&#26377;&#21177;&#12363;&#28961;&#21177;&#12363;&#12395;&#38306;&#12431;&#12425;&#12378;&#12289;&#12518;&#12540;&#12470;&#12399;<span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12395;&#12289;&#29983;&#25104;&#12375;&#12383;&#12501;&#12449;&#12452;&#12523;&#12434;&#29305;&#23450;&#12398;<abbr class="abbrev">SID</abbr>&#12395;&#32016;&#20184;&#12369;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#12371;&#12428;&#12399;<code class="option">--link-to-previous</code>&#12458;&#12503;&#12471;&#12519;&#12531;&#12392;<code class="option">--link-to-next</code>&#12458;&#12503;&#12471;&#12519;&#12531;&#12395;&#12424;&#12426;&#21487;&#33021;&#12391;&#12377;&#12290;&#12371;&#12428;&#12425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;<span class="citerefentry"><span class="refentrytitle">mkvinfo</span>(1)</span>&#12364;&#20986;&#21147;&#12377;&#12427;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;(16&#20491;&#12398;<code class="constant">0x00</code>&#12363;&#12425;<code class="constant">0xff</code>&#12414;&#12391;&#12398;&#12289;'<code class="literal">0x</code>'&#12434;&#38957;&#12395;&#12388;&#12369;&#12383;16&#36914;&#25968;)&#12398;<abbr class="abbrev">SID</abbr>&#12434;&#21463;&#12369;&#20184;&#12369;&#12414;&#12377;(&#20363;:
'<code class="literal">0x41 0xda 0x73 0x66 0xd9 0xcf 0xb2 0x1e 0xae 0x78 0xeb 0xb4 0x5e
0xca 0xb3 0x93</code>')&#12290;&#12418;&#12375;&#12367;&#12399;&#12289;'<code class="literal">0x</code>'&#21450;&#12403;&#25968;&#23383;&#12398;&#38291;&#12398;&#12473;&#12506;&#12540;&#12473;&#12434;&#30465;&#12356;&#12383;&#30701;&#24418;&#24335;(&#20363;:
'<code class="literal">41da7366d9cfb21eae78ebb45ecab393</code>')&#12434;&#25351;&#23450;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;
  </p><p>
   &#12418;&#12375;&#12501;&#12449;&#12452;&#12523;&#20998;&#21106;&#12364;&#26377;&#21177;&#12398;&#22580;&#21512;&#12289;&#26368;&#21021;&#12398;&#12501;&#12449;&#12452;&#12523;&#12364;<code class="option">--link-to-previous</code>&#12458;&#12503;&#12471;&#12519;&#12531;&#12391;&#25351;&#23450;&#12375;&#12383;<abbr class="abbrev">SID</abbr>&#12395;&#32016;&#20184;&#12369;&#12373;&#12428;&#12289;&#26368;&#24460;&#12398;&#12501;&#12449;&#12452;&#12523;&#12364;<code class="option">--link-to-next</code>&#12458;&#12503;&#12471;&#12519;&#12531;&#12391;&#25351;&#23450;&#12375;&#12383;<abbr class="abbrev">SID</abbr>&#12395;&#32016;&#20184;&#12369;&#12373;&#12428;&#12414;&#12377;&#12290;&#12501;&#12449;&#12452;&#12523;&#20998;&#21106;&#12364;&#28961;&#21177;&#12398;&#22580;&#21512;&#12289;&#19968;&#12388;&#12398;&#20986;&#21147;&#12501;&#12449;&#12452;&#12523;&#12364;&#20001;&#26041;&#12398;<abbr class="abbrev">SID</abbr>&#12395;&#32016;&#20184;&#12369;&#12373;&#12428;&#12414;&#12377;&#12290;
  </p></div><div class="refsect1" title="&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;"><a name="mkvmerge.default_values"></a><h2>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;</h2><p>
   <span class="productname">Matroska</span>&#8482;&#12501;&#12449;&#12452;&#12523;&#12398;&#20181;&#27096;&#12395;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12434;&#25345;&#12388;&#12456;&#12524;&#12513;&#12531;&#12488;&#12398;&#23384;&#22312;&#12364;&#26126;&#35352;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;&#36890;&#24120;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12392;&#31561;&#12375;&#12356;&#20516;&#12434;&#12418;&#12388;&#12456;&#12524;&#12513;&#12531;&#12488;&#12399;&#12501;&#12449;&#12452;&#12523;&#12469;&#12452;&#12474;&#12434;&#25233;&#12360;&#12427;&#12383;&#12417;&#12501;&#12449;&#12452;&#12523;&#12395;&#26360;&#12365;&#36796;&#12414;&#12428;&#12414;&#12379;&#12435;&#12290;<span class="citerefentry"><span class="refentrytitle">mkvinfo</span>(1)</span>&#12391;&#12399;&#34920;&#31034;&#12373;&#12428;&#12394;&#12356;&#12363;&#12418;&#12375;&#12428;&#12394;&#12356;&#12456;&#12524;&#12513;&#12531;&#12488;&#12399;&#12289;<em class="parameter"><code>&#35328;&#35486;</code></em>&#12392;<em class="parameter"><code>&#12487;&#12501;&#12457;&#12523;&#12488;&#12488;&#12521;&#12483;&#12463;&#12501;&#12521;&#12464;</code></em>&#12456;&#12524;&#12513;&#12531;&#12488;&#12391;&#12377;&#12290;<em class="parameter"><code>&#35328;&#35486;</code></em>&#12456;&#12524;&#12513;&#12531;&#12488;&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;&#33521;&#35486;('<code class="literal">eng</code>')&#12391;&#12289;<em class="parameter"><code>&#12487;&#12501;&#12457;&#12523;&#12488;&#12488;&#12521;&#12483;&#12463;&#12501;&#12521;&#12464;</code></em>&#12456;&#12524;&#12513;&#12531;&#12488;&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;<em class="parameter"><code>true</code></em>&#12391;&#12377;&#12290;&#12424;&#12387;&#12390;&#12289;&#12354;&#12427;&#12488;&#12521;&#12483;&#12463;&#12395;<code class="option">--language:
0:eng</code>&#12434;&#25351;&#23450;&#12375;&#12383;&#22580;&#21512;&#12395;&#12399;&#12289;<span class="citerefentry"><span class="refentrytitle">mkvinfo</span>(1)</span>&#12398;&#20986;&#21147;&#12395;&#12399;&#29694;&#12428;&#12414;&#12379;&#12435;&#12290;
  </p></div><div class="refsect1" title="&#28155;&#20184;&#12501;&#12449;&#12452;&#12523;"><a name="mkvmerge.attachments"></a><h2>&#28155;&#20184;&#12501;&#12449;&#12452;&#12523;</h2><p>
   <span class="productname">Matroska</span>&#8482;&#12501;&#12449;&#12452;&#12523;&#12395;&#20889;&#30495;&#12434;&#20837;&#12428;&#12390;&#12362;&#12365;&#12383;&#12356;&#12392;&#12356;&#12358;&#12371;&#12392;&#12420;&#12289;&#38750;&#24120;&#12395;&#31232;&#12391;&#12375;&#12423;&#12358;&#12364;<abbr class="abbrev">SSA</abbr>&#23383;&#24149;&#12434;&#20351;&#12387;&#12390;&#12356;&#12390;<span class="productname">TrueType</span>&#8482;&#12501;&#12457;&#12531;&#12488;&#12434;&#20351;&#29992;&#12375;&#12383;&#12356;&#12392;&#12356;&#12358;&#12371;&#12392;&#12364;&#12354;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;&#12371;&#12398;&#12424;&#12358;&#12394;&#22580;&#21512;&#12395;&#12399;&#12289;<span class="productname">Matroska</span>&#8482;&#12501;&#12449;&#12452;&#12523;&#12395;&#12501;&#12449;&#12452;&#12523;&#12434;&#28155;&#20184;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#28155;&#20184;&#12373;&#12428;&#12427;&#12501;&#12449;&#12452;&#12523;&#12399;<span class="productname">Matroska</span>&#8482;&#12501;&#12449;&#12452;&#12523;&#12395;&#22475;&#12417;&#36796;&#12414;&#12428;&#12427;&#12398;&#12391;&#12399;&#12394;&#12367;&#12289;&#12383;&#12384;&#21336;&#32020;&#12395;&#36861;&#21152;&#12373;&#12428;&#12414;&#12377;&#12290;&#12424;&#12387;&#12390;&#12289;&#12503;&#12524;&#12452;&#12516;&#12540;&#12399;&#12371;&#12428;&#12425;&#12398;&#12501;&#12449;&#12452;&#12523;&#12434;&#34920;&#31034;&#12375;&#12383;&#12426;(&#20889;&#30495;&#12398;&#22580;&#21512;)&#12289;&#23383;&#24149;&#12434;&#25551;&#30011;&#12377;&#12427;&#12398;&#12395;&#20351;&#29992;&#12375;&#12383;&#12426;(&#12501;&#12457;&#12531;&#12488;&#12398;&#22580;&#21512;)&#12391;&#12365;&#12414;&#12377;&#12290;
  </p><p>
   &#19979;&#12395;&#12289;&#20986;&#21147;&#12501;&#12449;&#12452;&#12523;&#12395;&#20889;&#30495;&#12392;<span class="productname">TrueType</span>&#8482;&#12501;&#12457;&#12531;&#12488;&#12434;&#28155;&#20184;&#12377;&#12427;&#26041;&#27861;&#12398;&#20363;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;
  </p><pre class="screen">
$ mkvmerge -o output.mkv -A video.avi sound.ogg --attachment-description "Me and the band behind the stage in a small get-together" --attachment-mime-type image/jpeg --attach-file me_and_the_band.jpg --attachment-description "The real rare and unbelievably good looking font" --attachment-type application/octet-stream --attach-file really_cool_font.ttf
  </pre><p>
   &#12467;&#12510;&#12531;&#12489;&#12521;&#12452;&#12531;&#25991;&#23383;&#21015;&#12398;&#25991;&#23383;&#12467;&#12540;&#12489;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12399;&#12289;&#12471;&#12473;&#12486;&#12512;&#12398;&#29694;&#22312;&#12398;&#12525;&#12465;&#12540;&#12523;&#12398;&#25991;&#23383;&#12467;&#12540;&#12489;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#35373;&#23450;&#12399;<a class="link" href="#mkvmerge.description.title"><code class="option">--title</code></a>&#12289;<a class="link" href="#mkvmerge.description.track_name"><code class="option">--track-name</code></a>&#12289;&#21450;&#12403;<a class="link" href="#mkvmerge.description.attachment_description"><code class="option">--attachment-description</code></a>&#12398;&#19977;&#12388;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12398;&#24341;&#25968;&#12395;&#24433;&#38911;&#12375;&#12414;&#12377;&#12290;
  </p></div><div class="refsect1" title="&#12481;&#12515;&#12503;&#12479;"><a name="mkvmerge.chapters"></a><h2>&#12481;&#12515;&#12503;&#12479;</h2><p>
   <span class="productname">Matroska</span>&#8482;&#12481;&#12515;&#12503;&#12479;&#12471;&#12473;&#12486;&#12512;&#12399;&#12289;<abbr class="abbrev">OGM</abbr>&#12501;&#12449;&#12452;&#12523;&#12391;&#20351;&#29992;&#12373;&#12428;&#12390;&#12356;&#12383;&#24467;&#26469;&#12398;&#12471;&#12473;&#12486;&#12512;&#12424;&#12426;&#24375;&#21147;&#12391;&#12377;&#12290;&#12381;&#12398;&#20181;&#27096;&#12398;&#20840;&#12390;&#12399;&#12289;<a class="ulink" href="http://www.matroska.org" target="_top"><span class="productname">Matroska</span>&#8482;&#12398;&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;</a>&#12395;&#35352;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
  </p><p>
   <span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12399;2&#31278;&#39006;&#12398;&#12481;&#12515;&#12503;&#12479;&#12501;&#12449;&#12452;&#12523;&#12434;&#20837;&#21147;&#12392;&#12375;&#12390;&#12469;&#12509;&#12540;&#12488;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;&#19968;&#12388;&#30446;&#12399;'<span class="foreignphrase"><em class="foreignphrase">&#12471;&#12531;&#12503;&#12523;&#12481;&#12515;&#12503;&#12479;&#12501;&#12449;&#12452;&#12523;</em></span>'&#12392;&#21628;&#12400;&#12428;&#12427;&#12418;&#12398;&#12391;&#12289;<abbr class="abbrev">OGM</abbr>
tools&#12364;&#24819;&#23450;&#12375;&#12390;&#12356;&#12427;&#12418;&#12398;&#12392;&#21516;&#12376;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12391;&#12377;&#12290;&#20108;&#12388;&#30446;&#12399;<abbr class="abbrev">XML</abbr>&#12505;&#12540;&#12473;&#12398;&#12481;&#12515;&#12503;&#12479;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12391;&#12289;<span class="productname">Matroska</span>&#8482;&#12398;&#12481;&#12515;&#12503;&#12479;&#27231;&#33021;&#12398;&#20840;&#12390;&#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
  </p><div class="refsect2" title="&#12471;&#12531;&#12503;&#12523;&#12481;&#12515;&#12503;&#12479;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;"><a name="id327197"></a><h3>&#12471;&#12531;&#12503;&#12523;&#12481;&#12515;&#12503;&#12479;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;</h3><p>
    &#12371;&#12398;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12399;&#12289;'<code class="literal">CHAPTERxx=</code>'&#12391;&#22987;&#12414;&#12427;&#34892;&#12392;'<code class="literal">ChapterxxNAME=</code>'&#12391;&#22987;&#12414;&#12427;&#34892;&#12398;&#12506;&#12450;&#12363;&#12425;&#25104;&#12426;&#12414;&#12377;&#12290;&#21069;&#32773;&#12398;&#34892;&#12399;&#38283;&#22987;&#12479;&#12452;&#12512;&#12467;&#12540;&#12489;&#12434;&#21547;&#12415;&#12289;&#24460;&#32773;&#12399;&#12479;&#12452;&#12488;&#12523;&#12434;&#21547;&#12415;&#12414;&#12377;&#12290;&#19979;&#12395;&#20363;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;
   </p><pre class="screen">
CHAPTER01=00:00:00.000
CHAPTER01NAME=Intro
CHAPTER02=00:02:30.000
CHAPTER02NAME=Baby prepares to rock
CHAPTER03=00:02:42.300
CHAPTER03NAME=Baby rocks the house
   </pre><p>
    <span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12399;&#21508;&#12506;&#12450;&#12289;&#12418;&#12375;&#12367;&#12399;&#34892;&#12434;&#12289;&#19968;&#20491;&#12398;<span class="productname">Matroska</span>&#8482;<code class="classname">ChapterAtom</code>&#12395;&#22793;&#25563;&#12375;&#12414;&#12377;&#12290;<code class="classname">ChapterTrackNumber</code>&#12399;&#35373;&#23450;&#12375;&#12394;&#12356;&#12398;&#12391;&#12289;&#20840;&#12390;&#12398;&#12488;&#12521;&#12483;&#12463;&#12395;&#12481;&#12515;&#12503;&#12479;&#12399;&#36969;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;
   </p><p>
    &#12371;&#12398;&#12392;&#12365;&#12395;&#12486;&#12461;&#12473;&#12488;&#12501;&#12449;&#12452;&#12523;&#12398;&#25991;&#23383;&#12467;&#12540;&#12489;&#12364;&#24517;&#35201;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;<span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12398;&#25991;&#23383;&#12467;&#12540;&#12489;&#22793;&#25563;&#12395;&#12388;&#12356;&#12390;&#12399;<a class="link" href="#mkvmerge.text_files_and_charsets" title="&#12486;&#12461;&#12473;&#12488;&#12501;&#12449;&#12452;&#12523;&#12392;&#25991;&#23383;&#12467;&#12540;&#12489;&#22793;&#25563;">&#12486;&#12461;&#12473;&#12488;&#12501;&#12449;&#12452;&#12523;&#12392;&#25991;&#23383;&#12467;&#12540;&#12489;</a>&#12398;&#12475;&#12463;&#12471;&#12519;&#12531;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
   </p></div><div class="refsect2" title="XML&#12481;&#12515;&#12503;&#12479;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;"><a name="id327265"></a><h3><abbr class="abbrev">XML</abbr>&#12481;&#12515;&#12503;&#12479;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;</h3><p>
    <abbr class="abbrev">XML</abbr>&#12481;&#12515;&#12503;&#12479;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12398;&#20363;&#12434;&#20197;&#19979;&#12395;&#31034;&#12375;&#12414;&#12377;&#12290;
   </p><pre class="screen">
&lt;?xml version="1.0" encoding="ISO-8859-1"?&gt;
&lt;!DOCTYPE Chapters SYSTEM "matroskachapters.dtd"&gt;
&lt;Chapters&gt;
  &lt;EditionEntry&gt;
    &lt;ChapterAtom&gt;
      &lt;ChapterTimeStart&gt;00:00:30.000&lt;/ChapterTimeStart&gt;
      &lt;ChapterTimeEnd&gt;00:01:20.000&lt;/ChapterTimeEnd&gt;
      &lt;ChapterDisplay&gt;
        &lt;ChapterString&gt;A short chapter&lt;/ChapterString&gt;
        &lt;ChapterLanguage&gt;eng&lt;/ChapterLanguage&gt;
      &lt;/ChapterDisplay&gt;
      &lt;ChapterAtom&gt;
        &lt;ChapterTimeStart&gt;00:00:46.000&lt;/ChapterTimeStart&gt;
        &lt;ChapterTimeEnd&gt;00:01:10.000&lt;/ChapterTimeEnd&gt;
        &lt;ChapterDisplay&gt;
          &lt;ChapterString&gt;A part of that short chapter&lt;/ChapterString&gt;
          &lt;ChapterLanguage&gt;eng&lt;/ChapterLanguage&gt;
        &lt;/ChapterDisplay&gt;
      &lt;/ChapterAtom&gt;
    &lt;/ChapterAtom&gt;
  &lt;/EditionEntry&gt;
&lt;/Chapters&gt;
   </pre><p>
    &#12371;&#12398;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12391;&#12399;&#12289;&#12471;&#12531;&#12503;&#12523;&#12481;&#12515;&#12503;&#12479;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12391;&#12399;&#19981;&#21487;&#33021;&#12394;&#12289;3&#12388;&#12398;&#12371;&#12392;&#12364;&#21487;&#33021;&#12391;&#12377;&#12290;
   </p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>&#12481;&#12515;&#12503;&#12479;&#12398;&#32066;&#20102;&#12479;&#12452;&#12512;&#12467;&#12540;&#12489;&#12434;&#25351;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;</p></li><li class="listitem"><p>&#12493;&#12473;&#12488;&#12375;&#12383;&#12481;&#12515;&#12503;&#12479;&#12434;&#20316;&#25104;&#12391;&#12365;&#12414;&#12377;&#12290;</p></li><li class="listitem"><p>&#35328;&#35486;&#21450;&#12403;&#22269;&#12434;&#35373;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;</p></li></ol></div><p>
    mkvtoolnix&#12399;&#12289;&#12486;&#12531;&#12503;&#12524;&#12540;&#12488;&#12392;&#12394;&#12427;&#12469;&#12531;&#12503;&#12523;&#12501;&#12449;&#12452;&#12523;&#12392;&#19968;&#32210;&#12395;&#37197;&#24067;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;&#12469;&#12531;&#12503;&#12523;&#12501;&#12449;&#12452;&#12523;&#12399;<code class="filename">doc</code>&#12469;&#12502;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12398;&#20013;&#12395;&#12354;&#12426;&#12414;&#12377;&#12290;
   </p></div><div class="refsect2" title="&#27880;&#24847;"><a name="id327330"></a><h3>&#27880;&#24847;</h3><p>
    <span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12399;&#20986;&#21147;&#12501;&#12449;&#12452;&#12523;&#12434;&#20998;&#21106;&#12377;&#12427;&#38555;&#12289;&#12481;&#12515;&#12503;&#12479;&#12418;&#36969;&#20999;&#12395;&#20966;&#29702;&#12375;&#12414;&#12377;&#12290;&#12388;&#12414;&#12426;&#12289;&#20998;&#21106;&#12373;&#12428;&#12383;&#21508;&#12501;&#12449;&#12452;&#12523;&#12399;&#12381;&#12398;&#12501;&#12449;&#12452;&#12523;&#12395;&#38306;&#20418;&#12377;&#12427;&#12481;&#12515;&#12503;&#12479;&#12398;&#12415;&#12434;&#21547;&#12415;&#12289;&#12479;&#12452;&#12512;&#12467;&#12540;&#12489;&#12395;&#12399;&#36969;&#20999;&#12394;&#12458;&#12501;&#12475;&#12483;&#12488;&#12364;&#12363;&#12363;&#12426;&#12414;&#12377;&#12290;
   </p><p>
    <span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12399;&#12289;<a class="link" href="#mkvmerge.description.no_chapters"><code class="option">--no-chapters</code></a>&#12458;&#12503;&#12471;&#12519;&#12531;&#12391;&#26126;&#31034;&#30340;&#12395;&#28961;&#21177;&#21270;&#12373;&#12428;&#12390;&#12356;&#12394;&#12369;&#12428;&#12400;&#12289;<span class="productname">Matroska</span>&#8482;&#12477;&#12540;&#12473;&#12501;&#12449;&#12452;&#12523;&#12363;&#12425;&#12481;&#12515;&#12503;&#12479;&#12434;&#12467;&#12500;&#12540;&#12391;&#12365;&#12414;&#12377;&#12290;&#20840;&#12390;&#12398;&#12477;&#12540;&#12473;(<span class="productname">Matroska</span>&#8482;&#12501;&#12449;&#12452;&#12523;&#12289;Ogg&#12501;&#12449;&#12452;&#12523;&#12289;<abbr class="abbrev">MP4</abbr>&#12501;&#12449;&#12452;&#12523;&#12289;&#12481;&#12515;&#12503;&#12479;&#12486;&#12461;&#12473;&#12488;&#12501;&#12449;&#12452;&#12523;)&#12395;&#30001;&#26469;&#12377;&#12427;&#12481;&#12515;&#12503;&#12479;&#12399;&#36890;&#24120;&#12399;&#12510;&#12540;&#12472;&#12373;&#12428;&#12378;&#12289;&#21029;&#12293;&#12398;<code class="classname">ChapterEditions</code>&#12364;&#20316;&#25104;&#12373;&#12428;&#12414;&#12377;&#12290;&#12356;&#12367;&#12388;&#12363;&#12398;<span class="productname">Matroska</span>&#8482;&#12418;&#12375;&#12367;&#12399;<abbr class="abbrev">XML</abbr>&#12501;&#12449;&#12452;&#12523;&#12391;&#12289;&#12456;&#12487;&#12451;&#12471;&#12519;&#12531;UID&#12364;&#20849;&#26377;&#12373;&#12428;&#12427;&#22580;&#21512;&#12395;&#12398;&#12415;&#12289;&#12481;&#12515;&#12503;&#12479;&#12399;&#19968;&#12388;&#12398;<code class="classname">ChapterEdition</code>&#12395;&#12510;&#12540;&#12472;&#12373;&#12428;&#12414;&#12377;&#12290;&#12381;&#12398;&#12424;&#12358;&#12394;&#22580;&#21512;&#20197;&#22806;&#12391;&#12510;&#12540;&#12472;&#12434;&#34892;&#12356;&#12383;&#12356;&#22580;&#21512;&#12399;&#12289;&#12518;&#12540;&#12470;&#12399;&#12414;&#12378;&#20840;&#12390;&#12398;&#12477;&#12540;&#12473;&#12363;&#12425;<span class="citerefentry"><span class="refentrytitle">mkvextract</span>(1)</span>&#12391;&#12481;&#12515;&#12503;&#12479;&#12434;&#25277;&#20986;&#12375;&#12289;&#25163;&#21205;&#12391;<abbr class="abbrev">XML</abbr>&#12501;&#12449;&#12452;&#12523;&#12434;&#12510;&#12540;&#12472;&#12375;&#12383;&#24460;&#12395;MUX&#12434;&#34892;&#12394;&#12431;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
   </p></div></div><div class="refsect1" title="&#12479;&#12464;"><a name="mkvmerge.tags"></a><h2>&#12479;&#12464;</h2><div class="refsect2" title="&#12399;&#12376;&#12417;&#12395;"><a name="id327416"></a><h3>&#12399;&#12376;&#12417;&#12395;</h3><p>
    <span class="productname">Matroska</span>&#8482;&#12399;&#24259;&#27490;&#20104;&#23450;&#12398;&#25313;&#24373;&#21487;&#33021;&#12394;&#12479;&#12464;&#12398;&#12475;&#12483;&#12488;&#12392;&#12289;&#26032;&#12375;&#12356;&#12289;&#20182;&#12398;&#12424;&#12367;&#12354;&#12427;&#12467;&#12531;&#12486;&#12490;&#12391;&#25505;&#29992;&#12373;&#12428;&#12390;&#12356;&#12427;&#12424;&#12358;&#12394;&#12424;&#12426;&#21336;&#32020;&#12394;&#12289;<em class="parameter"><code>KEY=VALUE</code></em>&#12392;&#12356;&#12358;&#12471;&#12473;&#12486;&#12512;&#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12414;&#12377;&#12290;&#12375;&#12363;&#12375;&#12289;<span class="productname">Matroska</span>&#8482;&#12391;&#12399;&#12289;&#12371;&#12428;&#12425;&#12398;&#12479;&#12464;&#12399;&#12493;&#12473;&#12488;&#12377;&#12427;&#12371;&#12392;&#12418;&#21487;&#33021;&#12391;&#12289;&#12373;&#12425;&#12395;<em class="parameter"><code>KEY</code></em>&#12392;<em class="parameter"><code>VALUE</code></em>&#12399;&#20001;&#26041;&#12364;&#12381;&#12428;&#33258;&#20449;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12391;&#12377;&#12290;&#12469;&#12531;&#12503;&#12523;&#12501;&#12449;&#12452;&#12523;<code class="filename">example-tags-2.xml</code>&#12364;&#12371;&#12398;&#26032;&#12375;&#12356;&#12471;&#12473;&#12486;&#12512;&#12398;&#20351;&#12356;&#26041;&#12398;&#20363;&#12434;&#31034;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
   </p></div><div class="refsect2" title="&#12479;&#12464;&#12398;&#12473;&#12467;&#12540;&#12503;"><a name="id327461"></a><h3>&#12479;&#12464;&#12398;&#12473;&#12467;&#12540;&#12503;</h3><p>
    <span class="productname">Matroska</span>&#8482;&#12479;&#12464;&#12399;&#33258;&#21205;&#30340;&#12395;&#12399;&#12501;&#12449;&#12452;&#12523;&#20840;&#20307;&#12395;&#36969;&#29992;&#12399;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#36969;&#29992;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12364;&#12289;&#12501;&#12449;&#12452;&#12523;&#12398;&#30064;&#12427;&#37096;&#20998;&#12293;&#12293;&#12395;&#36969;&#29992;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;&#19968;&#12388;&#12289;&#12418;&#12375;&#12367;&#12399;&#35079;&#25968;&#12398;&#12488;&#12521;&#12483;&#12463;&#12289;&#19968;&#12388;&#12289;&#12418;&#12375;&#12367;&#12399;&#35079;&#25968;&#12398;&#12481;&#12515;&#12503;&#12479;&#12289;&#12373;&#12425;&#12395;&#12399;&#12381;&#12398;&#32068;&#12415;&#21512;&#12431;&#12379;&#12395;&#12418;&#36969;&#29992;&#12377;&#12427;&#12371;&#12392;&#12364;&#21487;&#33021;&#12391;&#12377;&#12290;<a class="ulink" href="http://matroska.org/technical/specs/index.html" target="_top"><span class="productname">Matroska</span>&#8482;&#12398;&#20181;&#27096;</a>&#12395;&#12289;&#12371;&#12398;&#12371;&#12392;&#12398;&#35443;&#32048;&#12364;&#35352;&#36848;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
   </p><p>
    &#37325;&#35201;&#12394;&#12371;&#12392;&#12399;&#12289;&#12479;&#12464;&#12399;<code class="classname">Targets</code><span class="productname">Matroska</span>&#8482;&#12479;&#12464;&#12456;&#12524;&#12513;&#12531;&#12488;&#12395;&#12424;&#12387;&#12390;&#12488;&#12521;&#12483;&#12463;&#21450;&#12403;&#12481;&#12515;&#12503;&#12479;&#12395;&#12522;&#12531;&#12463;&#12373;&#12428;&#12414;&#12377;&#12364;&#12289;&#12371;&#12398;&#12522;&#12531;&#12463;&#12398;&#38555;&#12395;&#20351;&#29992;&#12373;&#12428;&#12427;UID&#12399;<span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12364;&#33394;&#12293;&#12394;&#25152;&#12391;&#20351;&#29992;&#12377;&#12427;&#12488;&#12521;&#12483;&#12463;ID<span class="emphasis"><em>&#12391;&#12399;&#12394;&#12356;</em></span>&#12371;&#12392;&#12391;&#12377;&#12290;&#12381;&#12398;&#20195;&#12431;&#12426;&#12395;&#12289;<span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12399;&#33258;&#21205;&#30340;&#12395;&#35336;&#31639;&#12375;&#12383;UID(&#12488;&#12521;&#12483;&#12463;&#12364;<span class="productname">Matroska</span>&#8482;&#20197;&#22806;&#12398;&#12501;&#12449;&#12452;&#12523;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12363;&#12425;&#21462;&#12426;&#20986;&#12373;&#12428;&#12427;&#22580;&#21512;)&#12363;&#12289;&#12488;&#12521;&#12483;&#12463;&#12398;&#12477;&#12540;&#12473;&#12501;&#12449;&#12452;&#12523;&#12364;<span class="productname">Matroska</span>&#8482;&#12501;&#12449;&#12452;&#12523;&#12398;&#22580;&#21512;&#12477;&#12540;&#12473;&#12501;&#12449;&#12452;&#12523;&#12363;&#12425;&#12467;&#12500;&#12540;&#12373;&#12428;&#12383;&#25968;&#23383;&#12364;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#12424;&#12387;&#12390;&#12289;&#12479;&#12464;&#12501;&#12449;&#12452;&#12523;&#12364;<span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12395;&#28193;&#12373;&#12428;&#12427;&#21069;&#12395;&#12289;&#20351;&#29992;&#12373;&#12428;&#12427;UID&#12434;&#30693;&#12427;&#12371;&#12392;&#12399;&#22256;&#38627;&#12391;&#12377;&#12290;
   </p><p>
    <span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12399;<span class="productname">Matroska</span>&#8482;&#12501;&#12449;&#12452;&#12523;&#12395;&#12479;&#12464;&#12434;&#36861;&#21152;&#12377;&#12427;&#20108;&#12388;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#35469;&#35672;&#12375;&#12414;&#12377;&#12290;<a class="link" href="#mkvmerge.description.global_tags"><code class="option">--global-tags</code></a>&#12392;<a class="link" href="#mkvmerge.description.tags"><code class="option">--tags</code></a>&#12458;&#12503;&#12471;&#12519;&#12531;&#12391;&#12377;&#12290;&#12371;&#12398;&#20108;&#12388;&#12398;&#36949;&#12356;&#12399;&#12289;&#21069;&#32773;&#12398;<a class="link" href="#mkvmerge.description.global_tags"><code class="option">--global-tags</code></a>&#12399;&#12289;&#19978;&#36848;&#12398;<code class="classname">Targets</code>&#12456;&#12524;&#12513;&#12531;&#12488;&#12434;&#20840;&#12390;&#21462;&#12426;&#38500;&#12367;&#12371;&#12392;&#12391;&#12289;&#12479;&#12464;&#12364;&#12501;&#12449;&#12452;&#12523;&#20840;&#20307;&#12395;&#36969;&#29992;&#12373;&#12428;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;&#24460;&#32773;&#12398;<a class="link" href="#mkvmerge.description.tags"><code class="option">--tags</code></a>&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;<span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12364;
of the <a class="link" href="#mkvmerge.description.tags"><code class="option">--tags</code></a>&#12395;&#25351;&#23450;&#12375;&#12383;<em class="parameter"><code>TID</code></em>&#12398;&#31034;&#12377;&#12488;&#12521;&#12483;&#12463;&#12395;&#23550;&#12375;&#12390;&#33258;&#21205;&#30340;&#12395;&#35336;&#31639;&#12375;&#12383;UID&#12434;&#25407;&#20837;&#12375;&#12414;&#12377;&#12290;
   </p></div><div class="refsect2" title="&#20363;"><a name="id327605"></a><h3>&#20363;</h3><p>
    &#12354;&#12394;&#12383;&#12399;&#12289;<abbr class="abbrev">AVI</abbr>&#12363;&#12425;&#35501;&#12415;&#36796;&#12414;&#12428;&#12427;&#12499;&#12487;&#12458;&#12488;&#12521;&#12483;&#12463;&#12395;&#12479;&#12464;&#12434;&#12388;&#12369;&#12383;&#12356;&#12392;&#20206;&#23450;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;<span class="command"><strong>mkvmerge
--identify
file.avi</strong></span>&#12434;&#23455;&#34892;&#12377;&#12427;&#12392;&#12289;&#12499;&#12487;&#12458;&#12488;&#12521;&#12483;&#12463;&#12398;&#12488;&#12521;&#12483;&#12463;ID(&#12371;&#12398;ID&#12434;UID&#12392;&#28151;&#21516;&#12375;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;!)&#12399;0&#12391;&#12354;&#12427;&#12392;&#25945;&#12360;&#12390;&#12367;&#12428;&#12414;&#12377;&#12290;&#12424;&#12387;&#12390;&#12289;&#12354;&#12394;&#12383;&#12399;&#20840;&#12390;&#12398;<code class="classname">Targets</code>&#12456;&#12524;&#12513;&#12531;&#12488;&#12434;&#35352;&#20837;&#12375;&#12394;&#12356;&#12479;&#12464;&#12501;&#12449;&#12452;&#12523;&#12434;&#20316;&#25104;&#12375;&#12289;<span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12434;&#20197;&#19979;&#12398;&#12424;&#12358;&#12395;&#23455;&#34892;&#12375;&#12414;&#12377;&#12290;
   </p><pre class="screen">
$ mkvmerge -o file.mkv --tags 0:tags.xml file.avi
   </pre></div><div class="refsect2" title="&#12479;&#12464;&#12501;&#12449;&#12452;&#12523;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;"><a name="id327641"></a><h3>&#12479;&#12464;&#12501;&#12449;&#12452;&#12523;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;</h3><p>
    <span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12399;<abbr class="abbrev">XML</abbr>&#12505;&#12540;&#12473;&#12398;&#12479;&#12464;&#12501;&#12449;&#12452;&#12523;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12399;<a class="ulink" href="http://matroska.org/technical/specs/index.html" target="_top"><span class="productname">Matroska</span>&#8482;&#12398;&#20181;&#27096;</a>&#12395;&#38750;&#24120;&#12395;&#36817;&#12356;&#12487;&#12470;&#12452;&#12531;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;MKVToolNix&#12398;&#12496;&#12452;&#12490;&#12522;&#12289;&#21450;&#12403;&#12477;&#12540;&#12473;&#12487;&#12451;&#12473;&#12488;&#12522;&#12499;&#12517;&#12540;&#12471;&#12519;&#12531;&#12399;&#12393;&#12385;&#12425;&#12418;&#12289;&#26082;&#30693;&#12398;&#12479;&#12464;&#12434;&#12383;&#12384;&#12522;&#12473;&#12488;&#12375;&#12383;&#12384;&#12369;&#12398;&#12289;&#23455;&#38555;&#12398;&#12479;&#12464;&#12501;&#12449;&#12452;&#12523;&#12398;&#12486;&#12531;&#12503;&#12524;&#12540;&#12488;&#12392;&#12375;&#12390;&#20351;&#29992;&#12391;&#12365;&#12427;<code class="filename">example-tags-2.xml</code>&#12392;&#12356;&#12358;&#12469;&#12531;&#12503;&#12523;&#12501;&#12449;&#12452;&#12523;&#12434;&#21547;&#12435;&#12391;&#12356;&#12414;&#12377;&#12290;
   </p><p>
    &#22522;&#26412;&#30340;&#12395;&#12399;&#12289;&#20197;&#19979;&#12398;&#27096;&#12394;&#27083;&#25104;&#12391;&#12377;&#12290;
   </p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p>&#26368;&#12418;&#22806;&#20596;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12399;<code class="classname">&lt;Tags&gt;</code>&#12391;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;</p></li><li class="listitem"><p>&#19968;&#20491;&#12398;&#35542;&#29702;&#12479;&#12464;&#12399;<code class="classname">&lt;Tag&gt;</code><abbr class="abbrev">XML</abbr>&#12479;&#12464;&#12398;&#20869;&#37096;&#12395;&#21253;&#21547;&#12373;&#12428;&#12414;&#12377;&#12290;</p></li><li class="listitem"><p>&#12479;&#12464;&#12398;&#20013;&#36523;&#12398;&#30452;&#21069;&#12539;&#30452;&#24460;&#12398;&#12473;&#12506;&#12540;&#12473;&#12399;&#28961;&#35222;&#12373;&#12428;&#12414;&#12377;&#12290;</p></li></ul></div></div><div class="refsect2" title="&#12487;&#12540;&#12479;&#12479;&#12452;&#12503;"><a name="id327710"></a><h3>&#12487;&#12540;&#12479;&#12479;&#12452;&#12503;</h3><p>
    &#26032;&#12375;&#12356;<span class="productname">Matroska</span>&#8482;&#12479;&#12464;&#12471;&#12473;&#12486;&#12512;&#12399;&#12289;UTF-8&#25991;&#23383;&#21015;&#12392;&#12496;&#12452;&#12490;&#12522;&#12398;&#20108;&#12388;&#12398;&#12487;&#12540;&#12479;&#12479;&#12452;&#12503;&#12375;&#12363;&#35469;&#35672;&#12375;&#12414;&#12379;&#12435;&#12290;&#21069;&#32773;&#12399;&#12479;&#12464;&#12398;&#21517;&#21069;&#12392;<code class="classname">&lt;Strings&gt;</code>&#12456;&#12524;&#12513;&#12531;&#12488;&#12395;&#20351;&#29992;&#12373;&#12428;&#12289;&#24460;&#32773;&#12399;<code class="classname">&lt;Binary&gt;</code>&#12456;&#12524;&#12513;&#12531;&#12488;&#12395;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;
   </p><p>
    &#12496;&#12452;&#12490;&#12522;&#12487;&#12540;&#12399;&#12289;&#12381;&#12398;&#12414;&#12414;&#12391;&#12399;<abbr class="abbrev">XML</abbr>&#12501;&#12449;&#12452;&#12523;&#12395;&#26684;&#32013;&#12391;&#12365;&#12394;&#12356;&#12398;&#12391;&#12289;<span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12399;&#20108;&#12388;&#12398;&#12496;&#12452;&#12490;&#12522;&#12487;&#12540;&#12479;&#12434;&#26684;&#32013;&#12377;&#12427;&#26041;&#27861;&#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12414;&#12377;&#12290;<abbr class="abbrev">XML</abbr>&#12479;&#12464;&#12398;&#20013;&#36523;&#12364;'<code class="literal">@</code>'&#12391;&#22987;&#12414;&#12427;&#22580;&#21512;&#12289;&#12381;&#12398;&#12354;&#12392;&#12398;&#12486;&#12461;&#12473;&#12488;&#12399;&#12501;&#12449;&#12452;&#12523;&#21517;&#12392;&#12375;&#12390;&#25201;&#12431;&#12428;&#12289;&#23550;&#24540;&#12377;&#12427;&#12501;&#12449;&#12452;&#12523;&#12398;&#20013;&#36523;&#12364;<span class="productname">Matroska</span>&#8482;&#12456;&#12524;&#12513;&#12531;&#12488;&#12395;&#12467;&#12500;&#12540;&#12373;&#12428;&#12414;&#12377;&#12290;
   </p><p>
    &#12418;&#12358;&#19968;&#12388;&#12398;&#26041;&#27861;&#12391;&#12399;&#12289;&#12487;&#12540;&#12479;&#12399;<span class="foreignphrase"><em class="foreignphrase">Base64</em></span>&#12456;&#12531;&#12467;&#12540;&#12489;&#12373;&#12428;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12371;&#12428;&#12399;&#12289;&#12496;&#12452;&#12490;&#12522;&#12487;&#12540;&#12479;&#12434;<abbr class="abbrev">ASCII</abbr>&#12461;&#12515;&#12521;&#12463;&#12479;&#12398;&#19968;&#37096;&#12384;&#12369;&#12391;&#34920;&#29694;&#12377;&#12427;&#12383;&#12417;&#12398;&#12456;&#12531;&#12467;&#12540;&#12489;&#12391;&#12289;&#20363;&#12360;&#12400;E&#12513;&#12540;&#12523;&#12394;&#12393;&#12395;&#20351;&#29992;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;<span class="citerefentry"><span class="refentrytitle">mkvextract</span>(1)</span>&#12399;&#12289;&#12496;&#12452;&#12490;&#12522;&#12456;&#12524;&#12513;&#12531;&#12488;&#12434;<span class="foreignphrase"><em class="foreignphrase">Base64</em></span>&#12456;&#12531;&#12467;&#12540;&#12489;&#12373;&#12428;&#12383;&#12487;&#12540;&#12479;&#12392;&#12375;&#12390;&#20986;&#21147;&#12375;&#12414;&#12377;&#12290;
   </p><p>
    &#21476;&#12356;&#12479;&#12464;&#12471;&#12473;&#12486;&#12512;&#12399;&#12289;&#20844;&#24335;&#12398;<span class="productname">Matroska</span>&#8482;&#12398;&#20181;&#27096;&#12395;&#31034;&#12373;&#12428;&#12390;&#12356;&#12427;&#12424;&#12358;&#12395;&#12289;&#12418;&#12387;&#12392;&#22810;&#12367;&#12398;&#12487;&#12540;&#12479;&#12479;&#12452;&#12503;&#12434;&#35469;&#35672;&#12375;&#12390;&#12356;&#12414;&#12375;&#12383;&#12290;<span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12399;&#12418;&#12399;&#12420;&#12371;&#12398;&#12471;&#12473;&#12486;&#12512;&#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12394;&#12356;&#12398;&#12391;&#12289;&#12381;&#12428;&#12425;&#12398;&#12479;&#12452;&#12503;&#12395;&#12388;&#12356;&#12390;&#12399;&#12371;&#12371;&#12391;&#12399;&#35500;&#26126;&#12375;&#12414;&#12379;&#12435;&#12290;
   </p></div></div><div class="refsect1" title="Matroska&#8482;&#12501;&#12449;&#12452;&#12523;&#12398;&#12524;&#12452;&#12450;&#12454;&#12488;"><a name="mkvmerge.file_layout"></a><h2><span class="productname">Matroska</span>&#8482;&#12501;&#12449;&#12452;&#12523;&#12398;&#12524;&#12452;&#12450;&#12454;&#12488;</h2><p>
   <span class="productname">Matroska</span>&#8482;&#12501;&#12449;&#12452;&#12523;&#12398;&#12524;&#12452;&#12450;&#12454;&#12488;&#12399;&#38750;&#24120;&#12395;&#26580;&#36575;&#24615;&#12395;&#23500;&#12435;&#12391;&#12356;&#12414;&#12377;&#12290;<span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12399;&#12354;&#12425;&#12363;&#12376;&#12417;&#23450;&#32681;&#12373;&#12428;&#12383;&#26041;&#27861;&#12391;&#12501;&#12449;&#12452;&#12523;&#12434;&#26360;&#12365;&#20986;&#12375;&#12414;&#12377;&#12290;&#20986;&#21147;&#12373;&#12428;&#12383;&#12501;&#12449;&#12452;&#12523;&#12399;&#12371;&#12398;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  </p><p>
   [EBML&#12504;&#12483;&#12480;] [&#12475;&#12464;&#12513;&#12531;&#12488; {&#12513;&#12479;&#12471;&#12540;&#12463; #1} [&#12475;&#12464;&#12513;&#12531;&#12488;&#24773;&#22577;] [&#12488;&#12521;&#12483;&#12463;&#24773;&#22577;] {&#28155;&#20184;&#12501;&#12449;&#12452;&#12523;} {&#12481;&#12515;&#12503;&#12479;} [&#12463;&#12521;&#12473;&#12479; 1]
{&#12463;&#12521;&#12473;&#12479; 2} ...  {&#12463;&#12521;&#12473;&#12479; n} {CUE} {&#12513;&#12479;&#12471;&#12540;&#12463; #2} {&#12479;&#12464;}]
  </p><p>
   &#27874;&#25324;&#24359;&#12391;&#12367;&#12367;&#12425;&#12428;&#12383;&#12456;&#12524;&#12513;&#12531;&#12488;&#12399;&#30465;&#30053;&#21487;&#33021;&#12391;&#12289;&#12467;&#12531;&#12486;&#12531;&#12484;&#12392;&#25351;&#23450;&#12373;&#12428;&#12383;&#12458;&#12503;&#12471;&#12519;&#12531;&#12395;&#20381;&#23384;&#12375;&#12414;&#12377;&#12290;&#12356;&#12367;&#12388;&#12363;&#27880;&#37320;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  </p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p>
     &#12513;&#12479;&#12471;&#12540;&#12463; #1&#12399;&#12289;&#23569;&#25968;&#12398;&#12524;&#12505;&#12523;1&#12456;&#12524;&#12513;&#12531;&#12488;(&#28155;&#20184;&#12501;&#12449;&#12452;&#12523;&#12289;&#12481;&#12515;&#12503;&#12479;&#12289;CUE&#12289;&#12479;&#12464;&#12289;&#12513;&#12479;&#12471;&#12540;&#12463;
#2)&#12398;&#12415;&#12434;&#12289;&#12381;&#12428;&#12425;&#12364;&#23384;&#22312;&#12377;&#12427;&#12392;&#12365;&#12395;&#12398;&#12415;&#21547;&#12415;&#12414;&#12377;&#12290;&#20197;&#21069;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12398;<span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12399;&#12289;&#12371;&#12398;&#12513;&#12479;&#12471;&#12540;&#12463;&#12456;&#12524;&#12513;&#12531;&#12488;&#12395;&#12463;&#12521;&#12473;&#12479;&#12418;&#25407;&#20837;&#12375;&#12390;&#12356;&#12414;&#12375;&#12383;&#12290;&#12371;&#12398;&#12383;&#12417;&#12289;&#21313;&#20998;&#12394;&#12473;&#12506;&#12540;&#12473;&#12434;&#30906;&#20445;&#12375;&#12390;&#12362;&#12367;&#12383;&#12417;&#12395;&#19981;&#27491;&#30906;&#12394;&#25512;&#28204;&#12364;&#24517;&#35201;&#12391;&#12289;&#12371;&#12398;&#25512;&#28204;&#12399;&#22810;&#12367;&#12398;&#22580;&#21512;&#22833;&#25943;&#12375;&#12390;&#12356;&#12414;&#12375;&#12383;&#12290;&#29694;&#22312;&#12391;&#12399;&#12289;&#12463;&#12521;&#12473;&#12479;&#12398;&#12415;&#12399;&#12513;&#12479;&#12471;&#12540;&#12463;
#2&#12395;&#26684;&#32013;&#12373;&#12428;&#12289;&#12513;&#12479;&#12471;&#12540;&#12463; #1&#12364;&#12513;&#12479;&#12471;&#12540;&#12463;&#12456;&#12524;&#12513;&#12531;&#12488; #2&#12434;&#21442;&#29031;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
    </p></li><li class="listitem"><p>&#28155;&#20184;&#12501;&#12449;&#12452;&#12523;&#12289;&#12481;&#12515;&#12503;&#12479;&#12289;&#21450;&#12403;&#12479;&#12464;&#12456;&#12524;&#12513;&#12531;&#12488;&#12399;&#12381;&#12428;&#12425;&#12364;&#23384;&#22312;&#12377;&#12427;&#12392;&#12365;&#12395;&#12398;&#12415;&#36861;&#21152;&#12373;&#12428;&#12414;&#12377;&#12290;</p></li></ul></div><p>
   &#26368;&#23567;&#27083;&#25104;&#12398;Matroska&#12501;&#12449;&#12452;&#12523;&#12399;&#12371;&#12398;&#12424;&#12358;&#12394;&#27083;&#25104;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  </p><p>
   [EBML&#12504;&#12483;&#12480;] [&#12475;&#12464;&#12513;&#12531;&#12488; [&#12475;&#12464;&#12513;&#12531;&#12488;&#24773;&#22577;] [&#12488;&#12521;&#12483;&#12463;&#24773;&#22577;] [&#12463;&#12521;&#12473;&#12479;1]]
  </p><p>
   &#38899;&#22768;&#12398;&#12415;&#12398;&#12501;&#12449;&#12452;&#12523;&#12399;&#12371;&#12398;&#12424;&#12358;&#12395;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  </p></div><div class="refsect1" title="&#22806;&#37096;&#12479;&#12452;&#12512;&#12467;&#12540;&#12489;&#12501;&#12449;&#12452;&#12523;"><a name="mkvmerge.external_timecode_files"></a><h2>&#22806;&#37096;&#12479;&#12452;&#12512;&#12467;&#12540;&#12489;&#12501;&#12449;&#12452;&#12523;</h2><p>
   &#12518;&#12540;&#12470;&#12399;&#12289;&#29305;&#23450;&#12398;&#12488;&#12521;&#12483;&#12463;&#12398;&#12479;&#12452;&#12512;&#12467;&#12540;&#12489;&#12434;&#33258;&#20998;&#12391;<span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12395;&#25351;&#23450;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#12371;&#12428;&#12399;&#21487;&#22793;&#12501;&#12524;&#12540;&#12512;&#12524;&#12540;&#12488;&#12499;&#12487;&#12458;&#12434;&#21547;&#12416;&#12501;&#12449;&#12452;&#12523;&#12434;&#20316;&#25104;&#12377;&#12427;&#12392;&#12365;&#12420;&#12289;&#12458;&#12540;&#12487;&#12451;&#12458;&#12395;&#28961;&#38899;&#12434;&#25407;&#20837;&#12377;&#12427;&#12392;&#12365;&#12395;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;&#12371;&#12398;&#22580;&#21512;&#12289;&#12501;&#12524;&#12540;&#12512;&#12399;<span class="productname">Matroska</span>&#8482;&#12502;&#12525;&#12483;&#12463;&#12434;&#20316;&#25104;&#12377;&#12427;&#38555;&#12398;&#21336;&#20301;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;&#12499;&#12487;&#12458;&#12391;&#12399;&#12289;&#12371;&#12428;&#12399;&#12385;&#12423;&#12358;&#12393;1&#12501;&#12524;&#12540;&#12512;&#12392;&#12394;&#12426;&#12289;&#12458;&#12540;&#12487;&#12451;&#12458;&#12391;&#12399;&#12371;&#12428;&#12399;&#21508;&#12458;&#12540;&#12487;&#12451;&#12458;&#12479;&#12452;&#12503;&#12398;1&#12497;&#12465;&#12483;&#12488;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;<abbr class="abbrev">AC3</abbr>&#12391;&#12399;&#12289;&#12371;&#12428;&#12399;<code class="constant">1536</code>&#12469;&#12531;&#12503;&#12523;&#12434;&#21547;&#12416;1&#12497;&#12465;&#12483;&#12488;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;
  </p><p>
   &#32080;&#21512;&#12373;&#12428;&#12383;&#12488;&#12521;&#12483;&#12463;&#12395;&#12479;&#12452;&#12512;&#12467;&#12540;&#12489;&#12501;&#12449;&#12452;&#12523;&#12434;&#25351;&#23450;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;&#21508;&#32080;&#21512;&#12373;&#12428;&#12427;&#12488;&#12521;&#12483;&#12463;&#12481;&#12455;&#12452;&#12531;&#12398;&#26368;&#21021;&#12398;&#37096;&#20998;&#12395;&#12398;&#12415;&#25351;&#23450;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#20363;&#12360;&#12400;v1.avi&#12289;v2.avi&#12398;&#20108;&#12388;&#12398;&#12501;&#12449;&#12452;&#12523;&#12434;&#32080;&#21512;&#12375;&#12289;&#12479;&#12452;&#12512;&#12467;&#12540;&#12489;&#12434;&#20351;&#29992;&#12375;&#12383;&#12356;&#12392;&#12365;&#12398;&#12467;&#12510;&#12531;&#12489;&#12521;&#12452;&#12531;&#12399;&#27425;&#12398;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  </p><pre class="screen">
mkvmerge ... --timecodes 0:my_timecodes.txt v1.avi +v2.avi
  </pre><p>
   <span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12399;&#12289;4&#12388;&#12398;&#12501;&#12449;&#12458;&#12540;&#12510;&#12483;&#12488;&#12434;&#35469;&#35672;&#12375;&#12414;&#12377;&#12290;&#26368;&#21021;&#12398;1&#34892;&#12399;&#24120;&#12395;&#12496;&#12540;&#12472;&#12519;&#12531;&#30058;&#21495;&#12434;&#21547;&#12415;&#12414;&#12377;&#12290;&#31354;&#34892;&#12289;&#31354;&#30333;&#12398;&#12415;&#12434;&#21547;&#12416;&#34892;&#12289;&#21450;&#12403;'<code class="literal">#</code>'&#12391;&#22987;&#12414;&#12427;&#34892;&#12399;&#28961;&#35222;&#12373;&#12428;&#12414;&#12377;&#12290;
  </p><div class="refsect2" title="&#12479;&#12452;&#12512;&#12467;&#12540;&#12489;&#12501;&#12449;&#12452;&#12523;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488; v1"><a name="id327962"></a><h3>&#12479;&#12452;&#12512;&#12467;&#12540;&#12489;&#12501;&#12449;&#12452;&#12523;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488; v1</h3><p>
    &#12371;&#12398;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12399;&#12496;&#12540;&#12472;&#12519;&#12531;&#34892;&#12363;&#12425;&#22987;&#12414;&#12426;&#12414;&#12377;&#12290;2&#34892;&#30446;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12501;&#12524;&#12540;&#12512;&#12524;&#12540;&#12488;&#12434;&#23459;&#35328;&#12375;&#12414;&#12377;&#12290;&#27531;&#12426;&#12398;&#20840;&#12390;&#12398;&#34892;&#12399;&#12289;&#12467;&#12531;&#12510;&#12391;&#21306;&#20999;&#12425;&#12428;&#12383;3&#12388;&#12398;&#25968;&#23383;&#12434;&#21547;&#12415;&#12414;&#12377;&#12290;&#38283;&#22987;&#12501;&#12524;&#12540;&#12512;(<code class="constant">0</code>&#12364;&#26368;&#21021;&#12398;&#12501;&#12524;&#12540;&#12512;&#12391;&#12377;)&#12289;&#32066;&#20102;&#12501;&#12524;&#12540;&#12512;&#12289;&#12381;&#12375;&#12390;&#12371;&#12398;&#31684;&#22258;&#12391;&#36969;&#29992;&#12373;&#12428;&#12427;&#12501;&#12524;&#12540;&#12512;&#12524;&#12540;&#12488;&#12391;&#12377;&#12290;<abbr class="abbrev">FPS</abbr>&#12399;&#12289;&#12489;&#12483;&#12488;'<code class="literal">.</code>'&#12434;&#23567;&#25968;&#28857;&#12392;&#12375;&#12390;&#25345;&#12388;&#23567;&#25968;&#12391;&#12377;&#12290;&#12501;&#12524;&#12540;&#12512;&#31684;&#22258;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;<abbr class="abbrev">FPS</abbr>&#12364;&#20351;&#29992;&#12373;&#12428;&#12427;&#12462;&#12515;&#12483;&#12503;&#12434;&#21547;&#12416;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;&#20363;&#12434;&#19979;&#12395;&#31034;&#12375;&#12414;&#12377;&#12290;
   </p><pre class="screen">
# timecode format v1
assume 27.930
800,1000,25
1500,1700,30
   </pre></div><div class="refsect2" title="&#12479;&#12452;&#12512;&#12467;&#12540;&#12489;&#12501;&#12449;&#12452;&#12523;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488; v2"><a name="id328000"></a><h3>&#12479;&#12452;&#12512;&#12467;&#12540;&#12489;&#12501;&#12449;&#12452;&#12523;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488; v2</h3><p>
    &#12371;&#12398;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12391;&#12399;&#12289;&#21508;&#34892;&#12399;&#23550;&#24540;&#12377;&#12427;&#12501;&#12524;&#12540;&#12512;&#12398;&#12479;&#12452;&#12512;&#12467;&#12540;&#12489;&#12434;&#21547;&#12415;&#12414;&#12377;&#12290;&#12371;&#12398;&#12479;&#12452;&#12512;&#12467;&#12540;&#12489;&#12399;&#12511;&#12522;&#31186;&#21336;&#20301;&#12398;&#31934;&#24230;&#12391;&#25351;&#23450;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;&#23567;&#25968;&#12434;&#25351;&#23450;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12364;&#12289;&#23567;&#25968;&#12391;&#12394;&#12367;&#12390;&#12418;&#12363;&#12414;&#12356;&#12414;&#12379;&#12435;&#12290;&#26368;&#20302;&#12391;&#12418;&#12289;&#12488;&#12521;&#12483;&#12463;&#12395;&#21547;&#12414;&#12428;&#12427;&#12501;&#12524;&#12540;&#12512;&#25968;&#12392;&#21516;&#25968;&#12398;&#12479;&#12452;&#12512;&#12467;&#12540;&#12489;&#34892;&#12434;&#21547;&#12414;<span class="emphasis"><em>&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;</em></span>&#12290;&#12371;&#12398;&#12501;&#12449;&#12452;&#12523;&#20869;&#12398;&#12479;&#12452;&#12512;&#12467;&#12540;&#12489;&#12399;&#25972;&#21015;&#12373;&#12428;&#12390;&#12356;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;&#20363;&#12360;&#12400;&#12289;25fps&#12391;&#12399;&#20197;&#19979;&#12398;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
   </p><pre class="screen">
# timecode format v2
0
40
80
   </pre></div><div class="refsect2" title="&#12479;&#12452;&#12512;&#12467;&#12540;&#12489;&#12501;&#12449;&#12452;&#12523;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488; v3"><a name="id328025"></a><h3>&#12479;&#12452;&#12512;&#12467;&#12540;&#12489;&#12501;&#12449;&#12452;&#12523;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488; v3</h3><p>
    &#12371;&#12398;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12391;&#12399;&#12289;&#21508;&#34892;&#12399;&#31186;&#21336;&#20301;&#12398;&#25345;&#32154;&#26178;&#38291;&#12392;&#12289;&#30465;&#30053;&#21487;&#33021;&#12394;&#12501;&#12524;&#12540;&#12512;&#12524;&#12540;&#12488;&#12434;&#21547;&#12415;&#12414;&#12377;&#12290;&#12371;&#12398;&#20108;&#12388;&#12399;&#20001;&#26041;&#12392;&#12418;&#23567;&#25968;&#12434;&#25351;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;&#12418;&#12375;&#12289;&#12501;&#12524;&#12540;&#12512;&#12524;&#12540;&#12488;&#12364;&#25351;&#23450;&#12373;&#12428;&#12394;&#12356;&#22580;&#21512;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#20516;&#12364;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#12458;&#12540;&#12487;&#12451;&#12458;&#12391;&#12399;&#12467;&#12540;&#12487;&#12483;&#12463;&#12395;&#12479;&#12452;&#12512;&#12467;&#12540;&#12489;&#12434;&#35336;&#31639;&#12373;&#12379;&#12427;&#12409;&#12365;&#12391;&#12377;&#12290;&#12371;&#12398;&#12383;&#12417;&#12395;&#12399;&#12289;&#12501;&#12524;&#12540;&#12512;&#12524;&#12540;&#12488;&#12392;&#12375;&#12390;<code class="constant">0.0</code>&#12434;&#25351;&#23450;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12414;&#12383;&#12289;'<code class="literal">gap</code>'&#12461;&#12540;&#12527;&#12540;&#12489;&#12398;&#24460;&#12395;&#25345;&#32154;&#26178;&#38291;&#12434;&#25351;&#23450;&#12375;&#12390;&#12289;&#28961;&#38899;&#12434;&#25351;&#23450;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;&#12458;&#12540;&#12487;&#12451;&#12458;&#12501;&#12449;&#12452;&#12523;&#29992;&#12398;&#20363;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;
   </p><pre class="screen">
# timecode format v3
assume 0.0
25.325
7.530,38.236
gap, 10.050
2.000,38.236
   </pre></div><div class="refsect2" title="&#12479;&#12452;&#12512;&#12467;&#12540;&#12489;&#12501;&#12449;&#12452;&#12523;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488; v4"><a name="id328057"></a><h3>&#12479;&#12452;&#12512;&#12467;&#12540;&#12489;&#12501;&#12449;&#12452;&#12523;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488; v4</h3><p>
    &#12371;&#12398;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12399;v2&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12392;&#21516;&#19968;&#12391;&#12377;&#12290;&#21807;&#19968;&#12398;&#36949;&#12356;&#12399;&#12289;&#12479;&#12452;&#12512;&#12467;&#12540;&#12489;&#12364;&#25972;&#21015;&#12373;&#12428;&#12390;&#12356;&#12394;&#12367;&#12390;&#12418;&#12356;&#12356;&#12392;&#12356;&#12358;&#28857;&#12391;&#12377;&#12290;&#12371;&#12398;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12364;&#20351;&#12431;&#12428;&#12427;&#12371;&#12392;&#12399;&#12411;&#12412;&#28961;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
   </p></div></div><div class="refsect1" title="&#36820;&#12426;&#20516;"><a name="id328072"></a><h2>&#36820;&#12426;&#20516;</h2><p>
   <span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12399;&#19979;&#12398;3&#12388;&#12398;&#36820;&#12426;&#20516;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;
  </p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p>
     <code class="constant">0</code> -- &#12371;&#12398;&#36820;&#12426;&#20516;&#12399;MUX&#12364;&#27491;&#24120;&#12395;&#32066;&#20102;&#12375;&#12383;&#12371;&#12392;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;
    </p></li><li class="listitem"><p>
     <code class="constant">1</code> -- &#12371;&#12398;&#36820;&#12426;&#20516;&#12399;&#12289;&#19968;&#12388;&#20197;&#19978;&#12398;&#35686;&#21578;&#12364;&#20986;&#21147;&#12373;&#12428;&#12414;&#12375;&#12383;&#12364;&#12289;&#25277;&#20986;&#12364;&#32154;&#34892;&#12373;&#12428;&#12383;&#12371;&#12392;&#12434;&#24847;&#21619;&#12375;&#12414;&#12377;&#12290;&#35686;&#21578;&#12399;
'<code class="literal">&#35686;&#21578;:</code>'
&#12392;&#12356;&#12358;&#25991;&#23383;&#21015;&#12434;&#20808;&#38957;&#12395;&#12388;&#12369;&#12390;&#20986;&#21147;&#12373;&#12428;&#12414;&#12377;&#12290;&#20986;&#21147;&#12501;&#12449;&#12452;&#12523;&#12364;&#28961;&#20107;&#12391;&#12354;&#12427;&#12363;&#12393;&#12358;&#12363;&#12399;&#12289;&#22580;&#21512;&#12395;&#12424;&#12426;&#12414;&#12377;&#12290;&#20986;&#21147;&#12501;&#12449;&#12452;&#12523;&#12434;&#30906;&#35469;&#12377;&#12427;&#12371;&#12392;&#12434;&#24375;&#12367;&#25512;&#22888;&#12375;&#12414;&#12377;&#12290;
    </p></li><li class="listitem"><p>
     <code class="constant">2</code> --
&#12371;&#12398;&#36820;&#12426;&#20516;&#12399;&#12289;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12289;&#12456;&#12521;&#12540;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#20986;&#21147;&#12375;&#12383;&#24460;&#12395;<span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12364;&#20966;&#29702;&#12434;&#20013;&#26029;&#12375;&#12383;&#12371;&#12392;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;&#12456;&#12521;&#12540;&#12513;&#12483;&#12475;&#12540;&#12472;&#12399;&#19981;&#27491;&#12394;&#12467;&#12510;&#12531;&#12489;&#12521;&#12452;&#12531;&#12420;&#12501;&#12449;&#12452;&#12523;I/O&#12456;&#12521;&#12540;&#12289;&#22730;&#12428;&#12383;&#12501;&#12449;&#12452;&#12523;&#12394;&#12393;&#27096;&#12293;&#12391;&#12377;&#12290;
    </p></li></ul></div></div><div class="refsect1" title="&#38306;&#36899;&#38917;&#30446;"><a name="mkvmerge.seealso"></a><h2>&#38306;&#36899;&#38917;&#30446;</h2><p>
   <span class="citerefentry"><span class="refentrytitle">mkvinfo</span>(1)</span>, <span class="citerefentry"><span class="refentrytitle">mkvextract</span>(1)</span>, <span class="citerefentry"><span class="refentrytitle">mkvpropedit</span>(1)</span>, <span class="citerefentry"><span class="refentrytitle">mmg</span>(1)</span>
  </p></div><div class="refsect1" title="&#12454;&#12455;&#12502;"><a name="mkvmerge.www"></a><h2>&#12454;&#12455;&#12502;</h2><p>
   &#26368;&#26032;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12399;&#12289;&#24120;&#26178;<a class="ulink" href="http://www.bunkus.org/videotools/mkvtoolnix/" target="_top">MKVToolNix&#12398;&#12507;&#12540;&#12512;&#12506;&#12540;&#12472;</a>&#12363;&#12425;&#21462;&#24471;&#12391;&#12365;&#12414;&#12377;&#12290;
  </p></div></div></body></html>
