<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>mkvpropedit</title><meta name="generator" content="DocBook XSL Stylesheets V1.75.2"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div lang="ja" class="refentry" title="mkvpropedit"><a name="mkvextract"></a><div class="titlepage"></div><div class="refnamediv"><h2>&#21517;&#21069;</h2><p>mkvpropedit &#8212; &#20877;MUX&#12377;&#12427;&#12371;&#12392;&#12394;&#12367;&#12289;&#26082;&#23384;&#12398;<span class="productname">Matroska</span>&#8482;&#12501;&#12449;&#12452;&#12523;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#20462;&#27491;&#12377;&#12427;</p></div><div class="refsynopsisdiv" title="&#26360;&#24335;"><a name="mkvpropedit.synopsis"></a><h2>&#26360;&#24335;</h2><div class="cmdsynopsis"><p><code class="command">mkvpropedit</code>  [options] {source-filename}</p></div></div><div class="refsect1" title="&#35500;&#26126;"><a name="mkvpropedit.description"></a><h2>&#35500;&#26126;</h2><p>
   &#12371;&#12398;&#12503;&#12525;&#12464;&#12521;&#12512;&#12399;&#12289;&#26082;&#23384;&#12398;<span class="productname">Matroska</span>&#8482;&#12501;&#12449;&#12452;&#12523;&#12434;&#35299;&#26512;&#12375;&#12289;&#12381;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12356;&#12367;&#12388;&#12363;&#12434;&#20462;&#27491;&#12375;&#12414;&#12377;&#12290;&#12381;&#12375;&#12390;&#12289;&#12381;&#12428;&#12425;&#12398;&#20462;&#27491;&#12434;&#26082;&#23384;&#12398;&#12501;&#12449;&#12452;&#12523;&#12395;&#26360;&#12365;&#36796;&#12415;&#12414;&#12377;&#12290;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#20013;&#12391;&#22793;&#26356;&#21487;&#33021;&#12394;&#12398;&#12399;&#12289;&#12475;&#12464;&#12513;&#12531;&#12488;&#24773;&#22577;&#12456;&#12524;&#12513;&#12531;&#12488;(&#20363;&#12360;&#12400;&#12479;&#12452;&#12488;&#12523;)&#12392;&#12289;&#12488;&#12521;&#12483;&#12463;&#12504;&#12483;&#12480;(&#20363;&#12360;&#12400;&#35328;&#35486;&#12467;&#12540;&#12489;&#12420;'&#12487;&#12501;&#12457;&#12523;&#12488;&#12488;&#12521;&#12483;&#12463;'&#12501;&#12521;&#12464;&#12289;&#12488;&#12521;&#12483;&#12463;&#21517;)&#12391;&#12377;&#12290;
  </p><p>
   &#12458;&#12503;&#12471;&#12519;&#12531;:
  </p><div class="variablelist"><dl><dt><a name="mkvpropedit.description.list_property_names"></a><span class="term"><code class="option">-l</code>, <code class="option">--list-property-names</code></span></dt><dd><p>
      &#26082;&#30693;&#12398;&#32232;&#38598;&#21487;&#33021;&#12394;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#21517;&#21069;&#12289;&#22411;(&#25991;&#23383;&#21015;&#12289;&#25972;&#25968;&#12289;&#30495;&#20605;&#20516;&#31561;)&#12289;&#30701;&#12356;&#35500;&#26126;&#12434;&#19968;&#35239;&#34920;&#31034;&#12375;&#12414;&#12377;&#12290;&#12381;&#12398;&#24460;&#12289;&#12503;&#12525;&#12464;&#12521;&#12512;&#12399;&#32066;&#20102;&#12375;&#12414;&#12377;&#12290;&#12424;&#12387;&#12390;&#12289;<em class="parameter"><code>source-filename</code></em>&#12497;&#12521;&#12513;&#12540;&#12479;&#12434;&#25351;&#23450;&#12377;&#12427;&#24517;&#35201;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
     </p></dd><dt><a name="mkvpropedit.description.parse_mode"></a><span class="term"><code class="option">-p</code>, <code class="option">--parse-mode</code>
<em class="parameter"><code>mode</code></em></span></dt><dd><p>
      &#35299;&#26512;&#12514;&#12540;&#12489;&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;'<em class="parameter"><code>mode</code></em>'&#12497;&#12521;&#12513;&#12540;&#12479;&#12399;'<code class="literal">fast</code>'(&#12487;&#12501;&#12457;&#12523;&#12488;)&#12392;'<code class="literal">full</code>'&#12398;&#12393;&#12385;&#12425;&#12363;&#12434;&#25351;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;'<code class="literal">fast</code>'&#12514;&#12540;&#12489;&#12399;&#12501;&#12449;&#12452;&#12523;&#20840;&#20307;&#12434;&#35299;&#26512;&#12377;&#12427;&#12398;&#12391;&#12399;&#12394;&#12367;&#12289;&#12513;&#12479;&#12471;&#12540;&#12463;&#12456;&#12524;&#12513;&#12531;&#12488;&#12434;&#20351;&#12387;&#12390;&#12477;&#12540;&#12473;&#12501;&#12449;&#12452;&#12523;&#20869;&#12398;&#24517;&#35201;&#12394;&#12456;&#12524;&#12513;&#12531;&#12488;&#12434;&#25506;&#12375;&#12414;&#12377;&#12290;99%&#12398;&#22580;&#21512;&#12371;&#12428;&#12391;&#21313;&#20998;&#12391;&#12377;&#12290;&#12375;&#12363;&#12375;&#12289;&#12513;&#12479;&#12471;&#12540;&#12463;&#12456;&#12524;&#12513;&#12531;&#12488;&#12434;&#21547;&#12414;&#12394;&#12356;&#12501;&#12449;&#12452;&#12523;&#12420;&#30772;&#25613;&#12375;&#12383;&#12501;&#12449;&#12452;&#12523;&#12395;&#23550;&#12375;&#12390;&#12399;'<code class="literal">full</code>'&#35299;&#26512;&#12514;&#12540;&#12489;&#12434;&#25351;&#23450;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;'<code class="literal">full</code>'&#12473;&#12461;&#12515;&#12531;&#12395;&#12399;&#25968;&#20998;&#12363;&#12363;&#12427;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12364;&#12289;'<code class="literal">fast</code>'&#12473;&#12461;&#12515;&#12531;&#12395;&#12399;&#25968;&#31186;&#12375;&#12363;&#12363;&#12363;&#12426;&#12414;&#12379;&#12435;&#12290;
     </p></dd></dl></div><p>
   &#12450;&#12463;&#12471;&#12519;&#12531;:
  </p><div class="variablelist"><dl><dt><a name="mkvpropedit.description.edit"></a><span class="term"><code class="option">-e</code>, <code class="option">--edit</code> <em class="parameter"><code>selector</code></em></span></dt><dd><p>
      &#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#20197;&#38477;&#12398;<a class="link" href="#mkvpropedit.description.add">add</a>&#12289;<a class="link" href="#mkvpropedit.description.set">set</a>&#12289;<a class="link" href="#mkvpropedit.description.delete">delete</a>&#12450;&#12463;&#12471;&#12519;&#12531;&#12364;&#36969;&#29992;&#12373;&#12428;&#12427;<span class="productname">Matroska</span>&#8482;&#12501;&#12449;&#12452;&#12523;&#12475;&#12463;&#12471;&#12519;&#12531;(&#12475;&#12464;&#12513;&#12531;&#12488;&#24773;&#22577;&#12414;&#12383;&#12399;&#29305;&#23450;&#12398;&#12488;&#12521;&#12483;&#12463;&#12398;&#12504;&#12483;&#12480;)&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#35079;&#25968;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12434;&#20462;&#27491;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289;&#35079;&#25968;&#22238;&#25351;&#23450;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
     </p><p>
      &#25991;&#27861;&#12398;&#23436;&#20840;&#12394;&#35500;&#26126;&#12399;&#12289;<a class="link" href="#mkvpropedit.edit_selectors" title="&#12456;&#12487;&#12451;&#12483;&#12488;&#12475;&#12524;&#12463;&#12479;">&#12456;&#12487;&#12451;&#12483;&#12488;&#12475;&#12524;&#12463;&#12479;</a>&#12398;&#12475;&#12463;&#12471;&#12519;&#12531;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
     </p></dd><dt><a name="mkvpropedit.description.add"></a><span class="term"><code class="option">-a</code>, <code class="option">--add</code>
<em class="parameter"><code>name</code></em>=<em class="parameter"><code>value</code></em></span></dt><dd><p>
      <em class="parameter"><code>name</code></em>&#12391;&#25351;&#23450;&#12373;&#12428;&#12383;&#21517;&#21069;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;<em class="parameter"><code>value</code></em>&#12391;&#25351;&#23450;&#12375;&#12383;&#20516;&#12391;&#36861;&#21152;&#12375;&#12414;&#12377;&#12290;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12289;&#26082;&#12395;&#12381;&#12398;&#21517;&#21069;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#23384;&#22312;&#12377;&#12427;&#22580;&#21512;&#12418;&#36861;&#21152;&#12373;&#12428;&#12414;&#12377;&#12290;&#12411;&#12392;&#12435;&#12393;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#19968;&#24847;&#30340;&#12391;&#12289;&#35079;&#25968;&#22238;&#36861;&#21152;&#12391;&#12365;&#12394;&#12356;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
     </p></dd><dt><a name="mkvpropedit.description.set"></a><span class="term"><code class="option">-s</code>, <code class="option">--set</code>
<em class="parameter"><code>name</code></em>=<em class="parameter"><code>value</code></em></span></dt><dd><p>
      &#35211;&#20184;&#12369;&#12383;&#20840;&#12390;&#12398;&#12289;&#12503;&#12525;&#12497;&#12486;&#12451;&#21517;&#12364;<em class="parameter"><code>name</code></em>&#12391;&#12354;&#12427;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#20516;&#12434;&#12289;<em class="parameter"><code>value</code></em>&#12395;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;&#12381;&#12398;&#12424;&#12358;&#12394;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#23384;&#22312;&#12375;&#12394;&#12356;&#12392;&#12365;&#12399;&#12289;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#36861;&#21152;&#12373;&#12428;&#12414;&#12377;&#12290;
     </p></dd><dt><a name="mkvpropedit.description.delete"></a><span class="term"><code class="option">-d</code>, <code class="option">--delete</code> <em class="parameter"><code>name</code></em></span></dt><dd><p>
      &#35211;&#20184;&#12369;&#12383;&#20840;&#12390;&#12398;&#12289;&#12503;&#12525;&#12497;&#12486;&#12451;&#21517;&#12364;<em class="parameter"><code>name</code></em>&#12391;&#12354;&#12427;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#21066;&#38500;&#12375;&#12414;&#12377;&#12290;&#12356;&#12367;&#12388;&#12363;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#24517;&#38920;&#12391;&#12289;&#21066;&#38500;&#12391;&#12365;&#12394;&#12356;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
     </p></dd></dl></div><p>
   &#12381;&#12398;&#20182;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;:
  </p><div class="variablelist"><dl><dt><a name="mkvpropedit.description.command_line_charset"></a><span class="term"><code class="option">--command-line-charset</code> <em class="parameter"><code>character-set</code></em></span></dt><dd><p>
      &#12467;&#12510;&#12531;&#12489;&#12521;&#12452;&#12531;&#25991;&#23383;&#21015;&#12398;&#25991;&#23383;&#12467;&#12540;&#12489;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12399;&#12289;&#12471;&#12473;&#12486;&#12512;&#12398;&#29694;&#22312;&#12398;&#12525;&#12465;&#12540;&#12523;&#12398;&#25991;&#23383;&#12467;&#12540;&#12489;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
     </p></dd><dt><a name="mkvpropedit.description.output_charset"></a><span class="term"><code class="option">--output-charset</code> <em class="parameter"><code>character-set</code></em></span></dt><dd><p>
      &#20986;&#21147;&#12377;&#12427;&#25991;&#23383;&#12467;&#12540;&#12489;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12399;&#12289;&#12471;&#12473;&#12486;&#12512;&#12398;&#29694;&#22312;&#12398;&#12525;&#12465;&#12540;&#12523;&#12398;&#25991;&#23383;&#12467;&#12540;&#12489;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
     </p></dd><dt><a name="mkvpropedit.description.redirect_output"></a><span class="term"><code class="option">-r</code>, <code class="option">--redirect-output</code>
<em class="parameter"><code>file-name</code></em></span></dt><dd><p>
      &#20840;&#12390;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#12467;&#12531;&#12477;&#12540;&#12523;&#12391;&#12399;&#12394;&#12367;<em class="parameter"><code>file-name</code></em>&#12391;&#25351;&#23450;&#12375;&#12383;&#12501;&#12449;&#12452;&#12523;&#12395;&#26360;&#12365;&#20986;&#12375;&#12414;&#12377;&#12290;&#20986;&#21147;&#12522;&#12480;&#12452;&#12524;&#12463;&#12488;&#12395;&#12424;&#12387;&#12390;&#12418;&#21516;&#12376;&#12371;&#12392;&#12364;&#31777;&#21336;&#12395;&#12391;&#12365;&#12414;&#12377;&#12364;&#12289;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#24517;&#35201;&#12394;&#22580;&#21512;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;&#12479;&#12540;&#12511;&#12490;&#12523;&#12364;&#12501;&#12449;&#12452;&#12523;&#12395;&#26360;&#12365;&#36796;&#12416;&#21069;&#12395;&#20986;&#21147;&#12434;&#20966;&#29702;&#12375;&#12390;&#12375;&#12414;&#12358;&#22580;&#21512;&#12394;&#12393;&#12391;&#12377;&#12290;<a class="link" href="#mkvpropedit.description.output_charset"><code class="option">--output-charset</code></a>&#12395;&#12424;&#12387;&#12390;&#25351;&#23450;&#12373;&#12428;&#12383;&#25991;&#23383;&#12467;&#12540;&#12489;&#12399;&#23562;&#37325;&#12373;&#12428;&#12414;&#12377;&#12290;
     </p></dd><dt><a name="mkvpropedit.description.ui_language"></a><span class="term"><code class="option">--ui-language</code> <em class="parameter"><code>code</code></em></span></dt><dd><p>
      &#25351;&#23450;&#12375;&#12383;<em class="parameter"><code>code</code></em>&#12434;&#24375;&#21046;&#30340;&#12395;&#35328;&#35486;&#12467;&#12540;&#12489;(&#20363;:
&#26085;&#26412;&#35486;&#12394;&#12425;&#12400;'<code class="literal">ja_JP</code>')&#12392;&#12375;&#12390;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;&#12375;&#12363;&#12375;&#12289;&#29872;&#22659;&#22793;&#25968;<code class="varname">LANG</code>&#12420;<code class="varname">LC_MESSAGES</code>&#12289;<code class="varname">LC_ALL</code>&#12434;&#20351;&#29992;&#12375;&#12383;&#12411;&#12358;&#12364;&#22909;&#12414;&#12375;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;<em class="parameter"><code>code</code></em>&#12395;<code class="literal">list</code>&#12392;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;&#25351;&#23450;&#12391;&#12365;&#12427;&#35328;&#35486;&#12467;&#12540;&#12489;&#12398;&#19968;&#35239;&#12434;&#20986;&#21147;&#12375;&#12414;&#12377;&#12290;
     </p></dd><dt><span class="term"><code class="option">-v</code>, <code class="option">--verbose</code></span></dt><dd><p>
      &#20986;&#21147;&#12364;&#20887;&#38263;&#12395;&#12394;&#12426;&#12289;<span class="productname">Matroska</span>&#8482;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12395;&#12392;&#12387;&#12390;&#37325;&#35201;&#12394;&#12371;&#12392;&#20840;&#12390;&#12434;&#12289;&#35501;&#12415;&#36796;&#12414;&#12428;&#12427;&#12388;&#12393;&#12395;&#34920;&#31034;&#12375;&#12390;&#12356;&#12365;&#12414;&#12377;&#12290;
     </p></dd><dt><span class="term"><code class="option">-h</code>, <code class="option">--help</code></span></dt><dd><p>
      &#12467;&#12510;&#12531;&#12489;&#26360;&#24335;&#24773;&#22577;&#12434;&#20986;&#21147;&#12375;&#12390;&#32066;&#20102;&#12375;&#12414;&#12377;&#12290;
     </p></dd><dt><span class="term"><code class="option">-V</code>, <code class="option">--version</code></span></dt><dd><p>
      &#12496;&#12540;&#12472;&#12519;&#12531;&#24773;&#22577;&#12434;&#20986;&#21147;&#12375;&#12390;&#32066;&#20102;&#12375;&#12414;&#12377;&#12290;
     </p></dd><dt><span class="term"><code class="option">@</code>options-file</span></dt><dd><p>
      <em class="parameter"><code>options-file</code></em>&#12391;&#25351;&#23450;&#12373;&#12428;&#12383;&#12501;&#12449;&#12452;&#12523;&#12363;&#12425;&#36861;&#21152;&#12398;&#12467;&#12510;&#12531;&#12489;&#12521;&#12452;&#12531;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#35501;&#12415;&#36796;&#12415;&#12414;&#12377;&#12290;&#34892;&#12391;&#26368;&#21021;&#12398;&#31354;&#30333;&#25991;&#23383;&#12391;&#12394;&#12356;&#25991;&#23383;&#12364;&#12495;&#12483;&#12471;&#12517;&#12510;&#12540;&#12463;('<code class="literal">#</code>')&#12391;&#12354;&#12427;&#34892;&#12399;&#12467;&#12513;&#12531;&#12488;&#12392;&#12375;&#12390;&#25201;&#12431;&#12428;&#12289;&#28961;&#35222;&#12373;&#12428;&#12414;&#12377;&#12290;&#34892;&#38957;&#12289;&#21450;&#12403;&#34892;&#26411;&#12398;&#31354;&#30333;&#25991;&#23383;&#12399;&#21462;&#12426;&#38500;&#12363;&#12428;&#12414;&#12377;&#12290;&#21508;&#34892;&#12395;&#12399;&#19968;&#12388;&#12378;&#12388;&#12375;&#12363;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#25351;&#23450;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#12513;&#12479;&#12461;&#12515;&#12521;&#12463;&#12479;&#12398;&#12456;&#12473;&#12465;&#12540;&#12503;&#12399;&#24517;&#35201;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
     </p><p>
      '<span class="command"><strong>mkvpropedit source.mkv --edit trach:a2 --set
name=Comments</strong></span>'&#12392;&#12356;&#12358;&#12467;&#12510;&#12531;&#12489;&#12521;&#12452;&#12531;&#12392;&#21516;&#12376;&#12371;&#12392;&#12399;&#12289;&#27425;&#12398;&#12424;&#12358;&#12394;&#12458;&#12503;&#12471;&#12519;&#12531;&#12501;&#12449;&#12452;&#12523;&#12395;&#12424;&#12387;&#12390;&#25351;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;
     </p><pre class="programlisting">
# Modify source.mkv
source.mkv
# Edit the second audio track
--edit
track:a2
# and set the title to 'Comments'
--set
title=Comments
     </pre></dd></dl></div></div><div class="refsect1" title="&#12456;&#12487;&#12451;&#12483;&#12488;&#12475;&#12524;&#12463;&#12479;"><a name="mkvpropedit.edit_selectors"></a><h2>&#12456;&#12487;&#12451;&#12483;&#12488;&#12475;&#12524;&#12463;&#12479;</h2><p>
   <a class="link" href="#mkvpropedit.description.edit"><code class="option">--edit</code></a>&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#20197;&#38477;&#12398;<a class="link" href="#mkvpropedit.description.add">add</a>&#12289;<a class="link" href="#mkvpropedit.description.set">set</a>&#21450;&#12403;<a class="link" href="#mkvpropedit.description.delete">delete</a>&#12450;&#12463;&#12471;&#12519;&#12531;&#12364;&#36969;&#29992;&#12373;&#12428;&#12427;<span class="productname">Matroska</span>&#8482;&#12501;&#12449;&#12452;&#12523;&#12475;&#12463;&#12471;&#12519;&#12531;(&#12475;&#12464;&#12513;&#12531;&#12488;&#24773;&#22577;&#12414;&#12383;&#12399;&#29305;&#23450;&#12398;&#12488;&#12521;&#12483;&#12463;&#12504;&#12483;&#12480;)&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;&#12371;&#12428;&#12399;&#27425;&#12398;<a class="link" href="#mkvpropedit.description.edit"><code class="option">--edit</code></a>&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#35211;&#20184;&#12363;&#12427;&#12414;&#12391;&#12378;&#12387;&#12392;&#26377;&#21177;&#12391;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12408;&#12398;&#24341;&#25968;&#12399;&#12456;&#12487;&#12451;&#12483;&#12488;&#12475;&#12524;&#12463;&#12479;&#12392;&#21628;&#12400;&#12428;&#12414;&#12377;&#12290;
  </p><div class="refsect2" title="&#12475;&#12464;&#12513;&#12531;&#12488;&#24773;&#22577;"><a name="mkvpropedit.edit_selectors.segment_info"></a><h3>&#12475;&#12464;&#12513;&#12531;&#12488;&#24773;&#22577;</h3><p>
    &#12475;&#12464;&#12513;&#12531;&#12488;&#24773;&#22577;&#12399;&#27425;&#12398;3&#12388;&#12398;&#21336;&#35486;&#12395;&#12424;&#12387;&#12390;&#36984;&#25246;&#12373;&#12428;&#12414;&#12377;&#12290;'<code class="literal">info</code>'&#12289;'<code class="literal">segment_info</code>'&#12414;&#12383;&#12399;'<code class="literal">segmentinfo</code>'&#12391;&#12377;&#12290;&#12371;&#12428;&#12399;&#12475;&#12464;&#12513;&#12531;&#12488;&#12479;&#12452;&#12488;&#12523;&#12420;&#12475;&#12464;&#12513;&#12531;&#12488;<abbr class="abbrev">UID</abbr>&#12394;&#12393;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#26684;&#32013;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
   </p></div><div class="refsect2" title="&#12488;&#12521;&#12483;&#12463;&#12504;&#12483;&#12480;"><a name="mkvpropedit.edit_selectors.track_headers"></a><h3>&#12488;&#12521;&#12483;&#12463;&#12504;&#12483;&#12480;</h3><p>
    &#12488;&#12521;&#12483;&#12463;&#12504;&#12483;&#12480;&#12399;&#12418;&#12358;&#12385;&#12423;&#12387;&#12392;&#12384;&#12369;&#35079;&#38609;&#12394;&#12475;&#12524;&#12463;&#12479;&#12391;&#36984;&#25246;&#12373;&#12428;&#12414;&#12377;&#12290;&#20840;&#12390;&#12398;&#22580;&#21512;&#12391;&#12475;&#12524;&#12463;&#12479;&#12399;'<code class="literal">track:</code>'&#12391;&#22987;&#12414;&#12426;&#12414;&#12377;&#12290;&#12488;&#12521;&#12483;&#12463;&#12504;&#12483;&#12480;&#12503;&#12525;&#12497;&#12486;&#12451;&#12395;&#12399;&#12289;&#35328;&#35486;&#12467;&#12540;&#12489;&#12289;'&#12487;&#12501;&#12457;&#12523;&#12488;&#12488;&#12521;&#12483;&#12463;'&#12501;&#12521;&#12464;&#12420;&#12488;&#12521;&#12483;&#12463;&#21517;&#12398;&#12424;&#12358;&#12394;&#12456;&#12524;&#12513;&#12531;&#12488;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
   </p><div class="variablelist"><dl><dt><span class="term"><code class="option">track:</code><em class="parameter"><code>n</code></em></span></dt><dd><p>
       &#12497;&#12521;&#12513;&#12540;&#12479;<em class="parameter"><code>n</code></em>&#12364;&#25968;&#23383;&#12391;&#12354;&#12428;&#12400;&#12289;<em class="parameter"><code>n</code></em>&#30058;&#30446;&#12398;&#12488;&#12521;&#12483;&#12463;&#12364;&#36984;&#25246;&#12373;&#12428;&#12414;&#12377;&#12290;&#12488;&#12521;&#12483;&#12463;&#12398;&#38918;&#30058;&#12399;&#12289;<span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12395;<code class="option">--identify</code>&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#20986;&#21147;&#12373;&#12428;&#12427;&#12418;&#12398;&#12392;&#21516;&#12376;&#12391;&#12377;&#12290;
      </p></dd><dt><span class="term"><code class="option">track:</code><em class="parameter"><code>t</code></em><em class="parameter"><code>n</code></em></span></dt><dd><p>
       &#12497;&#12521;&#12513;&#12540;&#12479;&#12364;&#19968;&#25991;&#23383;&#12398;&#33521;&#23383;<em class="parameter"><code>t</code></em>&#12391;&#22987;&#12414;&#12426;&#12289;&#27425;&#12395;<em class="parameter"><code>n</code></em>&#12364;&#32154;&#12367;&#22580;&#21512;&#12289;&#12354;&#12427;&#12488;&#12521;&#12483;&#12463;&#12479;&#12452;&#12503;&#12391;<em class="parameter"><code>n</code></em>&#30058;&#30446;&#12398;&#12488;&#12521;&#12483;&#12463;&#12364;&#36984;&#25246;&#12373;&#12428;&#12414;&#12377;&#12290;&#12488;&#12521;&#12483;&#12463;&#12479;&#12452;&#12503;&#12497;&#12521;&#12513;&#12540;&#12479;<em class="parameter"><code>t</code></em>&#12399;&#12289;&#12458;&#12540;&#12487;&#12451;&#12458;&#12488;&#12521;&#12483;&#12463;&#12434;&#31034;&#12377;'<code class="literal">a</code>'&#12289;&#12508;&#12479;&#12531;&#12488;&#12521;&#12483;&#12463;&#12434;&#31034;&#12377;'<code class="literal">b</code>'&#12289;&#23383;&#24149;&#12488;&#12521;&#12483;&#12463;&#12434;&#31034;&#12377;'<code class="literal">s</code>'&#12289;&#12499;&#12487;&#12458;&#12488;&#12521;&#12483;&#12463;&#12434;&#31034;&#12377;'<code class="literal">v</code>'&#12398;&#22235;&#12388;&#12398;&#12358;&#12385;&#12398;&#19968;&#12388;&#12391;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;&#12488;&#12521;&#12483;&#12463;&#12398;&#38918;&#30058;&#12399;<span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12398;<code class="option">--identify</code>&#12458;&#12503;&#12471;&#12519;&#12531;&#12391;&#20986;&#21147;&#12373;&#12428;&#12427;&#38918;&#30058;&#12392;&#21516;&#12376;&#12391;&#12377;&#12290;
      </p></dd><dt><span class="term"><code class="option">track:</code>=<em class="parameter"><code>uid</code></em></span></dt><dd><p>
       &#12497;&#12521;&#12513;&#12540;&#12479;&#12364;'<code class="literal">=</code>'&#12391;&#22987;&#12414;&#12426;&#12289;&#27425;&#12395;<em class="parameter"><code>uid</code></em>&#12364;&#32154;&#12367;&#22580;&#21512;&#12399;&#12289;&#12488;&#12521;&#12483;&#12463;<abbr class="abbrev">UID</abbr>&#12456;&#12524;&#12513;&#12531;&#12488;&#12364;<em class="parameter"><code>uid</code></em>&#12398;&#12488;&#12521;&#12483;&#12463;&#12364;&#36984;&#25246;&#12373;&#12428;&#12414;&#12377;&#12290;&#12488;&#12521;&#12483;&#12463;<abbr class="abbrev">UID</abbr>&#12399;<span class="citerefentry"><span class="refentrytitle">mkvinfo</span>(1)</span>&#12391;&#21462;&#24471;&#12391;&#12365;&#12414;&#12377;&#12290;
      </p></dd><dt><span class="term"><code class="option">track:</code>@<em class="parameter"><code>number</code></em></span></dt><dd><p>
       &#12497;&#12521;&#12513;&#12540;&#12479;&#12364;'<code class="literal">@</code>'&#12391;&#22987;&#12414;&#12426;&#12289;&#27425;&#12395;<em class="parameter"><code>number</code></em>&#12364;&#32154;&#12367;&#22580;&#21512;&#12399;&#12289;&#12488;&#12521;&#12483;&#12463;&#12490;&#12531;&#12496;&#12540;&#12456;&#12524;&#12513;&#12531;&#12488;&#12364;<em class="parameter"><code>number</code></em>&#12392;&#31561;&#12375;&#12356;&#12488;&#12521;&#12483;&#12463;&#12364;&#36984;&#25246;&#12373;&#12428;&#12414;&#12377;&#12290;&#12488;&#12521;&#12483;&#12463;&#12490;&#12531;&#12496;&#12540;&#12399;<span class="citerefentry"><span class="refentrytitle">mkvinfo</span>(1)</span>&#12391;&#21462;&#24471;&#12391;&#12365;&#12414;&#12377;&#12290;
      </p></dd></dl></div></div><div class="refsect2" title="&#27880;&#24847;"><a name="mkvpropedit.edit_selectors.notes"></a><h3>&#27880;&#24847;</h3><p>
    &#12488;&#12521;&#12483;&#12463;&#12456;&#12487;&#12451;&#12483;&#12488;&#12475;&#12524;&#12463;&#12479;&#12398;&#24615;&#36074;&#12363;&#12425;&#12289;&#12356;&#12367;&#12388;&#12363;&#12398;&#12475;&#12524;&#12463;&#12479;&#12364;&#21516;&#12376;&#12488;&#12521;&#12483;&#12463;&#12504;&#12483;&#12480;&#12395;&#12510;&#12483;&#12481;&#12377;&#12427;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#12424;&#12358;&#12394;&#22580;&#21512;&#12289;&#12381;&#12428;&#12425;&#12398;&#12456;&#12487;&#12451;&#12483;&#12488;&#12475;&#12524;&#12463;&#12479;&#12408;&#12398;&#20840;&#12390;&#12398;&#12450;&#12463;&#12471;&#12519;&#12531;&#12399;&#19968;&#12388;&#12395;&#12414;&#12392;&#12417;&#12425;&#12428;&#12289;&#12467;&#12510;&#12531;&#12489;&#12521;&#12452;&#12531;&#12395;&#25351;&#23450;&#12373;&#12428;&#12383;&#38918;&#30058;&#12395;&#23455;&#34892;&#12373;&#12428;&#12414;&#12377;&#12290;
   </p></div></div><div class="refsect1" title="&#20363;"><a name="mkvpropedit.examples"></a><h2>&#20363;</h2><p>
   &#19979;&#12395;'<code class="literal">movie.mkv</code>'&#12392;&#12356;&#12358;&#12501;&#12449;&#12452;&#12523;&#12434;&#32232;&#38598;&#12377;&#12427;&#20363;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#20363;&#12391;&#12399;&#12289;&#12475;&#12464;&#12513;&#12531;&#12488;&#12479;&#12452;&#12488;&#12523;&#12434;&#35373;&#23450;&#12375;&#12289;&#12458;&#12540;&#12487;&#12451;&#12458;&#12488;&#12521;&#12483;&#12463;&#12392;&#23383;&#24149;&#12488;&#12521;&#12483;&#12463;&#12398;&#35328;&#35486;&#12467;&#12540;&#12489;&#12434;&#20462;&#27491;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#20363;&#12399;&#12289;&#26368;&#21021;&#12398;<a class="link" href="#mkvpropedit.description.edit"><code class="option">--edit</code></a>&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#35211;&#20184;&#12363;&#12427;&#21069;&#12398;&#20840;&#12390;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#32080;&#23616;&#12475;&#12464;&#12513;&#12531;&#12488;&#24773;&#22577;&#12456;&#12524;&#12513;&#12531;&#12488;&#12434;&#32232;&#38598;&#12377;&#12427;&#12398;&#12391;&#12289;&#26368;&#21021;&#12398;<a class="link" href="#mkvpropedit.description.edit"><code class="option">--edit</code></a>&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#30465;&#30053;&#12375;&#12390;&#30701;&#32302;&#12391;&#12365;&#12427;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </p><pre class="screen">
$ mkvpropedit movie.mkv --edit info --set "title=The movie" --edit track:a1 --set language=fre --edit track:a2 --set language=ita
  </pre><p>
   &#20108;&#30058;&#30446;&#12398;&#20363;&#12399;&#12289;&#26368;&#21021;&#12398;&#23383;&#24149;&#12488;&#12521;&#12483;&#12463;&#12363;&#12425;'&#12487;&#12501;&#12457;&#12523;&#12488;&#12488;&#12521;&#12483;&#12463;&#12501;&#12521;&#12464;'&#12434;&#21066;&#38500;&#12375;&#20108;&#30058;&#30446;&#12398;&#23383;&#24149;&#12488;&#12521;&#12483;&#12463;&#12395;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;<span class="citerefentry"><span class="refentrytitle">mkvpropedit</span>(1)</span>&#12399;<span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>&#12392;&#12399;&#36949;&#12356;&#12289;'&#12487;&#12501;&#12457;&#12523;&#12488;&#12488;&#12521;&#12483;&#12463;&#12501;&#12521;&#12464;'&#12364;&#36949;&#12358;&#12488;&#12521;&#12483;&#12463;&#12391;'1'&#12395;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#12363;&#12425;&#12392;&#12356;&#12387;&#12390;&#33258;&#21205;&#30340;&#12395;&#20182;&#12398;&#12488;&#12521;&#12483;&#12463;&#12398;'&#12487;&#12501;&#12457;&#12523;&#12488;&#12488;&#12521;&#12483;&#12463;&#12501;&#12521;&#12464;'&#12434;'0'&#12395;&#35373;&#23450;&#12399;&#12375;&#12394;&#12356;&#12289;&#12392;&#12356;&#12358;&#28857;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </p><pre class="screen">
$ mkvpropedit movie.mkv --edit tracks:s1 --set flag-default=0 --edit tracks:s2 --set flag-default=1
  </pre></div><div class="refsect1" title="&#36820;&#12426;&#20516;"><a name="id585646"></a><h2>&#36820;&#12426;&#20516;</h2><p>
   <span class="citerefentry"><span class="refentrytitle">mkvpropedit</span>(1)</span>&#12399;&#19979;&#12398;3&#12388;&#12398;&#36820;&#12426;&#20516;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;
  </p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p>
     <code class="constant">0</code> -- &#12371;&#12398;&#36820;&#12426;&#20516;&#12399;&#22793;&#26356;&#12364;&#25104;&#21151;&#12375;&#12383;&#12371;&#12392;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;
    </p></li><li class="listitem"><p>
     <code class="constant">1</code> -- &#12371;&#12398;&#36820;&#12426;&#20516;&#12399;&#12289;&#19968;&#12388;&#20197;&#19978;&#12398;&#35686;&#21578;&#12364;&#20986;&#21147;&#12373;&#12428;&#12414;&#12375;&#12383;&#12364;&#12289;&#25277;&#20986;&#12364;&#32154;&#34892;&#12373;&#12428;&#12383;&#12371;&#12392;&#12434;&#24847;&#21619;&#12375;&#12414;&#12377;&#12290;&#35686;&#21578;&#12399;
'<code class="literal">&#35686;&#21578;:</code>'
&#12392;&#12356;&#12358;&#25991;&#23383;&#21015;&#12434;&#20808;&#38957;&#12395;&#12388;&#12369;&#12390;&#20986;&#21147;&#12373;&#12428;&#12414;&#12377;&#12290;&#20986;&#21147;&#12501;&#12449;&#12452;&#12523;&#12364;&#28961;&#20107;&#12391;&#12354;&#12427;&#12363;&#12393;&#12358;&#12363;&#12399;&#12289;&#22580;&#21512;&#12395;&#12424;&#12426;&#12414;&#12377;&#12290;&#20986;&#21147;&#12501;&#12449;&#12452;&#12523;&#12434;&#30906;&#35469;&#12377;&#12427;&#12371;&#12392;&#12434;&#24375;&#12367;&#25512;&#22888;&#12375;&#12414;&#12377;&#12290;
    </p></li><li class="listitem"><p>
     &#12371;&#12398;&#36820;&#12426;&#20516;&#12399;&#12289;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12289;&#12456;&#12521;&#12540;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#34920;&#31034;&#12375;&#12383;&#30452;&#24460;&#12395;<span class="citerefentry"><span class="refentrytitle">mkvpropedit</span>(1)</span>&#12364;&#32066;&#20102;&#12375;&#12383;&#12371;&#12392;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;&#12456;&#12521;&#12540;&#12513;&#12483;&#12475;&#12540;&#12472;&#12399;&#19981;&#27491;&#12394;&#12467;&#12510;&#12531;&#12489;&#12521;&#12452;&#12531;&#12420;&#12501;&#12449;&#12452;&#12523;I/O&#12456;&#12521;&#12540;&#12289;&#22730;&#12428;&#12383;&#12501;&#12449;&#12452;&#12523;&#12394;&#12393;&#27096;&#12293;&#12391;&#12377;&#12290;
    </p></li></ul></div></div><div class="refsect1" title="&#38306;&#36899;&#38917;&#30446;"><a name="mkvpropedit.seealso"></a><h2>&#38306;&#36899;&#38917;&#30446;</h2><p>
   <span class="citerefentry"><span class="refentrytitle">mkvmerge</span>(1)</span>, <span class="citerefentry"><span class="refentrytitle">mkvinfo</span>(1)</span>, <span class="citerefentry"><span class="refentrytitle">mkvextract</span>(1)</span>, <span class="citerefentry"><span class="refentrytitle">mmg</span>(1)</span>
  </p></div><div class="refsect1" title="&#12454;&#12455;&#12502;"><a name="mkvpropedit.www"></a><h2>&#12454;&#12455;&#12502;</h2><p>
   &#26368;&#26032;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12399;&#12289;&#24120;&#26178;<a class="ulink" href="http://www.bunkus.org/videotools/mkvtoolnix/" target="_top">MKVToolNix&#12398;&#12507;&#12540;&#12512;&#12506;&#12540;&#12472;</a>&#12363;&#12425;&#21462;&#24471;&#12391;&#12365;&#12414;&#12377;&#12290;
  </p></div></div></body></html>
